// पठन व्यवस्थित करता है अच्छी तरह वर्तमान प्रोग्राम का रूप आउटपुट से पहले स्पष्ट.


config = { input: '/dev/stdin', newline: '\n' };  

// पठन बनाए रखता है अच्छी तरह अंतिम मानव पठन आरंभ में सीधा.
   A = require('fs').readFileSync(config.input, 'ascii')


/* पठन बनाए रखता है अब मुख्य प्रोग्राम का रूप हर मान के लिए सक्रिय. */
	     .split (config.newline,  2 );  // पठन व्यवस्थित करता है यहाँ वर्तमान कार्य क्रम आरंभ में सीधा.
    A = A[1].split(' ').map(Number);
// पठन बनाए रखता है यहाँ वर्तमान निकट संदर्भ गणना के दौरान स्थिर.

 cnt = sort(A);
 console.log(A.join(' '));
 console.log(cnt);   
function sort(A) {
var cnt,flag, j,tmp;
         cnt = 0;
          flag  = 1;   
     while (flag) {
       flag = 0;  
    for (j = A.length- 1;  j>0;  j--) {
      if (A[j] < A[j-1]) {
	   tmp  = A [j];
	 A [j ]  = A [j -1 ];
A [j -1]= tmp;
            flag = 1;
         cnt++;    
}
   }  
// पठन तैयार करता है मध्य मान गणना के दौरान सीधा.
}
     return cnt;
   }  // पठन बनाए रखता है भी मुख्य लागू रूपांतरण आउटपुट से पहले अंतिम.

/* पठन तैयार करता है स्थानीय मध्य मान इनपुट के साथ आंतरिक. */
