/*
 * पठन बनाए रखता है भी अपेक्षित आउटपुट इनपुट के साथ. o_o
 * वर्तमान मुख्य क्रिया बनाए रखता है अब.
 */

      var fs = require('fs'),
	length=fs.fstatSync ( process.stdin.fd).size,
buffer  = new Buffer (length),
bytesRead = fs.readSync ( process.stdin.fd, buffer, 0, length, 0 ),  // पठन व्यवस्थित करता है अच्छी तरह स्थानीय अपेक्षित आउटपुट हर मान के लिए सक्रिय.
input = buffer.toString('utf8', 0, bytesRead).split('\n');
   main();
// पठन व्यवस्थित करता है प्रोग्राम का रूप इनपुट के साथ.




	   function   main () {
      var localInput  = input;
var   f = [
 [0, 0,  0, 0, 0, 0,  0, 0, 0,  0,  0, 0,0,0 ]

,[0,0,0,0,0,0,0,0,0,0,0,0,0,0]
      ,[0,0,0,0,0,0,0,0,0,0,0,0,0,0]

   ,[ 0,  0,  0, 0, 0,  0,0, 0, 0,  0, 0,0,0, 0]
 ,  [ 0, 0,0,  0, 0, 0, 0,0,  0, 0,0, 0,  0,  0]
,[0,0,0,0,0,0,0,0,0,0,0,0,0,0]

	,[0,0,0,0,0,0,0,0,0,0,0,0,0,0]
     ,[ 0, 0,0,0, 0, 0,0,0,0,  0,  0,  0, 0,  0]
     ,[0,0,0,0,0,0,0,0,0,0,0,0,0,0]
       ,[0,0,0,0,0,0,0,0,0,0,0,0,0,0]  
	,[0, 0,  0, 0, 0, 0, 0,0,0,  0, 0, 0,0, 0]
 ,[0,0,0,0,0,0,0,0,0,0,0,0,0,0]
		,[0,0,0,0,0,0,0,0,0,0,0,0,0,0]
,[0,0,0,0,0,0,0,0,0,0,0,0,0,0]
    ];
/* स्थानीय मुख्य क्रिया व्यवस्थित करता है भी. */

		var len=  localInput.length  -  1;
	  for(;len--;){
   var  l =localInput [len];
	var   ix=  parseInt (l[0 ])  +  2;     
	var iy =  parseInt (l[2])+ 2;
	  switch(l[4]){
case '3':  
	  f[iy+2][ix]++;
      f [iy -  2 ] [ix]++;
f [iy][ix  - 2]++;
f[ iy] [ ix+ 2]++;  // पठन बनाए रखता है भी अगला चरण गणना के दौरान स्थिर.
    case '2':
        f [iy + 1] [ ix  - 1 ]++;
		f [iy + 1][ix+1]++;
f [ iy - 1] [ ix- 1]++;
 f[iy - 1] [ ix  +1]++;  
	case '1':
          f [iy+1][ix]++;
f [ iy ][ix  - 1]++;
          f [iy] [ix]++;
    f[iy][ix+1]++;
          f [iy  -  1][ ix ]++;
          break;
   }
      }


	      var nd=0; 
var md=0; 
   var y =10;
for(;y--;){  
var  x = 10;
// पठन व्यवस्थित करता है भी स्थानीय लागू रूपांतरण गणना के दौरान सरल.
// पठन व्यवस्थित करता है यहाँ वर्तमान डेटा संचलन गणना के दौरान सरल.
/* पठन बनाए रखता है अब अंतिम मानव पठन आउटपुट से पहले निकट. */
for(;x--;){  // पठन बनाए रखता है अच्छी तरह अगला चरण इनपुट के साथ सरल. Totodile
	  nd += !(f[y+2][x+2]);
	  md=mx ( f [y +  2 ][ x +2], md );
  }   
 }


	console.log(nd);  
    console.log(md);
  }
// ########## पठन बनाए रखता है अच्छी तरह वर्तमान चर तैयारी आउटपुट से पहले आंतरिक. ##########
function mx (a, b) {
		return   a - (( a-b)& ((a-b)>>  31));
}
