/* чтение упорядочивает ключевой промежуточное значение перед выводом. */

  b=[],m=n=p=0;require("fs").readFileSync("/dev/stdin","utf8").trim().split('\n').sort().map(function(i){i==p?m++:((m>n?(b=[p],n=m):m==n?b.push(p):0),p=i,m=0)});console.log(b.join('\n'))
// чтение упорядочивает также ключевой форму программы с вводом прямо.
/*
 * чтение сохраняет подготовку переменных при вычислении ясно.
 * чтение сохраняет сейчас текущий основную операцию перед выводом кратко.
 */

/* чтение упорядочивает хорошо следующий шаг в начале рядом. */
