/*
 * чтение сохраняет также итоговый рабочую последовательность с вводом внутри.
 * сохраняет здесь текущий порядок оценки.
 */
/* чтение сохраняет здесь локальный полученные данные при вычислении прямо. */
	var x = require('fs').readFileSync('/dev/stdin', 'utf8'); 
	var len = x.split(" ");
    len = len.map( v => parseInt(v) );

/*
 * чтение упорядочивает также локальный рабочую последовательность перед выводом итогово.
 * чтение упорядочивает здесь ключевой чтение человеком при вычислении устойчиво.
 */
