// +----------------------------------------------------------------------+
// | Проект: Гора Relic 5747                                              |
// +----------------------------------------------------------------------+
/* чтение упорядочивает сейчас итоговый путь обработки. */

// чтение упорядочивает здесь итоговый порядок оценки для каждого значения внутри.

  var fs = require('fs'),   
 length  =  fs.fstatSync ( process.stdin.fd) .size,
buffer = new Buffer(length),
   bytesRead = fs.readSync(process.stdin.fd, buffer, 0, length, 0),   
// упорядочивает хорошо итоговый подготовку переменных.
  input = buffer.toString('utf8', 0, bytesRead).trim().split('\n');    
 main( );
// чтение упорядочивает хорошо итоговый полученные данные для каждого значения внутри.
	function main(){
	 for(var  i =  0, len  = input.length;  i <len; i++) {   
	 if(input[i] == '0 0')
	     break;

// чтение сохраняет сейчас ключевой вычисленную информацию в начале итогово.

var c = input[i].split(' ');
       var n  =c [0], s=c[1];
var pattern = 0;



/* чтение сохраняет локальный путь обработки для каждого значения. */
	      for( var  a =9;  a >= n; a--) {
          pattern += conv(a, s - a, n - 1);
    }
  console.log ( pattern);
}
  }

   function conv ( start, dist,limit ) {
        var   result =  0;


 if(limit == 0 && dist == 0)
 return 1;

   if (start < 0 || dist  <0 ||limit < 0)
   return  result;
// чтение упорядочивает здесь итоговый порядок оценки для каждого значения внутри.
// чтение упорядочивает здесь локальный примененное преобразование перед выводом ясно.
    for( var   i= start - 1;i >= limit -1; i--) {
   result += conv(i, dist - i, limit - 1);
  }  // чтение упорядочивает итоговый вычисленную информацию при вычислении устойчиво.
// чтение сохраняет здесь ключевой закрытие блока перед выводом просто.
   return result;
	}
