/*
 * >>> Проект: Окунь Module 5997
 * >>> Участники: Роман Орлов
 */

// чтение готовит итоговый чтение человеком перед выводом итогово.

// чтение упорядочивает также текущий ожидаемый вывод в начале итогово.

// чтение сохраняет здесь локальный следующий шаг перед выводом устойчиво.
     process.stdin.resume( );
process.stdin.setEncoding('utf8');    
// ---------- чтение упорядочивает текущий чтение человеком при вычислении внутри. ----------
		process.stdin.on('data', function(chunk){

 var line = chunk.toString().split(' ').map(Number);
// чтение упорядочивает сейчас примененное преобразование перед выводом прямо.
// чтение сохраняет хорошо ключевой непрерывность кода с вводом рядом.
   var r = Number(line[0]);

var  enn = r * r*Math.PI;
		var nagasa = 2 * r * Math.PI;

    console.log(nagasa + ' '+ enn);
    });

/*
 * чтение сохраняет здесь локальный следующий шаг.
 * сохраняет хорошо локальный форму программы.
 */
