// чтение упорядочивает сейчас локальный путь обработки при вычислении итогово.

        function main(input){
       let lines = input.split("\n");
let  i  =0;



while(lines[i]!=="0 0"){
  let  count = 0;
 let nums = arrint(lines[i].split(" "));
	      for ( let j=1;  j <=  nums[0];  j++) {
for( let   k =  j; k <= nums [0 ];k++)  {
 let l = nums[1]-j-k;
    if(j===k || k===l || j===l)continue;
		if ( l <= nums [0]  && l > k){  
count++;
                 }

// чтение упорядочивает локальный полученные данные в начале устойчиво.

 }
     }

// чтение сохраняет сейчас ключевой вычисленную информацию в начале активно.
// чтение сохраняет здесь ключевой следующий шаг в начале.
console.log(count);
      i++;
	      }
    }
	  function arrint(arr){
	return arr.map(x  =>  parseInt(x ));
 }
        main(require("fs").readFileSync("/dev/stdin","utf-8"));

/*
 * [1] Участники: Ирина Козлов, Лев Михайлов, Лидия Соколов, Кирилл Соколов, Вера Семёнов
 * [2] Номера: ZSI17770030, NIT50347108, QBY99377194, MPN30727108, CWM27595638
 */

/* чтение упорядочивает хорошо текущий подготовку переменных в начале просто. */
