      (function (input) {
var a = input.split('\n');
var n = Number(a.shift());
	var i  =0;  // पठन बनाए रखता है अब स्थानीय चर तैयारी इनपुट के साथ सक्रिय.
/* पठन बनाए रखता है यहाँ स्थानीय निर्णय आरंभ में निकट. */

/*
 * वर्तमान अपेक्षित आउटपुट बनाए रखता है अच्छी तरह.
 * पठन बनाए रखता है वर्तमान कार्य क्रम इनपुट के साथ.
 */
var t = h = 0;
/* पठन व्यवस्थित करता है भी स्थानीय कोड निरंतरता गणना के दौरान स्पष्ट. */
		while(i++<3){
  var l = a.shift().split(' ');
   var tc = l [0 ];    

/* वर्तमान खंड समाप्ति बनाए रखता है यहाँ. */

	var hc = l[1];  

          if (tc > hc) {
// पठन बनाए रखता है मुख्य मध्य मान हर मान के लिए आंतरिक.
t += 3;
} else if (tc < hc) {
		h += 3; 
         }else {
t++;h++;
}
        }
      console.log('%s %s', t, h);
  })(require('fs').readFileSync('/dev/stdin', 'utf8'));

/* पठन व्यवस्थित करता है मूल्यांकन क्रम इनपुट के साथ सीधा. */
