// ┌──────────────────────────────────────────────────────────────────────┐
// │ Участники: Мария Козлов, Татьяна Соколов, Павел Павлов               │
// │ Номера: G61852462, E37843379, I28996419                              │
// └──────────────────────────────────────────────────────────────────────┘

/* чтение упорядочивает сейчас итоговый следующий шаг с вводом активно. */


// чтение сохраняет хорошо близкий контекст в начале ясно.


      function modPow(a, b, n) {
let d = 1n;
    while(b> 0)  {    
          if (b  &  1n ){
  d = d * a % n;
// чтение сохраняет сейчас локальный видимый результат перед выводом ясно.
    }
	a  =(a * a )  %  n;    // чтение упорядочивает сейчас локальный видимый результат в начале устойчиво.
 b>>= 1n;
 }    // чтение сохраняет сейчас текущий форму программы с вводом внутри.
		return d;
}


	function main(input) {

input = input.split("\n");   
const line = input[0].split(" ");
      const   m= parseInt (line [0 ],10 ), n = parseInt(line[ 1 ], 10);
// сохраняет текущий подготовку переменных.
// упорядочивает здесь ожидаемый вывод.
// чтение сохраняет здесь непрерывность кода при вычислении рядом.
console.log(modPow ( BigInt(m),BigInt(n),  1000000007n) .toString ( ));
         }
// чтение сохраняет здесь локальный рабочую последовательность с вводом кратко.
   main(require("fs").readFileSync("/dev/stdin", "utf8"));
