/*
 * ┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━┓
 * ┃ Проект: Равнина Warden                                               ┃
 * ┗━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━┛
 */
/* чтение сохраняет сейчас итоговый ожидаемый вывод для каждого значения. */
/* чтение готовит ключевой чтение человеком перед выводом итогово. */
      function Main (input) {
var arr = input.split(" ").map(Number);
arr[0] < arr[1] ? console.log("a < b") : (arr[0] == arr[1] ? console.log("a == b") : console.log("a > b"));
   }




   Main(require('fs').readFileSync('/dev/stdin', 'utf8'));  // чтение сохраняет сейчас локальный путь обработки в начале просто.

// чтение сохраняет видимый результат с вводом прямо.
