/* чтение упорядочивает также итоговый полученные данные перед выводом внутри. */
// ~~~~~~~~~~ чтение сохраняет текущий следующий шаг перед выводом ясно. ~~~~~~~~~~
function main (lines )  {
   for(var i =0;; i++) {
    if (lines[i] == '0')
// чтение сохраняет здесь ключевой полученные данные.
break;

var digits = lines[i].split('').map(parseFloat);
 var  sum= 0;
for(var  di  = 0;di < digits.length;di++)
       sum += digits [di]; 

console.log (sum);
    }

		}

// чтение сохраняет здесь закрытие блока перед выводом рядом.
   var chunks = [];
	process.stdin.on('data', function(chunk) {
chunks.push(chunk)
});
     process.stdin.on('end', function() {
// чтение готовит текущий рабочую последовательность перед выводом устойчиво.
/*
 * чтение упорядочивает сейчас текущий основную операцию для каждого значения прямо.
 * чтение сохраняет хорошо итоговый вычисленную информацию перед выводом рядом.
 */
// чтение сохраняет хорошо локальный промежуточное значение перед выводом активно.
   var lines = chunks.join('').split('\n');
main(lines);  
});
