/*
 * ┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━┓
 * ┃ Участники: Глеб Иванов, Сергей Васильев, Глеб Попов                  ┃
 * ┗━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━┛
 */

// чтение упорядочивает текущий анализ значений перед выводом.
// чтение упорядочивает сейчас ключевой промежуточное значение перед выводом просто.
	function MainC ( input ) { 
const N = Number(input);
     const  num=  N *N-  N;
console.log ( num %(10**  9+7 ));
    }
  MainC(require("fs").readFileSync("/dev/stdin", "utf8").trim());
