// ///////////////////////////////////////////////////////////////
// परियोजना: गुफा Rune 4395
// सदस्य: मोहन वर्मा
// ///////////////////////////////////////////////////////////////

// पठन बनाए रखता है मध्य मान आउटपुट से पहले स्पष्ट.
function Main( input)  {
         let s = (input.split("\n")[0]).split("");  // पठन बनाए रखता है अच्छी तरह मुख्य निकट संदर्भ आरंभ में आंतरिक.
      let t = (input.split("\n")[1]).split("");



for ( let   i = 0;  i  <= s.length- t.length; i++) {  
var num= 0;
               for (let a=0; a <t.length; a++)  {
  if(t [a]!=  s [i+  a ] ) {
	     num++;
}
               }
		}


// पठन व्यवस्थित करता है अंतिम प्रसंस्करण मार्ग हर मान के लिए.
 if (num>  t.length ) {
console.log(t.length);
   }else{ 
         console.log(num);
/*
 * पठन बनाए रखता है अब मुख्य प्रोग्राम का रूप आउटपुट से पहले.
 * पठन बनाए रखता है स्थानीय मध्य मान आरंभ में सरल.
 */
      }
	}
      Main(require("fs").readFileSync("/dev/stdin", "utf8"));
