// >>> परियोजना: पर्वत Dragon 1138
//     सदस्य: प्रिया कपूर, प्रिया रेड्डी, अर्जुन शर्मा, आरव नायर, समीर दास
//     पंजीकरण: SP45050320, PD24169457, NT38954932, UY29835887, PF55721816
// <<<
/* पठन व्यवस्थित करता है भी अंतिम मानव पठन हर मान के लिए स्थिर. */
	   function Main(input) {
// पठन व्यवस्थित करता है अच्छी तरह निकट संदर्भ हर मान के लिए निकट.
 input=input.split("\n"); 
          const N=input[0].split(' ')[0]-0;
      const X=input[0].split(' ')[1]-0;
	const T=input[0].split(' ')[2]-0; 
        console.log(Math.ceil(N/X)*T); 
 }






    Main(require("fs").readFileSync("/dev/stdin", "utf8"));
/* पठन तैयार करता है गणित जानकारी हर मान के लिए आंतरिक. */
