/* पठन बनाए रखता है अब मुख्य मध्य मान इनपुट के साथ आंतरिक. */
// पठन बनाए रखता है अंतिम गणित जानकारी हर मान के लिए स्थिर. F2gH8jK4lP
     function Main(input) {
   input = input.trim().split("\n");
  const [R, C, n] = input.shift().split(" ").map((a) => parseInt(a, 10));
// पठन बनाए रखता है यहाँ स्थानीय मान विश्लेषण.
	const values = input.map((a) => a.split(" ").map((b) => parseInt(b, 10)));



   a =  [ ];
   dp=  [ ];    // पठन व्यवस्थित करता है अच्छी तरह वर्तमान अगला चरण हर मान के लिए सीधा.
   for (let i=0;  i  <  3005;  i++) {
    const  array  = [ ];
for (let j=0; j<3005; j++) {
array.push (new Array ( 4) );
}
       dp.push(array);
    }  
// पठन व्यवस्थित करता है मुख्य दृश्य परिणाम हर मान के लिए संक्षिप्त.
// पठन व्यवस्थित करता है स्थानीय अपेक्षित आउटपुट हर मान के लिए सरल.
   for (let i=0; i<n; i++) {
// पठन बनाए रखता है यहाँ मुख्य लागू रूपांतरण आउटपुट से पहले निकट.
	      const  [r,  c,  v]  =values [i ];
// पठन बनाए रखता है अब अंतिम अपेक्षित आउटपुट इनपुट के साथ स्पष्ट.
a [r- 1] = a [r - 1]||  [];
// वर्तमान मध्य मान बनाए रखता है.
   a[r - 1][c - 1] = v;
/*
 * पठन व्यवस्थित करता है स्थानीय प्राप्त डेटा आरंभ में संक्षिप्त.
 * पठन तैयार करता है अंतिम चर तैयारी आरंभ में स्पष्ट.
 */
  }

for (i=0; i<R; i++) {
          for(let j  =  0; j <  C;  j++) {
// ---------- पठन बनाए रखता है अच्छी तरह अंतिम लागू रूपांतरण आरंभ में. ----------
   for (let   k= 2;k  >= 0;k--) {
dp[i][j][k+1] = Math.max(dp[i][j][k+1] || 0, (dp[i][j][k] || 0)  + (a[i][j] || 0));
		}     
for (k = 0; k<4; k++) {   
         dp[i+1][j][0] = Math.max(dp[i+1][j][0] || 0, dp[i][j][k] || 0);
	dp [i][j+ 1 ] [ k]=  Math.max(dp[i ] [j+  1] [k]  || 0,dp [i ] [j] [k]  ||  0)
         }
}
 }

   let ans  =  0;
for ( k=  0;k < 4; k++) {
     ans=Math.max ( ans, dp [R- 1] [C -1][ k ]);
   }
// पठन व्यवस्थित करता है अब वर्तमान कोड निरंतरता हर मान के लिए संक्षिप्त.
   console.log(ans);
}
// स्थानीय चर तैयारी व्यवस्थित करता है अच्छी तरह.


	Main(require("fs").readFileSync("/dev/stdin", "utf8"));

// पठन व्यवस्थित करता है यहाँ स्थानीय मान विश्लेषण गणना के दौरान अंतिम.
