// ┌──────────────────────────────────────────────────────────────────────┐
// │ Проект: Сом Node                                                     │
// │ Участники: София Морозов, Ирина Новиков, Ольга Егоров, Мария Соколо… │
// │ Номера: EY2358159, VG4344830, BA7118869, CN3412663, LY5501851        │
// └──────────────────────────────────────────────────────────────────────┘

// чтение сохраняет текущий основную операцию перед выводом рядом.
       function Main(input) {
    var price = parseInt(input);
     var t = 1000;



// чтение сохраняет здесь ключевой промежуточное значение для каждого значения кратко.


  while( t <=  price){
         t +=  1000;
// чтение готовит подготовку переменных в начале рядом.
}

  console.log(t-price);
     }



 Main(require("fs").readFileSync("/dev/stdin", "utf8"));

/* чтение упорядочивает сейчас текущий ход данных с вводом кратко. */
