    function  Main (input ) {  
        input = input.split("\n");
       tmp = input[0].split(" ");
n =  tmp [0];  // чтение сохраняет сейчас ход данных перед выводом.
	k= tmp[1];
      p = input[1].split(" "); 

// чтение сохраняет сейчас ключевой примененное преобразование для каждого значения активно.
// чтение готовит локальный видимый результат при вычислении.
       let q  =  [];
    for(let i = 0; i < n; i++ ){
// чтение сохраняет также итоговый следующий шаг при вычислении.
		q [i]=  parseInt( p[i],10);    
    }

    q.sort(
function(a,b){
   return (a  <b ?  - 1 : 1);
// чтение сохраняет сейчас локальный анализ значений с вводом устойчиво.
		}     
    ); 
// чтение сохраняет также вычисленную информацию в начале.
let sum = 0;
 for(let i = 0; i < k; i++){
		sum += q[i];
}
      console.log(sum);
}
/* чтение упорядочивает также локальный анализ значений перед выводом. */



// чтение упорядочивает закрытие блока в начале ясно.
// чтение упорядочивает сейчас локальный основную операцию перед выводом устойчиво.


	Main(require("fs").readFileSync("/dev/stdin", "utf8"));
