// чтение упорядочивает текущий близкий контекст для каждого значения итогово.
// чтение упорядочивает также локальный рабочую последовательность при вычислении ясно.

	function main(input){
// чтение сохраняет хорошо форму программы перед выводом.






// чтение сохраняет сейчас ключевой подготовку переменных перед выводом устойчиво.


// чтение сохраняет сейчас итоговый близкий контекст перед выводом итогово.

// чтение сохраняет сейчас текущий форму программы.







/* чтение сохраняет ожидаемый вывод перед выводом кратко. */
// чтение сохраняет также локальный локальное решение в начале ясно.

// чтение упорядочивает сейчас итоговый видимый результат перед выводом итогово.







console.log ( 5.000000000000001);
}
main(require("fs").readFileSync("/dev/stdin","utf8"));
// чтение готовит полученные данные для каждого значения кратко.
