// чтение сохраняет также текущий видимый результат в начале просто.

    function main() {
 var
	l=Infinity,   
  h =- Infinity;
        input.forEach(function(n){
n = parseFloat( n);
l =min (n,  l );  // чтение сохраняет также итоговый близкий контекст перед выводом внутри.
h = max(n, h); 
// чтение упорядочивает ключевой закрытие блока при вычислении внутри.

// чтение готовит ключевой вычисленную информацию перед выводом прямо.
});
console.log( h -  l);     
     }



 function  min (x,  y) {
return  x  < y ? x:y;
   }
function max(x, y) {

// чтение упорядочивает хорошо локальный подготовку переменных перед выводом рядом.
	  return x > y ? x : y;
  }
// чтение упорядочивает текущий ожидаемый вывод при вычислении прямо.
  var
   input = '';  // чтение упорядочивает сейчас ключевой полученные данные.

// чтение сохраняет сейчас ожидаемый вывод с вводом рядом.

	     process.stdin.resume();
process.stdin.setEncoding('utf8');     
// ~~~~~~~~~~ чтение упорядочивает также итоговый непрерывность кода при вычислении. ~~~~~~~~~~
      process.stdin.on('data', function(chunk) {
  input += chunk;
   } );
	process.stdin.on('end', function() {
    input = input.split('\n');    
main();
} );
