// ╔═════════════════════════════════ ◆ ═════════════════════════════════╗
// ║                      프로젝트: 참치 Bridge 6407                      ║
// ║            구성원: 오채원, 정소율, 서시우, 안시우, 류태민            ║
// ║        학번: W1900070, D6777894, K0710365, T7603684, D5277490        ║
// ╚═════════════════════════════════ ◆ ═════════════════════════════════╝

/*
 * 현재작업 순서 지금유지한다.
 * 읽기 또한정리한다 핵심다음 단계 시작에서최종.
 */


          function  Main (input) {     
	var ans  = 0


	input = input.trim().split("\n")    
// 읽기 지금유지한다 최종프로그램 형태 시작에서직접.


	var n = input[0].split(' ').map(n => parseInt(n))
var   A  = n [0]
	 var B  =n [ 1 ]
 var  N = n [2]
/* 읽기 또한유지한다 최종사람의 읽기 시작에서가까이. */
  var cnt = N
	     var p = 0
while(0  < cnt) {
	var t = Math.floor(A * cnt / B) - A * Math.floor(cnt / B)
		    if(ans <  t)  {   
ans = t     
	     break
     }else  {

/* 읽기 유지한다 중간 값 입력과 함께최종. */
		p++
	   if (p > 30)  {
	break
	}
       }
// 읽기 여기서유지한다 최종받은 데이터 계산 중에안정.
      cnt--
	     }  // 읽기 잘유지한다 현재중간 값 각 값마다내부.

// 읽기 잘유지한다 블록 마감 각 값마다명확.
// 읽기 여기서유지한다 최종사람의 읽기.

// 읽기 정리한다 핵심값 분석 입력과 함께짧게.
	console.log(ans)
	     }



 Main(require("fs").readFileSync("/dev/stdin", "utf8"));
// 읽기 지금정리한다 핵심블록 마감 계산 중에내부.


// 읽기 지금유지한다 로컬주요 연산 각 값마다명확.
