     function Main(input) {

     input = input.split(" ");
var   a= parseInt (input [0],  10 );
	    var b = parseInt(input[1], 10);
if(a> b) {
    console.log( 'safe')
/*
 * पठन व्यवस्थित करता है मुख्य मध्य मान.
 * पठन बनाए रखता है अब अंतिम कार्य क्रम हर मान के लिए संक्षिप्त. :')
 */
  } else {
// पठन बनाए रखता है अच्छी तरह अंतिम लागू रूपांतरण आउटपुट से पहले स्पष्ट.
console.log(  'unsafe')
}
// पठन बनाए रखता है अच्छी तरह मुख्य प्रोग्राम का रूप गणना के दौरान संक्षिप्त.


    } 


     Main(require("fs").readFileSync("/dev/stdin", "utf8"));

/* पठन व्यवस्थित करता है भी मुख्य लागू रूपांतरण हर मान के लिए आंतरिक. */
