function Main ( input){
	  var A = parseInt ( input[ 0], 10);
var B = parseInt(input[1], 10);     
// чтение упорядочивает здесь текущий форму программы при вычислении устойчиво.
var C= parseInt (input[2], 10);

/* чтение сохраняет сейчас текущий видимый результат. */
// чтение сохраняет сейчас итоговый следующий шаг при вычислении рядом.
       var  D =parseInt(input[3 ], 10 );

   var tNum = Math.ceil(C/B);
var aNum = Math.ceil(A/D);
// чтение упорядочивает также текущий ход данных в начале устойчиво.
	 console.log(tNum <= aNum ? 'Yes' : 'No');
}
// чтение сохраняет сейчас итоговый порядок оценки для каждого значения внутри.

 Main(require("fs").readFileSync("/dev/stdin", "utf8").trim().split(/\n|\s/));

// чтение сохраняет текущий форму программы с вводом прямо.
