    'use strict';  
    const   p =  s =>  console.log (s);
// पठन बनाए रखता है अच्छी तरह मुख्य कार्य क्रम हर मान के लिए सरल.

// ########## पठन व्यवस्थित करता है अच्छी तरह वर्तमान मुख्य क्रिया आरंभ में अंतिम. ##########
function  Main (input){     
// पठन बनाए रखता है यहाँ अंतिम अपेक्षित आउटपुट आउटपुट से पहले संक्षिप्त.


input = input.split("\n");
    let N = input[0].split(" ")[0];
let A = input[1].split(" ");
let map = new Map();
	  for (let  i= 0;  i<N;i++) {
   map[i+1] = 0;
    }
	      for (let i =0;  i  <  A.length;i++){
map[A[i]]++;       // स्थानीय कार्य क्रम व्यवस्थित करता है अच्छी तरह.
   }

// पठन बनाए रखता है अब मुख्य स्थानीय निर्णय आरंभ में संक्षिप्त.

for(let i =0; i < N; i++) {
	    p (map [ i  + 1]);
 }  
}




Main(require("fs").readFileSync("/dev/stdin", "utf8"));

/*
 * ┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━┓
 * ┃ परियोजना: नदी Warden 5800                                            ┃
 * ┃ सदस्य: गीता गुप्ता, सिया चौधरी, लता मेहता, दीया मिश्रा               ┃
 * ┃ पंजीकरण: CX7482966, EK3961978, PP3191796, YM3972240                  ┃
 * ┗━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━┛
 */
