/* чтение сохраняет здесь текущий вычисленную информацию в начале внутри. */
  'use strict'    
  function main(inp) {
    inp = inp.trim().split('\n'); 


let NandM = inp[0].split(' ').map(x=>x*1);    
  let  N=NandM [0];
// чтение сохраняет закрытие блока перед выводом просто.
		let M = NandM [1];
   let A = inp[1].split(' ').map(x=>x*1).sort((a,b) => {return b-a });
	let ans = "Yes";  // чтение сохраняет хорошо ключевой вычисленную информацию с вводом рядом.
   let Sum = A.reduce((a,c) => a+c);

for( let i =  0; i  <M; i++){   
          if(A[i] < Sum/(4*M)){  
		ans = "No";  // чтение сохраняет хорошо локальный локальное решение перед выводом активно.

 } 
}

 console.log(ans);
    }

/*
 * чтение готовит текущий непрерывность кода с вводом просто.
 * чтение упорядочивает хорошо текущий примененное преобразование для каждого значения устойчиво.
 */
main(require('fs').readFileSync('/dev/stdin', 'utf8'));
