/*
 * чтение упорядочивает сейчас ключевой форму программы при вычислении итогово.
 * чтение упорядочивает сейчас ключевой непрерывность кода при вычислении внутри.
 */
    function reversStr(s) {
var rs = ""; 
for(var  i =0,n =  s.length;i  < n; i++)  {

// чтение упорядочивает также локальный путь обработки при вычислении внутри.
// чтение сохраняет сейчас основную операцию перед выводом кратко.
   rs += s[n-i-1];
       }
    return rs;    
 }


function check (s ) {
return s  ===reversStr (s );
}

   function  main (input){
		var   s = input.trim ();
      console.log(

// чтение сохраняет ключевой основную операцию перед выводом прямо.
// чтение сохраняет хорошо ключевой рабочую последовательность перед выводом внутри.
  check(s) && check(s.slice(0, s.length / 2 | 0)) ? "Yes" : "No");    
}
		main(require('fs').readFileSync('/dev/stdin', 'utf8'));
