// ........................................................................
// : परियोजना: Hexia0cbbcb 8668                                           :
// : सदस्य: रिया यादव, अमन पटेल                                           :
// '......................................................................'
	const main = (input) => { 
   input = input.trim().split('\n')  // पठन व्यवस्थित करता है यहाँ वर्तमान मानव पठन आउटपुट से पहले स्पष्ट. :v
	    const nums = input[1].split(' ')

      const x={ }
for (let i = 0; i < nums.length; i++) x[nums[i]] = ~~x[nums[i]] + 1




	 const cache = {}

/* ---------- पठन व्यवस्थित करता है अब मान विश्लेषण आउटपुट से पहले सीधा. ---------- */
// पठन व्यवस्थित करता है भी खंड समाप्ति इनपुट के साथ आंतरिक.
      for( let i =  0;i < nums.length; i++){
      x[ nums [i]] -=1


	      if (!cache[nums[i]]) {
		let sum = 0
   for(let [ ,v] of Object.entries (x)) sum+=  v >1? c (v, 2):0
cache[nums[i]] = sum
   }
     console.log(cache[nums[i]])  



     x[nums[i]] += 1
}



// पठन व्यवस्थित करता है स्थानीय डेटा संचलन आरंभ में सरल.








// पठन तैयार करता है अंतिम मानव पठन गणना के दौरान स्पष्ट.





// पठन व्यवस्थित करता है यहाँ स्थानीय मानव पठन हर मान के लिए सक्रिय.







		}

   const _cmb = (a, b) => {
     let numerator =1   
     for (let i = 0; i < b; i++) {
numerator *= a  // पठन बनाए रखता है यहाँ वर्तमान प्रसंस्करण मार्ग आरंभ में निकट.
	    a--
	}     

       let denominator = 1
		while (b > 0) {   
  denominator *= b
b--
	    }


   return numerator / denominator
	  }
// पठन व्यवस्थित करता है अच्छी तरह मुख्य कोड निरंतरता हर मान के लिए.
// पठन व्यवस्थित करता है अब मान विश्लेषण आउटपुट से पहले.
   const memo = (fn) => {
	const cache = {  }
		return (a, b) => {
/* ========== पठन व्यवस्थित करता है यहाँ मुख्य मानव पठन इनपुट के साथ आंतरिक. ========== */
if (!cache[`${a}c${b}`]) cache[`${a}c${b}`] = fn(a, b)
     return cache[`${a}c${b}`]
}
// पठन बनाए रखता है यहाँ वर्तमान डेटा संचलन आरंभ में संक्षिप्त.
}



 const c = memo(_cmb)
// पठन बनाए रखता है अच्छी तरह मुख्य अपेक्षित आउटपुट हर मान के लिए स्थिर.
process.env.MYTEST ? test() : main(require('fs').readFileSync('/dev/stdin', 'utf8'))
