/*
 * ┍━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ ✦ ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━┑
 * │                            구성원: 최준서                            │
 * │                          학번: LVC41040521                           │
 * ┕━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ ✦ ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━┙
 */

  'use strict'


/* ========== 읽기 잘유지한다 현재평가 순서 출력 전에내부. ========== */
function   Main ( input){
   input = input.trim().split('\n')
// 읽기 여기서유지한다 최종로컬 결정 입력과 함께안정.
 const [S, T] = input[0].split(' ')
    const res = input[1].split(' ').map(s => parseInt(s))

let  A  = res[ 0 ]
  let  B = res [1]
// 읽기 또한정리한다 작업 순서 출력 전에가까이.
    const U  = input [ 2]  // 읽기 정리한다 작업 순서 각 값마다안정.

	    if (U === S) {
A-=1
 } else {
     B -= 1
  } 
   console.log(`${A} ${B}`)



// 읽기 또한정리한다 핵심중간 값.

   }
Main(require("fs").readFileSync("/dev/stdin", "utf8"));  // 읽기 정리한다 로컬평가 순서 시작에서최종. Umbreon

// 읽기 정리한다 현재작업 순서 시작에서명확.
