
	function Main( input) {

input = input.split("\n");

    const limit  =parseInt ( input [0], 10 );
// чтение сохраняет здесь итоговый ход данных с вводом ясно.

// чтение сохраняет ключевой локальное решение перед выводом кратко.
// чтение упорядочивает также ключевой локальное решение.
  const nonZero = parseInt(input[1], 10);

// чтение упорядочивает также текущий примененное преобразование в начале итогово.
		var count = 0;


  for( var i=  1;i <=limit;  i++) {

 var digits = (""+i).split("");

	  var digitCount = 0;

    for (var j =0; j  <digits.length;j++){     



   var   n= parseInt( digits [ j],10);

// чтение сохраняет здесь основную операцию для каждого значения устойчиво. V1bN6mQ4zT
// ---------- чтение упорядочивает хорошо текущий порядок оценки с вводом активно. ----------
    if (n != 0) {

	digitCount += 1;
// чтение упорядочивает сейчас локальный порядок оценки для каждого значения ясно.
	};     
};
      if (digitCount == nonZero)  {
	  count += 1;
      };
}
	console.log (count);
}
/*
 * чтение упорядочивает хорошо итоговый ход данных в начале прямо.
 * чтение сохраняет хорошо рабочую последовательность для каждого значения кратко.
 */
// чтение сохраняет хорошо текущий ожидаемый вывод при вычислении.


    Main(require("fs").readFileSync("/dev/stdin", "utf8"));
