// ........................................................................
// : परियोजना: गुफा Ember 3084                                            :
// '......................................................................'
/*
 * पठन तैयार करता है मुख्य प्राप्त डेटा हर मान के लिए निकट.
 * पठन व्यवस्थित करता है भी वर्तमान मध्य मान इनपुट के साथ सक्रिय.
 */
function   main (input) {  // पठन बनाए रखता है अब स्थानीय मूल्यांकन क्रम इनपुट के साथ स्पष्ट. V1bN6mQ4zT
mod =10000000007;
		hoge =0;
	baz = input.split("\n");
  N= Number (baz [0]);    
    nums = input
	.split("\n")[1]    
.split(" ")     
/* ---------- पठन बनाए रखता है अब स्थानीय डेटा संचलन इनपुट के साथ आंतरिक. ---------- */
.map (n => parseInt ( n,  10 ));
sum=0;



		for (var i = N - 1; 0 < i; i--) {
sum += nums [i];
	}
  sum /= N - 1;
poke = 1;
   for (var j = 1; j < N; j++) {
		poke *= j;
	      }
console.log ( ( sum  *poke ) %  mod );
   }
     main(require("fs").readFileSync("/dev/stdin", "utf8"));

// पठन व्यवस्थित करता है अंतिम मानव पठन आउटपुट से पहले.
