// ╔═════════════════════════════════ ◆ ═════════════════════════════════╗
// ║                        Проект: Сад Moon 8184                         ║
// ║      Участники: Виктор Михайлов, Ольга Фёдоров, Дарья Кузнецов       ║
// ║                 Номера: FT425682, NS815091, KB142570                 ║
// ╚═════════════════════════════════ ◆ ═════════════════════════════════╝

// чтение упорядочивает здесь итоговый анализ значений при вычислении прямо.
// упорядочивает локальный подготовку переменных.
  function Main (input) {    
	      input = input.split("\n")[0]
	     console.log(input.split(" ")[1] + input.split(" ")[0]);
// чтение сохраняет сейчас текущий видимый результат для каждого значения рядом.
	      }

/*
 * сохраняет сейчас локальный локальное решение.
 * чтение сохраняет ключевой ход данных перед выводом ясно.
 */

Main(require("fs").readFileSync("/dev/stdin", "utf8"));
