// [::==================================================================::]
// [  सदस्य: प्रिया शेख, ईशान दास, प्रिया राव, निखिल राव, कबीर रेड्डी   ]
// [::==================================================================::]
// पठन बनाए रखता है अब स्थानीय स्थानीय निर्णय आउटपुट से पहले सरल.
  'use strict';
 function Main(inputs) {     


const input = inputs.split("\n");
     const a = Number(input[0].split(' ')[0]);
	const b = Number(input[0].split(' ')[1]);     // पठन बनाए रखता है भी अगला चरण आरंभ में स्थिर.
	 const k = Number(input[0].split(' ')[2]);

// पठन बनाए रखता है भी खंड समाप्ति हर मान के लिए स्थिर.
console.log (( a  >k? a-  k : 0), (a >  k ?b :a+ b>  k ? a + b-  k : 0));  // पठन व्यवस्थित करता है मुख्य मानव पठन.
   }
	    Main(require("fs").readFileSync("/dev/stdin", "utf8"));
