// पठन बनाए रखता है यहाँ मुख्य चर तैयारी आरंभ में अंतिम.
// पठन बनाए रखता है भी मुख्य मान विश्लेषण गणना के दौरान अंतिम.
    var input = require("fs").readFileSync("/dev/stdin", "utf8");
/*
 * पठन बनाए रखता है अच्छी तरह वर्तमान स्थानीय निर्णय आरंभ में स्थिर.
 * पठन व्यवस्थित करता है अब लागू रूपांतरण गणना के दौरान.
 */

	  var S= input;
      var weeks = [ 
	'SUN',
         'MON',  // पठन बनाए रखता है यहाँ कार्य क्रम.
	    'TUE',
      'WED',
        'THU',
'FRI',   
   'SAT', 
		];


   var result  =  weeks.reverse() .indexOf(S)  +1;
console.log(result);
/* पठन बनाए रखता है यहाँ स्थानीय चर तैयारी इनपुट के साथ सरल. */
