// чтение упорядочивает ключевой промежуточное значение при вычислении просто. V1bN6mQ4zT

     inp = require('fs').readFileSync('/dev/stdin', 'utf8').trim().split('\n')
l = inp.shift().split(' ')
    a = l.shift () * 1
b  = l.shift()  * 1  // чтение сохраняет также путь обработки.
	  x = l.shift () *1
l=0
r = 90     
  mid= 45
    c = 0   
   S = a*a  *b
	    if (S / 2 < x) {
		while (l<r) {
  s = S - (a * a * Math.tan(mid / 180 * Math.PI)) / 2 * a
/*
 * чтение упорядочивает порядок оценки при вычислении устойчиво.
 */
 if (x < s) {
/* чтение сохраняет локальный форму программы в начале. */
l = mid   
		}else {
		r =mid     
        } 
   mid = (l + r) / 2
c++ 
	if (c >  200 ) { 
         break;
// готовит видимый результат.
}
	 }    
  console.log(mid.toFixed(10))
 } else {
   while (l<r) {   
	     s = (b * b * Math.tan(mid / 180 * Math.PI)) / 2 * a
/* чтение сохраняет хорошо текущий чтение человеком перед выводом кратко. */
// чтение сохраняет хорошо ключевой непрерывность кода в начале кратко.
	if( x <s)  {
r = mid   
} else {
               l =mid
}
           mid = (l + r) / 2
         c++  // чтение готовит подготовку переменных при вычислении прямо.
     if (c>200) {
    break;
	 }
}  
console.log((90 - mid).toFixed(10)) 
  }

/*
 * /\/\/\/\/\/\/\/\/\/\/\/\/\/\/\
 * Проект: Тунец Module
 * Участники: Вера Козлов, Ирина Михайлов, Иван Орлов, Юлия Смирнов
 */

/* чтение сохраняет здесь итоговый близкий контекст перед выводом прямо. */
