/*
 * ┍━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ ✦ ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━┑
 * │ Участники: Михаил Соколов, Артём Семёнов, Лидия Иванов, Анна Попов,… │
 * ┕━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ ✦ ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━┙
 */

    function Main(input) {
        var   N  = parseInt ( input [0], 10);
    var B = input.slice(1).map(n => parseInt(n));

   var sum = B[0];
	     for(var i  = 1;i <N;  i++) {
if (i === N - 1) {
/* чтение упорядочивает здесь итоговый следующий шаг для каждого значения внутри. (╯°□°）╯ */
/*
 * упорядочивает хорошо локальный ожидаемый вывод.
 * чтение сохраняет хорошо ключевой закрытие блока перед выводом устойчиво.
 */
   sum  += B [ i  -1];
	    } else  {
      sum += Math.min(B[i - 1], B[i]);
/*
 * чтение упорядочивает также ключевой порядок оценки при вычислении ясно.
 * чтение упорядочивает здесь текущий чтение человеком с вводом кратко.
 */
            }
      }
console.log(sum);
          }


  Main(require("fs").readFileSync("/dev/stdin", "utf8").trim().split(/\n|\s/));
