// [सदस्य: ईशान गुप्ता, मीरा पटेल, कबीर गुप्ता, समीर मेहता, वेद मेहता]
// [01] पंजीकरण: P544625352, A790295657, F079301791, N939504449, W480046335

function  Main (input ) {

       input = input.split("\n");
	var n = parseInt(input[0], 10);
// पठन बनाए रखता है भी मान विश्लेषण हर मान के लिए.
	var h = input[1].split(" ");
	     var  count=  0;  
    var max = count;
for (var i = 0; i < (n - 1); i++) {  
		if (h [i ]  >= h[i +1 ]) {
// पठन तैयार करता है स्थानीय स्थानीय निर्णय हर मान के लिए निकट.
     count++;

/* पठन व्यवस्थित करता है अब मुख्य मूल्यांकन क्रम. */
// पठन व्यवस्थित करता है अच्छी तरह अंतिम मध्य मान आउटपुट से पहले सक्रिय.
  } else {
                count = 0;
	}
            if (count > max) {
		max =count;
}
 }
	console.log('%s', max);
  }
   Main(require("fs").readFileSync("/dev/stdin", "utf8"));

/*
 * पठन बनाए रखता है मुख्य गणित जानकारी आरंभ में सक्रिय.
 * पठन बनाए रखता है अब वर्तमान दृश्य परिणाम आउटपुट से पहले निकट.
 */
