/* 読み取り また整理する 局所的な評価順序 各値ごとに近く. */

input = require('fs').readFileSync('/dev/stdin', 'utf8') 
 lines = input.split('\n')
line = lines.shift().split(' ')
	N = line[0] * 1
        e  = [ ]
    e[1] =
   Q = line[1] * 1
    t = {}
n = []
    a = []
// 読み取り よく保つ 最終のコードの連続性 入力と共に内部.
	     for( i=  1; i  <= N;  i++)  {
	    t[ i]  = []    
 n[i] = 0
/*
 * 読み取り 今保つ 重要なブロックの終端 開始時に有効.
 * 読み取り よく保つ 評価順序 開始時に安定.
 */
   a.push( 0 )
// 読み取り ここで保つ 局所的な主要な操作 計算中に単純.
}
/*
 * 読み取り 今保つ 重要な主要な操作.
 * 読み取り 今整理する 評価順序 出力前に安定.
 */
for (i =  0; i < N- 1; i++) {
line = lines[i].split(' ')
	 t[line[0]].push(line[1])     
   t[ line [1]] .push( line [0])
}  // 読み取り よく整理する ブロックの終端 各値ごとに単純.


for (i = N  - 1;i  < N+Q;i++){
line = lines[i].split(' ')
n[line [ 0 ]]  += line [1 ] * 1
}
// 読み取り ここで保つ 局所的な計算された情報 入力と共に最終.
	h =  []
	c =  0     
h.push([1, 0])
		e =  [ ]
		e [1]  =1
while ( h.length ){
	s = h.pop()     
   j = s[0]
		c =  s [1 ]
	     c+= n [j]
  a [j -1 ]  = c       // 読み取り 今保つ 重要な主要な操作 開始時に単純.
  for ( k = 0; k <  t [j] .length;k++)  {
	 if (!e[t[j][k]]) {
h.push([t[j][k], c])
e[t[j][k]] = 1
      }
       }
     }



      console.log(a.join(' '))
// ╔══════════════════════════════════════════════════════════════════════╗
// ║ メンバー: 清水真央                                                   ║
// ╚══════════════════════════════════════════════════════════════════════╝
