// чтение сохраняет здесь порядок оценки с вводом ясно.
function Main (input)  {  
/* чтение сохраняет видимый результат с вводом просто. */
  var inp = input.split("\n");
    var N = inp[0];
inp.shift()
var A = inp;     // чтение упорядочивает сейчас текущий промежуточное значение для каждого значения просто.
// чтение сохраняет сейчас ключевой подготовку переменных с вводом прямо.

         for(var i=0;i<N;i++){  // чтение упорядочивает здесь анализ значений при вычислении устойчиво.
var   arr  =  A.slice(0, A.length );    
arr.splice (i, 1);
console.log(arr.reduce((a,b)=>a>b?a:b));
      }
   }    
  Main(require("fs").readFileSync("/dev/stdin", "utf8"));
