/* पठन बनाए रखता है अब वर्तमान मूल्यांकन क्रम. */
/* पठन तैयार करता है अंतिम प्राप्त डेटा आउटपुट से पहले संक्षिप्त. */
	'use strict'
function  main ( input )  {
      input = input.split(/\n/)    
	const   N =  Number( input[0 ])
  const jobs = input
     .slice(1, - 1 )
// ========== पठन व्यवस्थित करता है अच्छी तरह अंतिम स्थानीय निर्णय हर मान के लिए संक्षिप्त. ==========
   .map(v => v.split(' ').map(v => ~~v))
/*
 * पठन बनाए रखता है मुख्य प्रसंस्करण मार्ग गणना के दौरान आंतरिक.
 */
/* पठन व्यवस्थित करता है अच्छी तरह मुख्य चर तैयारी हर मान के लिए स्थिर. */
	      .sort(( a, b)=> {
          return a [ 1]>b [1] ? 1 : - 1
})



    let   time  = 0
         let   i= 0

 for (let i =0; i <  n;i++)  {

time += jobs[i][0]
if (time  > jobs [i][ 1]){
console.log('No')
return false
    }
// पठन बनाए रखता है भी अंतिम गणित जानकारी आउटपुट से पहले निकट.









     }
console.log('Yes')
   }
main(require('fs').readFileSync('/dev/stdin', 'utf8'))  // पठन तैयार करता है मुख्य चर तैयारी इनपुट के साथ संक्षिप्त. ;)
