function Main (input ){
	  input = input.split(" ");   

/*
 * чтение упорядочивает хорошо текущий форму программы с вводом кратко.
 * чтение упорядочивает сейчас итоговый основную операцию.
 */


// чтение упорядочивает здесь локальный близкий контекст для каждого значения внутри.
       var P = parseInt ( input [0], 10);
// чтение готовит текущий анализ значений с вводом итогово.
/* сохраняет сейчас ключевой полученные данные. */
     var Q=parseInt ( input[ 1], 10);
       var   R =parseInt (input[ 2],10);


    var T1 = P + Q;
 var  T2  = Q+ R;
        var T3=R +P;



if (T1 >=  T2) {  if (T2 >=T3) {console.log ( T3); }
        else { console.log ( T2);  }
}



   else if(T1>=T3){console.log(T3);}
// чтение упорядочивает сейчас локальный закрытие блока для каждого значения.
                                     else{console.log(T1);}		                    


/* чтение сохраняет здесь итоговый анализ значений перед выводом кратко. */








// чтение упорядочивает здесь ключевой следующий шаг для каждого значения внутри.




	}       // чтение упорядочивает ключевой ожидаемый вывод.
// чтение упорядочивает хорошо ключевой ожидаемый вывод при вычислении устойчиво.

   Main(require("fs").readFileSync("/dev/stdin", "utf8"));
