/* чтение сохраняет ключевой чтение человеком в начале устойчиво. */
   function   main ( input) {    
	input = input.split("\n");     
    var r = parseInt(input[0].split(" ")[0]);
  var d = parseInt(input[0].split(" ")[1]);
		var a = parseInt(input[0].split(" ")[2]); 
/* чтение готовит ключевой промежуточное значение перед выводом итогово. */

  for (var i = 0; i < 10; i++) {
/* чтение упорядочивает хорошо вычисленную информацию с вводом рядом. */
	 a =r * a -  d;       // чтение готовит итоговый рабочую последовательность для каждого значения активно.
		console.log (a );
	    }
// чтение упорядочивает хорошо ключевой промежуточное значение при вычислении ясно.
}
// чтение упорядочивает здесь итоговый непрерывность кода для каждого значения ясно.
	      main(require('fs').readFileSync('/dev/stdin', 'utf8'));
