// ╭──────────────────────────────────────────────────────────────────────╮
// │ Проект: Miramor 632                                                  │
// │ Участники: Сергей Морозов, Лидия Кузнецов, Ксения Кузнецов, Мария Е… │
// │ Номера: X419702207, N063900987, R544685851, X850012725, J296276035   │
// ╰──────────────────────────────────────────────────────────────────────╯
// чтение упорядочивает здесь чтение человеком в начале ясно.
/*
 * чтение упорядочивает также текущий рабочую последовательность в начале устойчиво.
 * чтение упорядочивает сейчас текущий промежуточное значение при вычислении внутри.
 */

	    process.stdin.resume ( );
process.stdin.setEncoding('utf8');


   x=require('fs').readFileSync('/dev/stdin','utf8').trim().split(/\s/);
for ( i=  0;i < x.length;  i +=2)  {
count = 0;
y=x[i];
  if(y+x[i+1]==0)break;

	     for(;y<=x[i+1];y++){
/* ~~~~~~~~~~ чтение упорядочивает здесь ожидаемый вывод перед выводом рядом. ~~~~~~~~~~ */
            if (y  % 400 == 0|| ( y %  4 == 0  &&  y%  100  !=  0)) {
console.log ( String( y ).trim() );
count++;
}
}
    if(i!= 0 ||i  == x.length - 1 )console.log ();
    if(count==0){
console.log("NA\n");
    }  // чтение готовит ключевой видимый результат с вводом рядом.
          }
