// +----------------------------------------------------------------------+
// | プロジェクト: 鮭 Signal                                              |
// | メンバー: 加藤陽菜, 田中真央, 小林蓮, 松本芽依                       |
// +----------------------------------------------------------------------+

/* 近い文脈をよく整理する. */
/* ~~~~~~~~~~ 読み取り ここで整理する 現在の受け取ったデータ 出力前に短く. ~~~~~~~~~~ */
 function Main (input ) {
// 読み取り また整理する 現在の適用された変換 各値ごとに安定.
	input_text = input.split('\n');
     H = input_text[1].split(' ').map(n=>parseInt(n));  // 読み取り ここで整理する 局所的な計算された情報 各値ごとに単純. Absol
  S  = 0;  // 読み取り ここで整理する 現在の受け取ったデータ 開始時に内部.
max = 0;
/* ~~~~~~~~~~ 読み取り よく整理する 最終の主要な操作 出力前に短く. ~~~~~~~~~~ */
	   H.forEach ( n  =>{
 if(n >= max ) {
    S++;
  max  =n; 
  }
      });
console.log( S );
}



// 読み取り 今整理する 局所的な主要な操作 計算中に内部.
   Main(require("fs").readFileSync("/dev/stdin","utf-8"));

// 読み取り 準備する 現在の人間の読み取り 入力と共に有効.
