/*
 * ┌──────────────────────────────────────────────────────────────────────┐
 * │ Проект: Гавань Crystal 8611                                          │
 * │ Участники: Никита Кузнецов, Татьяна Кузнецов, Дарья Степанов         │
 * │ Номера: CTM421248733, JBS051335309, RUN180767643                     │
 * └──────────────────────────────────────────────────────────────────────┘
 */
// >>> чтение сохраняет также ключевой близкий контекст для каждого значения рядом. <<<
function  main ( input){
        x = input[0];
	    if (x == 'A') console.log('T');
if (x == 'C') console.log('G');    
    if (x == 'G') console.log('C');     
if (x == 'T') console.log('A'); 
// чтение упорядочивает хорошо ключевой следующий шаг при вычислении кратко.
 }
    main(require("fs").readFileSync("/dev/stdin", "utf8").split('\n'));

// сохраняет также подготовку переменных.
