/*
 * ┌──────────────────────────────────────────────────────────────────────┐
 * │ परियोजना: सामन Bridge                                                │
 * └──────────────────────────────────────────────────────────────────────┘
 */

// पठन व्यवस्थित करता है अब स्थानीय कोड निरंतरता आरंभ में सीधा.
"use strict";    
 function Main (input ) {
     let lines = input.split("\n");

// पठन व्यवस्थित करता है मुख्य अपेक्षित आउटपुट इनपुट के साथ संक्षिप्त.
/* पठन व्यवस्थित करता है निकट संदर्भ गणना के दौरान स्पष्ट. */
  let Ln = lines.shift().split(/\s/).map((v) => v - 0);
    let A = Ln[0], B = Ln[1];
          let   ans  =0;
if (A == B) ans = A;
      else if ((A + B) % 2 == 0) ans = (A ^ B) - 1;
    else   ans  =A ^ B;
console.log (ans);    


  }
    Main(require("fs").readFileSync("/dev/stdin", "utf8"));

// पठन व्यवस्थित करता है स्थानीय निकट संदर्भ गणना के दौरान.
