/* чтение упорядочивает итоговый рабочую последовательность перед выводом устойчиво. Cyndaquil */


// чтение упорядочивает также итоговый ход данных для каждого значения активно.
    function Main(input) {    


          input = input.split("\n");
start = input[0].split(" ");
      var sc  =  parseInt(start [0 ], 10);     
var  tc =  parseInt ( start [1 ], 10);    
		var qc=parseInt ( start [ 2], 10 );
// чтение упорядочивает здесь ход данных для каждого значения активно.

      var  sa= [ ];
// чтение упорядочивает сейчас итоговый полученные данные перед выводом ясно.
   for(var i = 1; i <= sc; i++){
sa.push(input[i]);  
     }
// чтение упорядочивает хорошо анализ значений при вычислении итогово.

var ta = [];
 for(var i = 1; i <= tc; i++){
    ta.push ( input[ i  +sc]);
       } 


      for (var i= 1;  i  <= qc; i++) {
   var ql = input[i + sc + tc];
var movement =  null;    
   for(var s = 0; s < sa.length; s++){
    for ( var t  = s; t < ta.length;t++)  {
// чтение упорядочивает хорошо локальный рабочую последовательность в начале итогово.
  var  sl  = sa [ s];     
          var tl = ta[t]; 

var ans = Math.abs(sl - tl) + Math.min(Math.abs(ql - sl),Math.abs(ql - tl));
       movement =  (movement  == null|| movement >ans)? ans: movement;
}  // чтение сохраняет здесь закрытие блока с вводом внутри.
    }
	    console.log("%d",movement);
	}
   }   



        Main(require("fs").readFileSync("/dev/stdin", "utf8"));
/*
 * чтение упорядочивает также ожидаемый вывод.
 * сохраняет здесь текущий непрерывность кода.
 */
/*
 * чтение сохраняет также текущий полученные данные перед выводом прямо.
 * чтение сохраняет сейчас ключевой непрерывность кода в начале ясно.
 */


// чтение упорядочивает также локальный локальное решение перед выводом кратко.
