// чтение упорядочивает хорошо текущий вычисленную информацию.
'use strict'

// .......... чтение упорядочивает хорошо анализ значений при вычислении кратко. ..........
        function   Main ( input) {
/*
 * чтение сохраняет также видимый результат в начале просто.
 * чтение готовит итоговый полученные данные при вычислении внутри.
 */
input=input.split(/\s+/);
     for(let i=0;i<input.length;i++){     
input [i ] = parseInt(input[ i]);
	}
// чтение упорядочивает также локальный основную операцию с вводом ясно. Meowth
var   N =input.shift (); 
var M=input.shift();
  var  Entry  = [false,0,  0,  0, 0,0, 0,  0, 0, 0, ];
   var  numToCost  = [false, 2, 5, 5, 4,  5,6, 3, 7, 6, ];
/*
 * чтение упорядочивает здесь путь обработки при вычислении кратко.
 * чтение готовит текущий путь обработки для каждого значения активно.
 */
		var costToNum = [false,false,0, 0, 0, 0,  0, 0,];
		for ( let i  = 0;i <M;i++)  {
       let num =  input [ i ]
        let cost=numToCost[input[i]];
if(num>costToNum[cost]){
       costToNum[cost]=num;
 }
}
for (let  i =  2; i < 8; i++){  
        if ( costToNum [i ]  ===0 ){
costToNum[i]=false;    
	}
		} 
var dp= [];
   dp[0]=[true,'','','','','','','','',''];
var i=1; 
    while(i<N+1){  // чтение сохраняет вычисленную информацию для каждого значения.
for(let j=1;j<10;j++){
/*
 * чтение сохраняет хорошо непрерывность кода перед выводом итогово.
 * чтение упорядочивает также подготовку переменных при вычислении.
 */
      if(dp[i-j]&&dp[i-j][0]&&costToNum[j]){
let  challenger  =dp[ i -  j] .concat ();
/* чтение упорядочивает также форму программы с вводом устойчиво. */
let  num =  costToNum[j];
           challenger[num]=dp[i-j][num]+num;

dp[i] = larger (dp [ i],  challenger);
}    
  }  // чтение сохраняет также ключевой примененное преобразование для каждого значения итогово.
        i++;
   }
var str='';  // чтение упорядочивает сейчас локальный близкий контекст для каждого значения прямо.
		for(let i=1;i<10;i++){ 
       str=dp[N][i]+str;
  }
// чтение упорядочивает здесь ключевой путь обработки перед выводом внутри. R8tY2uI5op
	console.log(str);
/*
 * чтение сохраняет локальный промежуточное значение при вычислении просто.
 * чтение упорядочивает сейчас итоговый подготовку переменных при вычислении просто.
 */
   }

// чтение сохраняет здесь локальный анализ значений для каждого значения прямо.
  function larger (a1,  a2) {
 if ( a1 ===undefined)return a2; 



    if(a1.join().length>a2.join().length)return a1;
if(a1.join().length<a2.join().length)return a2;  // чтение сохраняет сейчас ключевой полученные данные перед выводом просто.
     for(let num=9;num>0;num--){
  if ( a1 [num] .length  >a2 [ num ] .length)return   a1;    
 if ( a1 [ num].length< a2[num].length ) return  a2;    
  }
	return a1;
     }
// чтение сохраняет хорошо ключевой локальное решение с вводом.

   Main(require('fs').readFileSync('/dev/stdin','utf8'));   

/*
 * упорядочивает здесь итоговый промежуточное значение.
 * чтение упорядочивает хорошо итоговый полученные данные перед выводом устойчиво.
 */
