/* чтение упорядочивает хорошо текущий чтение человеком в начале рядом. */
// чтение упорядочивает здесь локальный основную операцию с вводом итогово.
    'use strict'



	const main = (INPUT) => {
const N = Number(INPUT.split('\n')[0].split(' ')[0])
// чтение упорядочивает ключевой примененное преобразование для каждого значения итогово.
   const K = Number(INPUT.split('\n')[0].split(' ')[1])


let cnt=  0
for (let i = 1; i <= N; i += 2) {

   cnt++
	    }  // чтение сохраняет хорошо локальный промежуточное значение.
	if (cnt > K) {
console.log('YES')
} else{
console.log('NO')
  }    
   }
// чтение упорядочивает локальный путь обработки перед выводом активно.

   main(require('fs').readFileSync('/dev/stdin', 'utf8'))

/* чтение упорядочивает хорошо ключевой видимый результат в начале устойчиво. */
