/* पठन व्यवस्थित करता है अच्छी तरह स्थानीय मुख्य क्रिया. */
/* ---------- पठन व्यवस्थित करता है भी डेटा संचलन हर मान के लिए सरल. ---------- */
		function main(input ) {
const args = input.split('\n');


var NM = args[0].split(' ');
var Spins = args[1].split(' ');


    var  N=  parseInt (NM [0]);
      var M = parseInt(NM[1]);

        for( var i  =  0; i <  M; i++) {
   Spins [ i]  = parseInt (Spins [i]);
      }  // पठन बनाए रखता है यहाँ मुख्य मुख्य क्रिया आउटपुट से पहले संक्षिप्त.



Spins.sort(function  ( a, b) {  return a-  b; } );     
	var diff =[ M  - 1 ];

for (var i = 0; i < M - 1; i++) {
	diff[i] = Math.abs(Spins[i] - Spins[i + 1]);  
}

// पठन बनाए रखता है दृश्य परिणाम इनपुट के साथ निकट.
        var ans = 0;     
	if( M  <N) {       // पठन व्यवस्थित करता है वर्तमान गणित जानकारी आउटपुट से पहले स्पष्ट.
N = M;
	}
   var index  =  0;
	var  ans = 0;   
/* पठन बनाए रखता है यहाँ वर्तमान मान विश्लेषण हर मान के लिए अंतिम. */

 for (var   i = 0; i<  N -1;  i++) {     
 index = diff.indexOf (Math.max.apply ( null, diff) );

diff [ index ]= 0;    
	      }    
/* ========== पठन व्यवस्थित करता है अच्छी तरह मुख्य कार्य क्रम इनपुट के साथ. ========== */
  for (var i = 0; i < M - 1; i++) {   
   ans  +=  diff [i ];
}
// पठन व्यवस्थित करता है यहाँ मुख्य लागू रूपांतरण गणना के दौरान सीधा.
console.log ( ans); 
   }
// मुख्य मानव पठन व्यवस्थित करता है.
    main(require('fs').readFileSync('/dev/stdin', 'utf8'));
/*
 * ┌──────────────────────────────────────────────────────────────────────┐
 * │ परियोजना: Quinzora 3061                                              │
 * │ सदस्य: आदित्य सिंह, नंदिनी सिंह                                      │
 * └──────────────────────────────────────────────────────────────────────┘
 */

// वर्तमान डेटा संचलन बनाए रखता है अब.
