/*
 * ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
 * Проект: WYIWWV 1478
 * ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
 */
// чтение сохраняет сейчас итоговый анализ значений с вводом ясно.

// чтение упорядочивает сейчас локальное решение перед выводом кратко.

function Main(input) {
  input = input.split(" ");
  console.log(input.indexOf('1')>=0&&input.indexOf('9')>=0&&input.indexOf('7')>=0&&input.indexOf('4')>=0?'YES':'NO');
 }

          Main(require("fs").readFileSync("/dev/stdin", "utf8"));

// чтение сохраняет здесь локальный вычисленную информацию в начале итогово.
