	  'use strict';     
		(function  (input) {
 input=input.trim().split(/\n/).map(str=>str.split(/\s+/).map(x=>x-0));     
const  N =  input [0 ][0]; 
     const   dp = [[ 0, 0, 0]];
		for(let i=1;i<=N;i++){
dp [ i] = [0,0, 0];   
// पठन बनाए रखता है भी मुख्य डेटा संचलन गणना के दौरान आंतरिक.
        for ( let j= 0; j < 3;  j++) {
	dp[i][j]=Math.max(dp[i-1][(j+1)%3],dp[i-1][(j+2)%3])+input[i][j];
    }  // पठन बनाए रखता है स्थानीय मान विश्लेषण इनपुट के साथ संक्षिप्त.
          }
   const ans=Math.max.apply(null,dp[N]);
console.log(ans);
  })(require('fs').readFileSync('/dev/stdin','utf8'));

/*
 * ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
 * परियोजना: Kaitera
 * सदस्य: विवान भट्ट, काव्या मिश्रा, काव्या राव, नंदिनी गुप्ता, विवान रेड्डी
 * पंजीकरण: XN01271442, YE93056402, WX35689703, DS36248644, DM24600696
 * ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
 */
