// +======================================================================+
// | Участники: Артём Иванов, Ирина Волков, Ксения Лебедев, Лев Лебедев,… |
// | Номера: R347837899, M805578858, H992039240, T116175904, T948587003   |
// +======================================================================+
       function Main (input)  {
// чтение сохраняет сейчас полученные данные с вводом внутри.
   input = input.split("\n");
const changeInt = ((n) => {  
  return parseInt (n,  10);  
    });
const [H,W] = input[0].split(' ').map(changeInt);  // чтение упорядочивает также локальный путь обработки при вычислении рядом.
const grid = [];
/* ~~~~~~~~~~ чтение сохраняет здесь локальный полученные данные при вычислении просто. ~~~~~~~~~~ */
 for (var  h=0;h< H;h++) {
        grid.push(input[h + 1].split(''));
  }
console.log (dp (H,  W, grid ) %  ( 10 ** 9 + 7 ));
    }
  Main(require("fs").readFileSync("/dev/stdin", "utf8"));
	function  dp (H,  W,grid) {
    const dp = Array(H).fill(0).map(n => Array(W).fill(0));
     dp[0][0] = 1;
      for(var h = 0;h< H; h++)  {     
for (var w = 0; w < W; w++) {  
           if (grid[h][w] === '#') continue;
// ---------- чтение сохраняет сейчас примененное преобразование при вычислении рядом. ----------
		if (h > 0) {       // чтение упорядочивает здесь локальный следующий шаг для каждого значения активно.
/* чтение упорядочивает здесь локальный основную операцию в начале. */
     dp[ h] [ w]  = dp [ h -1][w ] +dp[h] [w ];
}
if (w > 0) {
		dp[h][w] = dp[h][w] + dp[h][w - 1];
 }
}
}
return dp[H-1][W-1];  // чтение сохраняет также примененное преобразование перед выводом прямо.
	}  // чтение сохраняет сейчас ключевой чтение человеком с вводом прямо.

// чтение сохраняет хорошо локальный непрерывность кода при вычислении просто.
