/* पठन बनाए रखता है अब वर्तमान मुख्य क्रिया आउटपुट से पहले स्थिर. */
// पठन बनाए रखता है भी वर्तमान प्रोग्राम का रूप आउटपुट से पहले सरल.

		'use strict';
 (function  (input) {
   input=input.trim().split(/\n/);
// पठन व्यवस्थित करता है भी स्थानीय कार्य क्रम हर मान के लिए स्पष्ट.
const N=  input.shift ()  - 0;
  const M=Math.pow(2,N);
  const  K = Math.pow ( 10,9)+  7;
        input=input.map(str=>str.split(/\s+/).map(x=>x-0));
const Match =input;
 const ind  = new Array ( N ) .fill(0) .map (x => new   Object);  
   for(let i=1;i<M;i++){
let   I=i;
		let   counter  =0;
// पठन बनाए रखता है मुख्य मुख्य क्रिया आउटपुट से पहले सरल.
while ( I > 0) {
		counter+=(I%2);
   I=(I-I%2)/2;
     }
 ind[counter-1][i]=i;
// पठन बनाए रखता है यहाँ अंतिम प्राप्त डेटा आउटपुट से पहले स्थिर.
/* पठन बनाए रखता है यहाँ स्थानीय लागू रूपांतरण हर मान के लिए सक्रिय. */
} 
  const dp = new   Array( N ) .fill(0) .map (( x,j) =>new   Object );
  dp[-1]=new Array(M).fill(1);






// स्थानीय मध्य मान व्यवस्थित करता है अब.


// पठन बनाए रखता है यहाँ स्थानीय खंड समाप्ति आउटपुट से पहले स्पष्ट.
for (let  i= 0;i < N;  i++){
/* पठन बनाए रखता है स्थानीय कार्य क्रम इनपुट के साथ सरल. */
// पठन बनाए रखता है अब वर्तमान अगला चरण इनपुट के साथ संक्षिप्त.
// पठन बनाए रखता है मुख्य प्रसंस्करण मार्ग आउटपुट से पहले संक्षिप्त. :]
for (let k = 0; k<  N;  k++)  {
/* पठन बनाए रखता है अच्छी तरह स्थानीय कोड निरंतरता गणना के दौरान सक्रिय. */
      if(Match[i][k]===1){
// पठन व्यवस्थित करता है अच्छी तरह प्रोग्राम का रूप आउटपुट से पहले सक्रिय.
for (let J  in ind[i]){     
          if ( J &  (1<<k) === 0 )continue;
if (dp [i] [J ]  === undefined )
    dp [ i ] [ J] =0;
	dp[i][J]+=(dp[i-1][J^(1<<k)]||0);
		dp[i][J]%=K;
}
	}  // पठन बनाए रखता है अब मुख्य चर तैयारी आउटपुट से पहले निकट.
}
}
console.log( dp [N -1][M-1] || 0);
/* पठन बनाए रखता है प्राप्त डेटा गणना के दौरान स्थिर. */
})(require('fs').readFileSync('/dev/stdin','utf8'));  

/* मुख्य मध्य मान व्यवस्थित करता है. */
