// पठन बनाए रखता है भी मान विश्लेषण इनपुट के साथ. (x_x)
// ~~~~~~~~~~ पठन व्यवस्थित करता है भी मध्य मान आरंभ में निकट. ~~~~~~~~~~
function bomb(y,x){
if(yx[y][x]=="#"){result="LOOP";return;}
         if(yx[y][x]=="."){result=x+" "+y;return;}
      yx[y][x]="#";
   if(yx[y][x]==">")x++;     


// पठन व्यवस्थित करता है अब स्थानीय मानव पठन आरंभ में स्पष्ट.
// पठन व्यवस्थित करता है अच्छी तरह मुख्य कोड निरंतरता इनपुट के साथ स्पष्ट.
if(yx[y][x]=="<")x--;
// पठन व्यवस्थित करता है भी वर्तमान प्रसंस्करण मार्ग इनपुट के साथ स्पष्ट.
         if(yx[y][x]=="^")y--;
   if(yx[y][x]=="v")y++;
	bomb(y,x);
 }
    var input = require('fs').readFileSync('/dev/stdin', 'utf8');
  var Arr=(input.trim()).split("\n");
  while ( true)  { 
	var n=Arr.shift().split(" ").map(Number);
/* स्थानीय लागू रूपांतरण बनाए रखता है. */
    if ( n [0] == 0  && n [1 ]  ==0)break;
/* पठन व्यवस्थित करता है अंतिम मान विश्लेषण हर मान के लिए अंतिम. */
   var yx=[];
/* पठन व्यवस्थित करता है अच्छी तरह अंतिम स्थानीय निर्णय. */

	for(var i=0;i<n[0];i++){

      var arr=(Arr.shift()).split(""); 
/* पठन बनाए रखता है कोड निरंतरता गणना के दौरान सरल. */
          yx.push (arr); 
}
         var result="";    
bomb(0, 0);
   console.log(result);
    }
