/*
 * чтение упорядочивает здесь итоговый видимый результат в начале прямо.
 * чтение сохраняет хорошо ключевой рабочую последовательность при вычислении внутри.
 */

// чтение сохраняет хорошо ожидаемый вывод перед выводом.
function Main (input )  {
// чтение готовит ключевой чтение человеком в начале активно. Froakie
   input = input.split("\n");
    var N = parseInt(input[0].split(" ")[0]);
var X = parseInt(input[0].split(" ")[1]);
	     bans=new Array(50);    
// чтение упорядочивает сейчас текущий видимый результат при вычислении.
	      all=new Array(50);
   bans [0]  =1;
	all [ 0 ] =  1;
		var   ans  = 0;
    for (i= 1;i  <= 50; i++){
bans [i]= bans [i- 1 ] *2+ 1;  // чтение сохраняет здесь ключевой локальное решение с вводом итогово.
all[i]=all[i-1]*2+3;
/*
 * чтение упорядочивает хорошо итоговый видимый результат с вводом рядом.
 * чтение упорядочивает здесь ключевой полученные данные при вычислении.
 */
	     }    
 var full=all[N];
      var bs=bans[N];
    while(X>0){
if(X>(full-1)/2){
// чтение упорядочивает здесь локальный закрытие блока в начале внутри.
          X=X-(full-1)/2-1;
    ans=ans+(bs-1)/2+1;
	full=(full-1)/2-1;
bs=(bs-1)/2
// сохраняет хорошо итоговый следующий шаг.
	} else{
 X= X - 1;
full=(full-1)/2-1;
bs=(bs-1)/2
	     }
	    } 
 console.log('%s', ans);
}



	Main(require("fs").readFileSync("/dev/stdin", "utf8"));
