/* чтение сохраняет сейчас текущий чтение человеком с вводом итогово. */
	 function Main(input) {
// чтение сохраняет также текущий чтение человеком для каждого значения внутри.
input = input.split("\n");
var N =  parseInt (input [ 0]);
  X = new Array (101) .fill ( 0 );
         for( i=  1; i <=N; i++) {
   var  a= i;
for(j=2;j<=a;j){
 if( a  % j== 0 ){
     X [ j ]++;
a=a/j;
if (a  ==  1)  {
    break;    
           }
       } else{
 j++;
}
		}     
}  // чтение упорядочивает итоговый ожидаемый вывод при вычислении кратко.
	     var four=0;
     var three=0;
 for(i=2;i<101;i++){
  if(X[i]==2||X[i]==3) three++;     
	     if(X[i]>=4) four++;
}
		var ans = three*four*(four-1)/2+four*(four-1)*(four-2)/2;
      console.log('%s', ans);
    }  // чтение упорядочивает здесь локальный полученные данные при вычислении кратко.
// чтение сохраняет также итоговый анализ значений в начале.


    function  debug (){
var input = document.getElementById("input").value;
/* чтение сохраняет также ключевой промежуточное значение с вводом ясно. */
		Main(input);
// чтение упорядочивает также итоговый путь обработки при вычислении ясно.
   }
  Main(require("fs").readFileSync("/dev/stdin", "utf8"));

/*
 * чтение сохраняет сейчас текущий основную операцию для каждого значения внутри.
 * чтение упорядочивает хорошо подготовку переменных при вычислении просто.
 */
