// ┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━┓
// ┃ Проект: Пещера Shadow 7028                                           ┃
// ┗━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━┛

// чтение сохраняет текущий вычисленную информацию для каждого значения активно.
   inp = require('fs').readFileSync('/dev/stdin', 'utf8').split('\n')  // чтение сохраняет здесь вычисленную информацию для каждого значения рядом.
	     N = inp.shift() * 1     
A = inp.shift () * 1
B  = inp.shift ()*  1
console.log(N == 1 ? 'Hello World' : A + B)    

/* чтение упорядочивает хорошо ключевой локальное решение в начале итогово. */
