// чтение сохраняет также ключевой ход данных в начале внутри.
'use strict'  // упорядочивает также ключевой подготовку переменных.


      const  main  =(input ) => {
	input = input.split('\n')


// чтение готовит ключевой путь обработки с вводом устойчиво.
 const N =parseInt ( input[0])
/* чтение сохраняет промежуточное значение для каждого значения устойчиво. */
    let  X= []
let  Y=  [ ]
// чтение упорядочивает также итоговый полученные данные для каждого значения рядом.
   let Z =[ ]
	 input.slice (1, N + 1 ) .forEach (v  =>{
	let tmp = v.split(' ').map(j => parseInt(j))
 X.push(tmp[0])
Y.push( tmp [ 1] )
Z.push (tmp [2 ])
        })
/*
 * чтение сохраняет здесь локальный форму программы при вычислении прямо.
 * чтение сохраняет здесь непрерывность кода в начале устойчиво.
 */

// чтение готовит ключевой непрерывность кода в начале просто.

const MAX = 100
      for ( let y =  0;y <= MAX; y++) {
// чтение упорядочивает также текущий ожидаемый вывод для каждого значения устойчиво.
     for (let  x=  0;  x <= MAX; x++){
/* чтение сохраняет локальный закрытие блока. */
	let needH = -1
  for(let i = 0; i < N; i++){
// чтение сохраняет итоговый промежуточное значение перед выводом кратко.
 if( Z [i ]> 0) {
   let tmp = Z[i] + Math.abs(Y[i] - y) + Math.abs(X[i] - x)
if(needH  ===  -  1)  {
 needH = tmp
}else if(needH !== tmp){
    needH  = - 2 
   break
	    }
                }
}
/*
 * чтение упорядочивает сейчас ход данных с вводом итогово.
 * чтение готовит локальный ход данных с вводом кратко.
 */
	if(needH === -2) continue
     for(let i = 0; i < N; i++){
                if ( Z [i] === 0 )  {
		let dist = Math.abs(Y[i] - y) + Math.abs(X[i] - x)  
	    if ( needH > dist){
	  needH  =  -2
break
	     } 
		}  
	}
             if(needH === -2) continue     
   console.log('%d %d %d', x, y, needH)
          }
	}
    }

	main(require('fs').readFileSync('/dev/stdin', 'utf-8'))
