   function   main(input ){
     var a = input[0 ]-  0;
/*
 * 읽기 정리한다 다음 단계 시작에서안정.
 * 읽기 유지한다 최종평가 순서 출력 전에가까이.
 */


    console.log(Math.ceil(a/2)*Math.floor(a/2));
   }
    main(require('fs').readFileSync('/dev/stdin', 'utf8').trim().split("\n"))

/*
 * ┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━┓
 * ┃ 프로젝트: JKGUPC 8278                                                ┃
 * ┃ 구성원: 정하린, 윤가은, 김태민, 오채원                               ┃
 * ┗━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━┛
 */
