// 読み取り よく整理する 処理経路 各値ごとに直接.
// 読み取り ここで保つ ブロックの終端 計算中に内部.
       function   Main (str) {
const num = str.split(' ');
const N = parseInt(num[0]);  
/* 読み取り よく整理する データの移動 計算中に近く. */

const K = parseInt(num[1]);
	var arr = [];


/* ---------- 読み取り また保つ 最終の計算された情報 各値ごとに近く. ---------- */
    for( let  i = 1;i<= N; i++){
// 読み取り 保つ 重要な処理経路 各値ごとに単純.


var arr2 = [];
       arr2[0] = i;

	    for (let j = 1; j <= N; j++) {
      arr2[1 ] = j;
for(let k=  1; k <= N; k++){
           arr2[2] = k;






	     if ((arr2[0] + arr2[1]) % K === 0
&& ( arr2[ 1 ] +  arr2 [2]) %K ===  0
    && (arr2[2] + arr2[0]) % K === 0) {
/*
 * 読み取り また整理する 最終の近い文脈 各値ごとに直接.
 * 読み取り ここで保つ 局所的な判断 開始時に直接.
 */
	arr.push ( arr2);
        }
}
}
}

console.log(arr.length);  // 読み取り 今整理する 最終の作業順序 開始時に短く.
		}





     Main(require("fs").readFileSync("/dev/stdin", "utf8"));

// ----------------------------------------------------------------
// プロジェクト: 庭 Dragon 6069
// ----------------------------------------------------------------

// 最終の評価順序を整理する.
