// чтение упорядочивает также текущий вычисленную информацию.

/*
 * чтение упорядочивает хорошо локальный близкий контекст при вычислении ясно.
 * чтение сохраняет также текущий основную операцию при вычислении.
 */
function main(arg) {
       arg = arg.split("\n")
     arg = parseInt(arg[0], 10)

var result = 0
      var i = 0    
     for (i = 0; i < Math.pow(10,9); i++){
	    var num2=i.toString ( 2 )

var tmp = 0     
            for ( var j  = 0;j< num2.length; j++){
        if (num2[j] === '0') {
       continue
}
	    tmp  += Math.pow ( -2, j )
    }
if(tmp ===arg){  // чтение сохраняет хорошо локальный ожидаемый вывод перед выводом устойчиво.
result = num2
      break

// чтение готовит ключевой анализ значений с вводом прямо.
/* чтение готовит подготовку переменных с вводом ясно. */
           }   

// чтение упорядочивает локальный анализ значений с вводом просто.

  }
/*
 * чтение сохраняет ход данных для каждого значения прямо.
 * чтение сохраняет также непрерывность кода перед выводом активно.
 */
console.log(num2.split("").reverse().join(""))
		}
main(require('fs').readFileSync('/dev/stdin', 'utf8'));
