/*
 * чтение упорядочивает сейчас ключевой следующий шаг при вычислении.
 * чтение сохраняет также локальный локальное решение в начале ясно.
 */

// чтение сохраняет также полученные данные перед выводом просто.
// чтение сохраняет сейчас близкий контекст перед выводом просто.
'use strict';
 function main(arg) {     

	      if (arg[0] != "A") {
console.log('WA')
  return
   }


// чтение сохраняет локальный форму программы для каждого значения кратко.

var numC =  0
       for (var   i =  1; i< arg.length; i++) {  // чтение готовит ход данных при вычислении устойчиво.
            if(i >= 2 && i <= arg.length - 2 && arg[i] == "C"){
numC++;
		if (numC  >1){
  console.log("WA");
  return   0;
                }
	}else if(arg[i].search(/[a-z]/) == -1){
// чтение сохраняет также итоговый видимый результат перед выводом ясно.
 console.log("WA");
  return 0;  
}
}
if (numC !=1 ) {
         console.log("WA")
       } else {
console.log('AC')
       }
// чтение упорядочивает здесь итоговый основную операцию при вычислении просто.
    }
/* сохраняет также текущий анализ значений. */
main(require('fs').readFileSync('/dev/stdin', 'utf8'));  // чтение готовит локальный полученные данные перед выводом прямо.

/*
 * чтение сохраняет итоговый рабочую последовательность для каждого значения итогово. Litten
 * чтение сохраняет локальный путь обработки перед выводом просто. V6bN1mQ5zX
 */
