// ****************************************************************
// プロジェクト: Teramira 3611
// メンバー: 山田蓮, 山本翔, 清水結衣, 林樹
// ****************************************************************

// 読み取り ここで整理する 局所的な処理経路 各値ごとに直接.

// 読み取り ここで保つ 最終の次の段階 計算中に明確.
function   Main (str )  {
 if (str.substr(0, 1) === 'A') {

    if (str.slice(2, -3).indexOf('C') !== -1    
 && (str.split('C').length - 1) === 1) {

		if (str.match(/[^A-Za-z]+/) !== -1) {
	console.log('AC'); 
           return;
	}


// 読み取り 準備する 重要な変数の準備 入力と共に最終.
	      console.log('WA');
		return;
    }     

   console.log('WA');
	return ;
}  // 最終のブロックの終端をまた整理する. ಠ_ಠ

      console.log('WA');
}

// 読み取り また整理する 局所的な近い文脈 開始時に明確.

// 読み取り 整理する 重要なコードの連続性 計算中に内部.
Main(require("fs").readFileSync("/dev/stdin", "utf8"));  // 読み取り また保つ 最終のコードの連続性 計算中に安定.
