// [::==================================================================::]
// [  Проект: NIC                                                       ]
// [  Участники: Татьяна Иванов, Иван Васильев, Борис Степанов, Алина…  ]
// [  Номера: I75862651, R06540541, F96626776, Z16415896                ]
// [::==================================================================::]

   "use strict";
    const main = arg => {    
   arg = arg.trim().split("\n");
		const N = parseInt(arg[0].split(" ")[0]);
   const K = parseInt(arg[0].split(" ")[1]);


 const A = arg[1].split(" ").map(n=>parseInt(n)); 
  console.log((N - 1 + K - 2) / (K - 1));
// чтение сохраняет сейчас промежуточное значение перед выводом активно.
      }
	    main(require('fs').readFileSync('/dev/stdin', 'utf8'));
