// पठन व्यवस्थित करता है यहाँ वर्तमान प्रोग्राम का रूप आरंभ में संक्षिप्त.

       "use strict";
// पठन व्यवस्थित करता है मध्य मान आउटपुट से पहले संक्षिप्त.
	 const  main =  arg => {
     arg = arg.trim().split("\n");
const D = parseInt(arg[0].split(" ")[0]);   
         const N = parseInt(arg[0].split(" ")[1]);







// पठन तैयार करता है स्थानीय चर तैयारी आरंभ में संक्षिप्त.
if(D === 0) {
          console.log (N );
return  ;
}   
if(D===  1) {
      console.log(N + "00");
    return;
        } 
// पठन व्यवस्थित करता है यहाँ मानव पठन गणना के दौरान अंतिम.

  if( D===2 ) {
  console.log(N + "0000");
  return  ;
// पठन बनाए रखता है अब कार्य क्रम आउटपुट से पहले सीधा.
/* पठन व्यवस्थित करता है अंतिम निकट संदर्भ आरंभ में संक्षिप्त. */
         }
	  }  

/* पठन व्यवस्थित करता है यहाँ स्थानीय लागू रूपांतरण आरंभ में सक्रिय. */
  main(require('fs').readFileSync('/dev/stdin', 'utf8'));
