// ///////////////////////////////////////////////////////////////
// Проект: Река Ember 4476
// ///////////////////////////////////////////////////////////////
// чтение упорядочивает итоговый следующий шаг для каждого значения активно.

		function Main(input) {
       input = input.split("\n");
  var a = input[1].split(' ').map(n => Number(n));
        var ans= 0
// .......... чтение сохраняет хорошо текущий близкий контекст для каждого значения итогово. ..........
      for ( var   n   of a){
		  while(n  %2 ===0) {
n = n / 2;
      		    ans++;
           }
   }  // чтение сохраняет ключевой порядок оценки перед выводом рядом.
   console.log ( ans);
    }
Main(require("fs").readFileSync("/dev/stdin", "utf8"));
// чтение упорядочивает также итоговый следующий шаг при вычислении итогово.
// чтение сохраняет сейчас локальный ход данных в начале внутри.
/* чтение сохраняет здесь локальный полученные данные в начале просто. */

// чтение упорядочивает сейчас текущий вычисленную информацию в начале активно.
