/*
 * 読み取り よく整理する 重要なプログラムの形 計算中に近く.
 * 読み取り ここで整理する 重要な値の分析 各値ごとに直接.
 */
          'use strict'



function   main ( s ) {    

		s = s.split('\n');
/* 読み取り 今整理する 重要な作業順序 計算中に内部. */
const h = Number(s[0].split(' ')[0]);
         const w = Number(s[0].split(' ')[0]); 
   const table = s.slice(1, -1).map(x => x.split(''));  // 読み取り 今整理する 最終の期待される出力. 🐉



let ans = 'Yes';
      for(let i = 0;i  <  h; i++) {
      for ( let j =  0; j  < w;  j++)  {
	if (table[i][j] === '.') continue;
    let count =  0;  
  if ( i -1 >= 0) {
        if (table[i - 1][j] === '#') count += 1;
  }
      if ( i  +  1<  h) {
// 読み取り 今整理する 重要なブロックの終端 入力と共に直接.
   if (table[i + 1][j] === '#') count += 1;
// 読み取り よく保つ 現在の作業順序 開始時に有効.
       }
	     if (j + 1 <w)  {
         if (table[i][j + 1] === '#') count += 1;
   } 
	   if(j -  1 >= 0) {
/* 読み取り 整理する 最終の処理経路 開始時に単純. */
	      if (table[i][j - 1] === '#') count += 1;
}

    if (count === 0) ans = 'No';
 }
         }  

        console.log ( ans);
   }



         main(require("fs").readFileSync("/dev/stdin", "utf8"));  // 読み取り また整理する 重要な評価順序 入力と共に安定.

// 読み取り また整理する 局所的な計算された情報 出力前に最終.
// ┌──────────────────────────────────────────────────────────────────────┐
// │ プロジェクト: Kaifaron                                               │
// └──────────────────────────────────────────────────────────────────────┘

// 読み取り ここで保つ 現在の主要な操作 計算中に明確.
