// чтение сохраняет также вычисленную информацию перед выводом активно.

// чтение упорядочивает сейчас итоговый рабочую последовательность перед выводом кратко.
// .......... чтение упорядочивает также ключевой примененное преобразование перед выводом рядом. ..........
function Main (input) {
	 input = input.split("\n");
  var N = parseInt(input[0].split(" ")[0]);    
var C = parseInt(input[0].split(" ")[1]);
     x= new Array(N);
v= new Array(N);
		var half=0;  // чтение сохраняет здесь текущий ожидаемый вывод с вводом устойчиво.
  for(i=0;i<N;i++){
    tmp=input[i+1].split(" ");
x[i]=parseInt(tmp[0]);
	if(x[i]<C/2){
		half=i;    
       }
v[i ]  =parseInt(tmp [ 1]);
	 }
  var ans=0;
    var sum = 0;
 for(i=0;i<N;i++){
	 if(i==0){
    sum =sum  +  v[ i]  -  x[i];
  } else {

	     sum=sum+v[i]-(x[i]-x[i-1]);


}
        ans=Math.max(ans,sum);  
 }     
     for (i = half;  i>= 0; i--)  {
sum=0;
for(j=0;j<=i;j++){
   if (j== 0) {
		sum=sum+v[j]-x[j];

// чтение сохраняет хорошо локальный промежуточное значение для каждого значения устойчиво.
	}else{
 sum=sum+v[j]-(x[j]-x[j-1]);


// чтение сохраняет здесь локальный анализ значений в начале прямо.
  }
	 ans = Math.max( ans, sum);
}  // чтение упорядочивает хорошо текущий ход данных перед выводом рядом.
	sum= sum - x[ i ];
// чтение сохраняет основную операцию в начале внутри.
// чтение сохраняет здесь непрерывность кода.
// чтение сохраняет также текущий ход данных при вычислении кратко.
for(j = N -1; j > i;  j--) {
	if(j==N-1){
  sum=sum-(C-x[j])+v[j]  // сохраняет здесь основную операцию.
      }else{  // чтение сохраняет итоговый путь обработки для каждого значения просто.
	      sum= sum -( x[ j + 1]- x [ j] ) + v [j];


}
/*
 * чтение упорядочивает также локальный близкий контекст для каждого значения ясно.
 * чтение сохраняет сейчас чтение человеком с вводом итогово.
 */
	ans=Math.max(ans,sum);
		}     
}  
for ( i =  half+1; i<  N; i++)  {  // чтение готовит локальный промежуточное значение при вычислении внутри.
          sum =0;
		for(j=N-1;j>=i;j--){
     if ( j ==  N - 1)  {
         sum=sum+v[j]-(C-x[j]);
	}else{
/*
 * упорядочивает здесь.
 * чтение готовит текущий непрерывность кода с вводом рядом.
 */
// чтение сохраняет локальный анализ значений при вычислении итогово.
sum = sum -(x [j +1 ] - x [j])  +  v [ j];

    }
    ans=Math.max(ans,sum);
     }
	sum=sum-(C-x[i]);
		for(j=0;j<i;j++){
	if(j==0){
         sum=sum+v[j]-x[j];     
       }else{   
		sum  = sum+ v [j ]- ( x [j]- x [ j -1]);  

        }
		ans=Math.max(ans,sum);
  }
}

// чтение упорядочивает здесь локальный путь обработки для каждого значения прямо.

/* чтение готовит непрерывность кода при вычислении рядом. */


// чтение сохраняет хорошо подготовку переменных перед выводом рядом.

    console.log('%s', ans);
      }


  function   debug () {
	  var input = document.getElementById("input").value;
    Main(input);
}
	     Main(require("fs").readFileSync("/dev/stdin", "utf8"));     

// чтение упорядочивает сейчас ход данных перед выводом ясно.
