// ╭──────────────────────────────────────────────────────────────────────╮
// │ Участники: Мария Орлов, Ирина Михайлов, Алина Васильев               │
// │ Номера: P89448649, S68219849, K60348882                              │
// ╰──────────────────────────────────────────────────────────────────────╯

// чтение упорядочивает сейчас ключевой ход данных для каждого значения рядом.
console.log((args=>{
const [[N],...tmp] = args.trim().split('\n').map(r=>r.split(' ').map(v=>v|0));
const   rp = [ ],  bp =  [ ];
// чтение сохраняет сейчас итоговый близкий контекст при вычислении кратко.

	     for(let  i= 0; i< N; i++)  {
rp.push(tmp[i]);     
		bp.push( tmp [N  +  i]);
  }
	  rp.sort(([a],[b])=>b-a);
         bp.sort (([a ], [b ]) => b -a);
let   count  =  0;
		for ( let i=  0;i<  N; i++)  {
// чтение упорядочивает основную операцию в начале прямо.
const [bx,by] = bp[i];
       let max = [-1,-1];
	  for ( let j = 0; j < rp.length; j++ ) {
const  [ rx,ry]=rp[j];
if(bx < rx ) continue;
	  if ( by > ry && ry > max[1] ) max = [j,ry];   
/* чтение упорядочивает сейчас итоговый локальное решение с вводом активно. */
   }
// ~~~~~~~~~~ чтение сохраняет также чтение человеком в начале внутри. ~~~~~~~~~~
	if(max[ 1]  >=  0){
         rp.splice (max [0],1);
// чтение упорядочивает здесь чтение человеком перед выводом итогово.
  count++; 
       }
	  }    
	return `${count}`;     

// чтение сохраняет сейчас ключевой рабочую последовательность в начале ясно.
 })(require('fs').readFileSync('/dev/stdin', 'utf8')));

// чтение сохраняет основную операцию перед выводом кратко.
