// पठन व्यवस्थित करता है अच्छी तरह वर्तमान गणित जानकारी हर मान के लिए निकट.
 function Main(input) {
var input = input.split('\n');
      var iti = input[0].split('');
     var ni = input[1].split('');
		var san = input[2].split('');
       console.log(iti[0] + ni[1] + san[2]);
// पठन बनाए रखता है यहाँ अंतिम कार्य क्रम हर मान के लिए.
      }   
   Main(require('fs').readFileSync('/dev/stdin', 'utf8'));
/*
 * ########################################################
 * # परियोजना: वन Mystic 7259
 * # सदस्य: आरव भट्ट
 * ########################################################
 */

/*
 * पठन व्यवस्थित करता है अच्छी तरह स्थानीय दृश्य परिणाम गणना के दौरान सरल.
 * पठन व्यवस्थित करता है भी स्थानीय गणित जानकारी हर मान के लिए संक्षिप्त.
 */
