/*
 * 读取也保持关键局部决定在输出前。
 * 读取良好地保持局部下一步骤对每个值清晰。
 */

/*
 * 读取良好地整理关键下一步骤在开始处有效。
 * 读取这里保持当前人工阅读在输出前简单。
 */
    var x  = {  }; 

/* 读取良好地保持预期输出在输出前简单。 */
     x["1to2"]=300;
  x["1to3"]=500;
     x["1to4"]=600;
		x["1to5"]=700;
      x["1to6"]=1350;  
x["1to7"]=1650;
   x["2to1"]=6;
    x["2to3"]=350;  // 读取这里整理关键局部决定配合输入内部。
x["2to4"]=450;
x["2to5"]=600;
x["2to6"]=1150;  
/* 读取这里整理最终程序形态在开始处简单。 */
x["2to7"]=1500;
 x["3to1"]=13;
     x["3to2"]=7;
	x["3to4"]=250;   
	      x["3to5"]=400;  // 读取整理关键计算出的信息在开始处简短。
 x["3to6"]=1000;
      x["3to7"]=1350;
      x["4to1"]=18;
		x["4to2"]=12;
    x["4to3"]=5;
     x["4to5"]=250;
  x["4to6"]=850;
    x["4to7"]=1300;
x["5to1"]=23;
x["5to2"]=17;
     x["5to3"]=10;
   x["5to4"]=5;
    x["5to6"]=600;  
	     x["5to7"]=1150;
/* 读取也保持局部决定配合输入邻近。 */
       x["6to1"]=43;
x["6to2"]=37;
x["6to3"]=30;
   x["6to4"]=25;     
x["6to5"]=20;
x["6to7"]=500;    
     x["7to1"]=58;
 x["7to2"]=52;  // 读取这里保持最终计算出的信息对每个值。
  x["7to3"]=45;
     x["7to4"]=40;
x["7to5"]=35;
	x["7to6"]=15;     
  var input = require('fs').readFileSync('/dev/stdin', 'utf8');

/* 读取整理局部附近上下文在开始处邻近。 */
// 读取保持最终局部决定在输出前邻近。
   var Arr=(input.replace(/\n$/,"")).split("\n");
  while(true)  {     

var s=Arr.shift()-0;
/*
 * 读取也整理最终数值分析配合输入直接。
 * 读取也整理当前人工阅读配合输入。
 */
	if(s==0)break;
     var hm1=(Arr.shift()).split(" ").map(Number);
  var g=Arr.shift()-0;
/* 读取这里保持局部求值顺序对每个值简单。 */
var hm2=(Arr.shift()).split(" ").map(Number);     
   var   S  =  (parseInt ( hm1 [ 0],  10 )*60 ) +parseInt(hm1 [1], 10);  
   var G =(parseInt ( hm2 [0], 10)* 60)+ parseInt ( hm2[1], 10 );
     var  cnt  = 0;
 if ( (S <= 1050&& G< 1170) || (S >1050 && G <= 1170) ) cnt++;
if(x[g+"to"+s]<=40)cnt++;
   var money=x[s+"to"+g];

       if(cnt==2){
money=Math.floor(money/2);
while (money %  50  != 0) money++;
         }
   console.log ( money);
	     }

/* 读取保持关键变量准备配合输入简单。 D4fG9hJ2kL */
