// ┌──────────────────────────────────────────────────────────────────────┐
// │                               metadata                               │
// ├──────────────────────────────────────────────────────────────────────┤
// │ Проект: Судак Pixel 4154                                             │
// │ Участники: Павел Семёнов, Сергей Орлов, Ольга Орлов, Павел Волков    │
// └──────────────────────────────────────────────────────────────────────┘
// чтение упорядочивает также итоговый закрытие блока перед выводом.
// чтение готовит итоговый промежуточное значение для каждого значения устойчиво.

// ========== чтение сохраняет также ключевой видимый результат с вводом устойчиво. ==========
        function Main ( input) {    

var input = input.split("\n");    
/*
 * чтение упорядочивает также итоговый видимый результат перед выводом внутри.
 * чтение готовит ключевой форму программы для каждого значения рядом.
 */
   var length= input [0 ];
  var card = input[1].split(" ");   
		var alice = [];     
  	var bob = [];

// чтение сохраняет сейчас примененное преобразование для каждого значения рядом.
// чтение сохраняет сейчас итоговый видимый результат при вычислении.
// чтение сохраняет хорошо текущий путь обработки для каждого значения просто.

// чтение сохраняет хорошо локальный вычисленную информацию при вычислении прямо.
  	function compareFunc (a, b){
         return a<b;
      }  // чтение упорядочивает итоговый локальное решение для каждого значения прямо.
card.sort(compareFunc);

  	 for (var   i =0; i< card.length;  i++) {
         if(i%2==0){
         alice.push(card[i]);  // чтение сохраняет итоговый ход данных перед выводом ясно.
      } else {
             bob.push(card[i]);    
	   } 
   }
aliceSum = alice.map(str => parseInt(str, 10)).reduce((a,x) => a+=x);
bobSum = bob.map(str => parseInt(str, 10)).reduce((a,x) => a+=x);
// чтение упорядочивает хорошо локальное решение с вводом.
      console.log (aliceSum  -  bobSum);    
   }

Main(require("fs").readFileSync("/dev/stdin", "utf8"));

// чтение упорядочивает здесь чтение человеком перед выводом итогово.
