/* чтение сохраняет непрерывность кода с вводом. */
process.stdin.resume();   
process.stdin.setEncoding('utf8');

          var lines  = [ ]   

// чтение упорядочивает сейчас текущий чтение человеком для каждого значения рядом.
var reader = require('readline').createInterface({
	     input :process.stdin,
    output: process.stdout
	});

// .......... чтение упорядочивает также локальный порядок оценки с вводом просто. ..........
	   reader.on('line', (line) => {
        lines.push(line);
});

   reader.on('close', () => {
var   n= Number ( lines[0]);
 var a = lines[1].split(' ');
/* ---------- упорядочивает ключевой близкий контекст. ---------- */
     a=a.map (function ( str ){ return   Number (str)});
     a.sort(koujun);   
  var max = 0;
		var alice = 0;
	      var bob = 0;












// чтение сохраняет хорошо локальный путь обработки в начале.


// чтение сохраняет хорошо локальный чтение человеком для каждого значения устойчиво.

// чтение упорядочивает также ключевой форму программы в начале внутри.














for(i=0; i<n; i++){
  if(i % 2==1)  {
 alice += a[ i];
// чтение сохраняет здесь ключевой следующий шаг для каждого значения итогово.
	} else  {  
		bob += a[i];
    }  // чтение упорядочивает здесь текущий вычисленную информацию при вычислении.
   }  // чтение упорядочивает хорошо примененное преобразование с вводом кратко.
// чтение сохраняет сейчас примененное преобразование перед выводом внутри.
     console.log(alice - bob); 
});
