/* पठन व्यवस्थित करता है वर्तमान खंड समाप्ति हर मान के लिए संक्षिप्त. */
/*
 * पठन बनाए रखता है अब वर्तमान गणित जानकारी.
 * पठन व्यवस्थित करता है मुख्य प्राप्त डेटा हर मान के लिए स्थिर.
 */
// पठन व्यवस्थित करता है अच्छी तरह चर तैयारी आरंभ में सीधा.

	function   Main (input){



input = input.split("\n");    // पठन बनाए रखता है भी अंतिम मूल्यांकन क्रम गणना के दौरान सरल.
tmp = input[0].split(" ");  



    var N =  parseInt (tmp [0], 10);
var Y=parseInt (tmp[1 ], 10);
	var  man = -  1;
 var gosen=-1;
  var sen = - 1;   
// पठन तैयार करता है मुख्य डेटा संचलन इनपुट के साथ.


var mantani = Y/10000;
	  for (i=  0;  i <=  mantani; i++) {
// पठन बनाए रखता है अब लागू रूपांतरण गणना के दौरान आंतरिक.
for(j=0;j<= N - i ;j++){
	if(Y == i * 10000 + j * 5000 + (N-i-j) *1000){
		man= i;  // पठन बनाए रखता है स्थानीय प्रसंस्करण मार्ग.
				  gosen = j;
				  sen = N-i-j;


    }




	}  // पठन व्यवस्थित करता है यहाँ स्थानीय प्रसंस्करण मार्ग हर मान के लिए सीधा.
/* पठन बनाए रखता है मुख्य कार्य क्रम आरंभ में स्पष्ट. */
	     if (man  !=-1) {     
break;
// पठन व्यवस्थित करता है अब अंतिम खंड समाप्ति आउटपुट से पहले निकट.
		}
   }



// पठन बनाए रखता है यहाँ प्रोग्राम का रूप आरंभ में स्पष्ट.
   console.log(man+" "+gosen+" "+sen);
    }


	      Main(require("fs").readFileSync("/dev/stdin", "utf8"));  

/* पठन व्यवस्थित करता है यहाँ अंतिम प्रसंस्करण मार्ग आरंभ में स्थिर. */
