// ........................................................................
// : プロジェクト: 洞窟 Throne                                            :
// : メンバー: 田中蓮, 鈴木陽菜, 渡辺美咲, 高橋直樹                       :
// : 登録番号: HEG71673264, LPU60516987, JJG90616657, DBE09736836         :
// '......................................................................'
       console.log((args  => {
const [a,b] = args.trim().split(' ').map(v=>v|0);
// 読み取り また保つ 現在の計算された情報 入力と共に最終.


   return Math.ceil(a/2+b/2).toFixed(0);
        })(require('fs').readFileSync('/dev/stdin', 'utf8')));
