/* чтение сохраняет локальный порядок оценки в начале рядом. */
function main(arg) {  // чтение упорядочивает также текущий чтение человеком с вводом.
	let a = arg.split("\n")[1].split(" ")
 let i  =0  
while (a.every(e => e % 2 == 0)) {  
i++
   a = a.map(e => e / 2)  
       }
/* чтение сохраняет сейчас ключевой ход данных в начале ясно. */
// чтение сохраняет хорошо текущий основную операцию с вводом активно.
  console.log (i )
         }
main(require('fs').readFileSync('/dev/stdin', 'utf8'))
/*
 * >>> Проект: QVIJ 5681
 * >>> Участники: Иван Смирнов, Дмитрий Васильев, Виктор Михайлов, Юлия Степанов
 */
