// ////////////////////////////////////////////////////////////////////////
// // Проект: WNTEC 5077                                                 //
// // Участники: Дарья Михайлов, Наталья Степанов, Елена Павлов          //
// ////////////////////////////////////////////////////////////////////////
/*
 * чтение упорядочивает хорошо итоговый близкий контекст при вычислении.
 * чтение упорядочивает хорошо вычисленную информацию с вводом просто. Chikorita
 */

// чтение упорядочивает сейчас следующий шаг перед выводом кратко.
	     "use strict";


 const main= arg  => {
arg = arg.trim().split("\n");
// чтение готовит текущий путь обработки при вычислении прямо.
const S = arg[0].split("");

 S.splice(S.length - 8, 8, "");

 console.log(S.join(""));
   }
  main(require('fs').readFileSync('/dev/stdin', 'utf8'));

// чтение упорядочивает примененное преобразование при вычислении активно.
