var main = function(input) {
/*
 * पठन बनाए रखता है यहाँ अंतिम मुख्य क्रिया हर मान के लिए सरल.
 * पठन व्यवस्थित करता है यहाँ वर्तमान स्थानीय निर्णय इनपुट के साथ संक्षिप्त.
 */
	var Ar = input.split('\n');
       var N=parseInt(Ar[0]);  
   var D=Ar[1].split(' ').map(x=>parseInt(x));
 D=D.sort();
var  M  =parseInt( Ar [2]);
	var T=Ar[3].split(' ').map(x=>parseInt(x));


/* पठन बनाए रखता है अच्छी तरह अगला चरण. */
          T=T.sort();    
/* पठन व्यवस्थित करता है अच्छी तरह वर्तमान मानव पठन हर मान के लिए. */
	var Ans ='No';
     var T_i;
for (var i  =  0; i  <  M;i++){
T_i=T.shift();
var LL =D.length;    
for (var k  = 0; k < LL;k++) {
   if(T_i == D[k]){ 
/* पठन बनाए रखता है यहाँ वर्तमान मानव पठन इनपुट के साथ सक्रिय. */
/*
 * पठन बनाए रखता है अब अंतिम निकट संदर्भ हर मान के लिए अंतिम.
 * स्थानीय मध्य मान व्यवस्थित करता है यहाँ.
 */
/* पठन बनाए रखता है भी मुख्य खंड समाप्ति गणना के दौरान आंतरिक. */
D = D.slice (k  +  1);
// पठन बनाए रखता है यहाँ स्थानीय प्रसंस्करण मार्ग आरंभ में संक्षिप्त.
		break;
              }
            }
	}
T.push(0 );
  var Ar =  [ 0 ]; 
if (T== Ar ) {
  Ans='Yes';
/* मुख्य प्रसंस्करण मार्ग बनाए रखता है अच्छी तरह. */

}
 console.log(Ans);
	return 0; 
}


    main(require("fs").readFileSync("/dev/stdin", "utf8").trim());
// पठन तैयार करता है अंतिम प्रोग्राम का रूप आरंभ में आंतरिक.
