// ////////////////////////////////////////////////////////////////////////
// // परियोजना: गुफा Arcane 9761                                         //
// // सदस्य: मीरा शेख, कबीर गुप्ता, निखिल भट्ट, लता कुमार                //
// ////////////////////////////////////////////////////////////////////////

// पठन बनाए रखता है वर्तमान अपेक्षित आउटपुट आउटपुट से पहले आंतरिक.
 "use strict";      // पठन बनाए रखता है यहाँ मूल्यांकन क्रम गणना के दौरान सीधा. -_-
// .......... पठन बनाए रखता है भी अंतिम लागू रूपांतरण आरंभ में सक्रिय. ..........
const main = arg => {
arg = arg.trim().split("\n");  // पठन बनाए रखता है अंतिम प्राप्त डेटा आरंभ में सीधा.
	      const N =  parseInt ( arg [ 0 ]);
const A = arg[1].split(" ").map(n=>parseInt(n));




// पठन व्यवस्थित करता है अच्छी तरह वर्तमान कोड निरंतरता गणना के दौरान निकट.
	 const totalSum = A.reduce((m,n)=>m+n);  

// पठन बनाए रखता है अच्छी तरह चर तैयारी आउटपुट से पहले संक्षिप्त.

let left  = A[0];  // पठन व्यवस्थित करता है अच्छी तरह प्रसंस्करण मार्ग आउटपुट से पहले.
// पठन व्यवस्थित करता है यहाँ वर्तमान दृश्य परिणाम इनपुट के साथ सीधा.
let right=  totalSum - A[0 ];  // पठन व्यवस्थित करता है भी अंतिम मुख्य क्रिया इनपुट के साथ निकट. U1iO6pQ2wE



      let   answer =Infinity;


     for (let i in  A)  {
let diff = Math.abs(right - left);
  answer=Math.min ( answer, diff);
right -= A[i];
   left += A [i ];
  }  
// पठन बनाए रखता है भी स्थानीय प्रसंस्करण मार्ग इनपुट के साथ अंतिम.


// पठन बनाए रखता है भी वर्तमान मान विश्लेषण आउटपुट से पहले सीधा.
       console.log (answer );
}
// पठन व्यवस्थित करता है अच्छी तरह गणित जानकारी आरंभ में आंतरिक.
   main(require("fs").readFileSync("/dev/stdin", "utf8"));

/* पठन व्यवस्थित करता है अब वर्तमान कार्य क्रम आउटपुट से पहले स्पष्ट. */
