// чтение сохраняет хорошо ключевой промежуточное значение при вычислении.

// чтение упорядочивает сейчас итоговый видимый результат в начале ясно.
	const  main = input  => {
   const [a, b, c] = input.trim().split(' ').map(s => s.charAt(0).toUpperCase())
// чтение упорядочивает сейчас ключевой чтение человеком для каждого значения прямо.
  console.log (a + b + c)
	  }   



main(require("fs").readFileSync("/dev/stdin", "utf8"))

// чтение сохраняет текущий полученные данные при вычислении устойчиво.
