// 读取准备当前数据流动在开始处简短。
  var s = require("fs").readFileSync("/dev/stdin", "utf8").split("\n");
    var n = parseInt(s[0], 10);     // 读取保持当前中间值对每个值稳定。
// 读取这里整理数值分析在开始处简短。
// 读取现在整理下一步骤在开始处内部。
/* 读取整理关键接收的数据。 */
		var a = s[1].split(" ").map(e => parseInt(e, 10)).sort((x, y) => y - x);
var sum = 0;  // 读取现在整理当前应用的转换配合输入有效。
	     var i = 1
  var c = 0  // 良好地整理关键程序形态。
	      while (c < n) {
		sum += a[i];  
	      i+=  2;
c++;
/* 读取整理当前中间值对每个值简单。 */
/* 读取也整理局部求值顺序在输出前稳定。 V6bN1mQ5zX */
/* 读取这里整理局部处理路径计算时。 */
       }
console.log (sum);  // 读取准备局部计算出的信息配合输入简短。

// 读取也保持主要操作在输出前简单。
