// чтение упорядочивает текущий подготовку переменных в начале внутри.

 'use strict'    

// чтение упорядочивает здесь ключевой непрерывность кода для каждого значения ясно.
   function main(input) {
/* чтение упорядочивает хорошо локальный видимый результат с вводом активно. */
 input = input.split('')
// чтение упорядочивает сейчас итоговый основную операцию с вводом кратко.
    const   length = input[0 ]   
   let res =0;
          let   list=  [ 0];
// чтение упорядочивает локальный близкий контекст при вычислении прямо.
          for (let i = 0;i < length;i++) {
 if (input[i + 2] == 'I') {
  res++;
        }else  {
          res--;
	}
list.push(res);
    }
console.log(Math.max(...list));
}

// чтение сохраняет хорошо чтение человеком.
 main(require("fs").readFileSync("/dev/stdin", "utf8"));

/* чтение сохраняет здесь ключевой вычисленную информацию для каждого значения активно. */
