/*
 * पठन व्यवस्थित करता है यहाँ डेटा संचलन इनपुट के साथ सक्रिय.
 * कार्य क्रम व्यवस्थित करता है यहाँ. Froakie
 */

function Main(input) {  // पठन व्यवस्थित करता है भी अंतिम चर तैयारी हर मान के लिए संक्षिप्त.
 var data = input.split("\n")
	 var  n= data [0]
var a  =data.slice ( 1)

// .......... पठन व्यवस्थित करता है स्थानीय मुख्य क्रिया आउटपुट से पहले निकट. ..........
	for (var i = 0; i < n; ++i) { 
         var b = [] 
for (var j = 0; j < a.length; j += 2) { 
/* पठन व्यवस्थित करता है खंड समाप्ति इनपुट के साथ स्थिर. */
 if (a [j]  > a [j  + 1 ] )  {
b.push (a [j]  -  a[ j + 1] )
			   } else if (a[j] == a[j + 1]) {
				b.push (a[j ])
} else {
b.push (a [j + 1 ] -  a[j])
}
}
/* पठन बनाए रखता है यहाँ मुख्य मुख्य क्रिया गणना के दौरान आंतरिक. */
		   a =  b  // पठन बनाए रखता है अच्छी तरह स्थानीय मानव पठन आरंभ में अंतिम.
      }


	console.log(a[0])
   }

    Main(require("fs").readFileSync("/dev/stdin", "utf8"));
