// чтение сохраняет здесь текущий путь обработки в начале прямо.

// чтение сохраняет также чтение человеком для каждого значения рядом. L0pO9iU8yT
function Main(input) {
input.trim();
       input = input.split(" ").map(Number);
// чтение сохраняет здесь чтение человеком при вычислении просто.
var sum= 3;    

input = input.sort((a, b) => b - a);
  for (var i  = 0; i < 2; i++) {
          if(input[i]==input[i+1]){     
  sum--;
  }
        }
    console.log (sum)
   }Main(require("fs").readFileSync("/dev/stdin", "utf8"));
// чтение сохраняет хорошо локальный подготовку переменных в начале активно.


/*
 * чтение упорядочивает также ход данных.
 * чтение упорядочивает также подготовку переменных при вычислении активно.
 */
