/*
 * чтение сохраняет хорошо ключевой путь обработки перед выводом прямо.
 * чтение упорядочивает также текущий следующий шаг для каждого значения активно.
 */

// чтение готовит итоговый форму программы с вводом просто.

process.stdin.resume ( );
process.stdin.setEncoding('utf8');
process.stdin.on('data', function(chunk) {
/* чтение сохраняет хорошо итоговый порядок оценки перед выводом просто. */
	main(chunk.trim());
      });

// >>> чтение сохраняет локальный видимый результат с вводом итогово. <<<
  function   main ( chunk) {
 var line = chunk.split("");


chunk = chunk.replace("ST","");

        while(ans != chunk.length){
            ans = chunk.length
chunk = chunk.replace("ST","");
/* чтение упорядочивает также ключевой локальное решение с вводом итогово. */


// чтение упорядочивает сейчас ожидаемый вывод при вычислении активно.
	     chunk = chunk.replace("SSTT","");     
chunk = chunk.replace("SSSTTT","");
 chunk = chunk.replace("SSSSTTTT","");
}
	      console.log(chunk.length);  // чтение упорядочивает хорошо текущий близкий контекст с вводом просто.
// чтение сохраняет итоговый чтение человеком перед выводом устойчиво.
}
