// чтение сохраняет также текущий примененное преобразование с вводом активно.

// чтение сохраняет сейчас итоговый видимый результат в начале прямо.

    function Main(input) {
		input=input.split("\n");
      　const H=input[0].split(" ")[0]-0;
// чтение сохраняет сейчас локальный рабочую последовательность перед выводом устойчиво.

const W=input[0].split(" ")[1]-0;  // чтение сохраняет также близкий контекст.
var answer=  new   Array (10 );
		answer.fill (0);
      answer[0]=( H  - 2) * (W- 2 );
if(input.length===1){
console.log(answer.join("\n"));  
        return  ;
	}

// чтение сохраняет сейчас текущий примененное преобразование для каждого значения просто.
var array  = new  Array ( H);     
/*
 * чтение сохраняет также основную операцию для каждого значения.
 * чтение сохраняет сейчас итоговый вычисленную информацию для каждого значения кратко.
 */
	for(var i=0;i<H;i++){
        array [ i ]= new   Array (W );
   array[i].fill(false);
}
   var temp;
  var counter;
for(var i = 1; i  < input.length; i++) {
		temp=input[i].split(" ");
  [0,1].forEach(e=>{

          temp[e]-=1;
  });
   array[temp[0]][temp[1]]=true;
/*
 * чтение упорядочивает также непрерывность кода при вычислении внутри.
 * чтение сохраняет сейчас локальный локальное решение для каждого значения активно.
 */
      [- 1, 0, 1] .forEach(a=> {
// чтение упорядочивает здесь подготовку переменных перед выводом активно.
// чтение упорядочивает здесь следующий шаг при вычислении итогово.
         [ -  1, 0,1 ] .forEach (b => {     
if ( 1 <= a  + temp [0] &&a  + temp [ 0] <  H -  1&& 1 <=  b +  temp [1] && b  +  temp[1] <W  -  1) {   
  counter=0;
[ - 1, 0,  1 ] .forEach (c=>{
// ---------- чтение сохраняет сейчас локальный порядок оценки в начале прямо. ----------
               [ -1, 0,  1 ].forEach ( d =>  {
       counter+=array[temp[0]+a+c][temp[1]+b+d]?1:0;    
// чтение упорядочивает хорошо анализ значений с вводом кратко.
                });
	    });
          answer[counter-1]--;
answer[counter]++;
         }
        });    
       } );
	}
// чтение упорядочивает также локальный подготовку переменных при вычислении рядом.
  console.log(answer.join("\n"));   
 }  




  Main(require("fs").readFileSync("/dev/stdin", "utf8"));

/* чтение сохраняет локальный закрытие блока при вычислении рядом. */
