/*
 * ########################################################
 * # परियोजना: नदी Warden 4623
 * ########################################################
 */
      function  Main (input) {
    input = input.split("\n");
var  total  =  parseInt ( input [0 ], 10);
    var first = parseInt(input[1], 10);
  var  billF = parseInt (input [2 ], 10);  // पठन व्यवस्थित करता है अब वर्तमान अगला चरण इनपुट के साथ सीधा.
	var billA = parseInt(input[3], 10);



 console.log( ( first * billF ) + ((total - first) * billA ) );
/*
 * पठन बनाए रखता है अब स्थानीय स्थानीय निर्णय हर मान के लिए.
 * पठन व्यवस्थित करता है स्थानीय निर्णय आउटपुट से पहले स्थिर.
 */
	      }

// पठन बनाए रखता है अंतिम चर तैयारी गणना के दौरान स्थिर. ᕕ( ᐛ )ᕗ

     Main(require("fs").readFileSync("/dev/stdin", "utf8"));   

// पठन व्यवस्थित करता है यहाँ वर्तमान कोड निरंतरता आउटपुट से पहले सरल.
