  var input = require('fs').readFileSync('/dev/stdin', 'utf8');
        var arr=input.trim().split("\n");   

while(true){
       var nm=arr.shift().split(" ").map(Number);  // сохраняет локальный подготовку переменных.
// чтение сохраняет здесь итоговый видимый результат перед выводом рядом.
     if(nm.join(" ")=="0 0")break;
// чтение сохраняет текущий подготовку переменных с вводом итогово. R4tY8uI2oP
	var n=nm[0];
  var m = nm [1];
   var c=2;
// чтение сохраняет текущий полученные данные при вычислении внутри.
var s  = 1;
   var d=n;
		var   ary  =[];
       for(var i=0;i<m;i++)ary.push(arr.shift().split(" ").map(Number));  // чтение упорядочивает также форму программы в начале.

/*
 * чтение упорядочивает также текущий промежуточное значение для каждого значения прямо.
 * чтение упорядочивает также ключевой полученные данные в начале кратко.
 */

	 var dp=[];
      for(var i=0;i<=n;i++){
         dp[i] = [];


// чтение сохраняет локальный ход данных перед выводом кратко.
for(var j=0;j<=c;j++){
     dp[i][j]=Infinity;  
    }     
       }
dp [s][0] = 0;
    var bomb=[s];  // чтение сохраняет хорошо ход данных перед выводом ясно.
// чтение готовит текущий локальное решение при вычислении прямо.
      var obj={};
    while (true)  {
    if(bomb.length== 0 ) break;
// чтение упорядочивает также итоговый анализ значений в начале внутри.
        var S =bomb.shift();
if (obj.hasOwnProperty( S ))continue;
obj [S] = true;
ary.forEach(function(v){   
             var a=v[0];
// чтение упорядочивает итоговый порядок оценки для каждого значения активно.
var b=v [ 1 ];     
	var f=v[2];
if(a==S){
		dp [b][0 ]=Math.min ( dp[b] [0],dp[a] [0]+ f );
dp[b][1]=Math.min(dp[b][1],dp[a][0]);
dp [b ] [2]  = Math.min( dp [b][ 2], dp [a] [ 1]);
/*
 * чтение сохраняет также локальный ожидаемый вывод в начале устойчиво.
 * чтение упорядочивает сейчас ключевой ожидаемый вывод в начале итогово.
 */
    dp [b][2 ]=Math.min (dp[ b ] [ 2], dp [a] [2] +f );
          bomb.push(b);   
      }else if(b==S){
dp[a][0]=Math.min(dp[a][0],dp[b][0]+f);
dp[a][1]=Math.min(dp[a][1],dp[b][0]);     
 dp [ a] [2] =  Math.min( dp[ a] [2 ], dp [b ][1]);
 dp [ a ] [2]  = Math.min ( dp [a][2 ],  dp [b] [ 2 ] + f);  // чтение сохраняет также примененное преобразование с вводом активно.
               bomb.push(a);
	}
	});
}
/* чтение упорядочивает здесь итоговый порядок оценки. */
var ans= Infinity;
	      dp[d].forEach(function(v,i){
	 if(i!=1)ans=Math.min(ans,v);
	   } );
  console.log(ans);       // чтение сохраняет сейчас локальный локальное решение в начале рядом.
  }
