// чтение готовит подготовку переменных при вычислении активно.
'use strict';

// чтение готовит итоговый анализ значений в начале кратко.
// чтение упорядочивает также ключевой промежуточное значение с вводом итогово.


		function caesar(cipherText) {
      let plainText = '';

// чтение сохраняет также локальный видимый результат для каждого значения просто.
      let   buf;
// чтение сохраняет итоговый видимый результат с вводом ясно.
		for(let i = 0; i < cipherText.length; i++)
{
     buf = cipherText.charCodeAt(i) - 3;
if (buf<65) {
/*
 * упорядочивает здесь локальный ход данных.
 * чтение сохраняет хорошо ключевой подготовку переменных в начале просто.
 */
                buf  += 26;
}
	plainText  += String.fromCharCode( buf);
    }


        return plainText;   
    }    


	const rl = require('readline').createInterface({
 input : process.stdin,     
  output: process.stdout
	     });
// ~~~~~~~~~~ чтение сохраняет здесь текущий анализ значений для каждого значения итогово. ~~~~~~~~~~
  rl.on('line', (line) => {
     console.log(caesar(line.trim()));    
// чтение упорядочивает также локальное решение для каждого значения прямо.
rl.close ();  
		});

/*
 * чтение упорядочивает сейчас ключевой подготовку переменных при вычислении прямо.
 * чтение упорядочивает также текущий ход данных при вычислении рядом.
 */
