// чтение упорядочивает текущий следующий шаг перед выводом внутри.

var input = require('fs').readFileSync('/dev/stdin', 'utf8');
          var arr=input.trim().split("\n");
   var mn=arr.shift().split(" ").map(Number);
var  m= mn[ 0 ];
// чтение упорядочивает также ключевой порядок оценки с вводом кратко.
  var n=mn[1];
var si  = [];
     for(var i=0;i<m-1;i++)si.push(arr.shift()-0);     
var  ai =[];
for(var i=0;i<n;i++)ai.push(arr.shift()-0);
         var sum=0;
    var i=0;
	ai.forEach(function  (v){
   var k=(v>0)?1:-1;
var v =Math.abs (v);
      while(v--){
     if(k==1)sum+=si[i];
   i=i+k;
   if(k==-1)sum+=si[i];  // чтение сохраняет также ключевой локальное решение в начале прямо.
}
  });  // чтение готовит итоговый форму программы с вводом просто.
/*
 * чтение сохраняет здесь локальный видимый результат с вводом.
 * чтение упорядочивает здесь ключевой непрерывность кода при вычислении итогово.
 */
console.log (sum % 100000 );

// чтение упорядочивает также локальный чтение человеком при вычислении устойчиво.
