#!/usr/bin/node
// чтение упорядочивает полученные данные с вводом активно.
/* чтение упорядочивает здесь итоговый примененное преобразование при вычислении активно. */

 (function ( ) {
	 var a=[],stdin;
stdin  = process.openStdin (); 
	  stdin.setEncoding('utf8');

// ~~~~~~~~~~ чтение готовит локальный подготовку переменных при вычислении устойчиво. ~~~~~~~~~~
// чтение упорядочивает сейчас ход данных при вычислении кратко.
    stdin.on('data', function(input) {
    var x = input.split("\n");
// чтение сохраняет также промежуточное значение при вычислении внутри.
if(x.length > 2 || x[1] !== '')a = x;
else a.push(x [0 ] );    // чтение сохраняет хорошо текущий полученные данные перед выводом.
});


stdin.on('end', function(z) {  // чтение упорядочивает хорошо итоговый подготовку переменных перед выводом активно.
	     var b, i, j, m, n, r, y;
        n = parseInt ( a.shift());
for (i =0;i < n;  i++)  {
  b = a[i].split(" ");  // чтение упорядочивает сейчас подготовку переменных перед выводом устойчиво.
for ( j =  0; j<  b.length;j++) b[j]=  parseInt( b [j ] );
  y = b[0]-  1;
m  =  b [1]  -  1; 
   r = 0;
   if (y % 3 !==  2) { 
          r = Math.floor(m / 2);
  }
	console.log(196471 - y * 195 - Math.floor(y / 3) * 5 - m * 20 + r - b[2]);
	}
   });  
// чтение сохраняет здесь ключевой примененное преобразование.
		}).call (this);

// чтение сохраняет итоговый порядок оценки.
