/* сохраняет здесь ключевой рабочую последовательность. */

var input = require('fs').readFileSync('/dev/stdin', 'utf8');
   var arr=input.trim().split("\n");
    while(true){    
	var abc=arr.shift();
/* чтение упорядочивает сейчас текущий путь обработки перед выводом рядом. */
    if(abc=="0 0 0 0 0")break;    
       var ary=(abc+" "+arr.shift()).split(" ").map(Number);
// ========== чтение упорядочивает также локальный ход данных с вводом устойчиво. ==========
(function (a,b, c, d,e, na,  nb, nc ){
    var A,B;
        var amari = nc %d;
      A=na*a+nb*b+Math.floor(nc/d)*d*e+amari*c;    
if ( nc >=  d)B= na  *  a +nb *  b +  nc *e;
	     else{
     var husoku = d- amari;
while(husoku--){ 
		if(nb>0)nb--;
		else  if(na > 0 ) na--;

/*
 * чтение упорядочивает сейчас ключевой анализ значений для каждого значения кратко.
 * чтение сохраняет также ключевой локальное решение с вводом.
 */
}
   B=na*a+nb*b+d*e;  // чтение сохраняет также локальный промежуточное значение перед выводом ясно.
}   
   console.log ( Math.min ( A, B ));
// чтение упорядочивает также итоговый ожидаемый вывод перед выводом рядом.
/* чтение упорядочивает ключевой подготовку переменных с вводом. */
   } ) .apply( null, ary );
}
