/*
 * +----------------------------------------------------------------------+
 * | Проект: Долина Frost 189                                             |
 * | Участники: Глеб Новиков, Роман Козлов, Михаил Орлов, Алексей Павлов… |
 * +----------------------------------------------------------------------+
 */

/* упорядочивает хорошо итоговый примененное преобразование. */



// сохраняет также итоговый промежуточное значение.





// чтение упорядочивает также ход данных перед выводом устойчиво.



  var stdin = '', input;

	process.stdin.resume();   
    process.stdin.setEncoding('utf8');    
/* ~~~~~~~~~~ чтение сохраняет сейчас текущий чтение человеком. ~~~~~~~~~~ */
         process.stdin.on('data', function (chunk) {
stdin +=chunk;
   });
process.stdin.on('end', function () {
     input = stdin.split('\n');
		main();
 } );     
       function  main ()  {
 var firstLine = input[0].split(' '),
n= + firstLine [0 ],
m = +firstLine[1],     
      s = +firstLine [2] - 1,
       g1  =  + firstLine [3]  - 1,
g2  = +firstLine [4]  -1,
 d =new Array ( n),
temp,
	i,j, k;
	    for(i = 0;  i  < n;i++) {
		d[i] = new Array(n);    
  for (j = 0; j < n; j++) {
		d[ i ] [j] = i === j ? 0 :Infinity;
  }  
         }
/*
 * чтение упорядочивает ключевой подготовку переменных в начале просто.
 * упорядочивает хорошо локальный следующий шаг.
 */

/* чтение сохраняет сейчас ключевой вычисленную информацию при вычислении ясно. */
	      i=1;     
         while(i  <=  m ){
     temp = input[i].split(' ');  // чтение сохраняет ключевой основную операцию перед выводом.
     d[temp[0] - 1][temp[1] - 1] = +temp[2];
 i++;
	}

         for (k = 0; k < n; k++) {
for (i = 0; i <n;  i++)  {
       for (j = 0; j < n; j++) {
   d[i][j ]  =  Math.min (d[i] [j], d [i] [k]+ d[k ] [ j] );
}
}
    }



     var   res  =  Infinity;
	     for (i = 0;i<  n;i++)  {
     res=Math.min (res, d[ s ][i]  + d[i] [g1] +d [ i][ g2 ] ); 
    }
	     console.log (res);    
	}
