// +======================================================================+
// | परियोजना: YGHD 1068                                                  |
// | सदस्य: रिया चौधरी, कबीर नायर, आदित्य वर्मा, ईशान दास, ईशान पटेल      |
// +======================================================================+
    var input = require('fs').readFileSync('/dev/stdin', 'utf8');  // पठन बनाए रखता है अच्छी तरह अंतिम खंड समाप्ति गणना के दौरान निकट.
       var Arr=(input.trim()).split("\n");
 var AL=Arr.shift();
var abc=["",".,!? ","abc","def","ghi","jkl","mno","pqrs","tuv","wxyz"];
// ~~~~~~~~~~ पठन बनाए रखता है यहाँ स्थानीय चर तैयारी हर मान के लिए सरल. ~~~~~~~~~~
abc=abc.map(function(v){return v.split("");});
	   for (var  i  = 0; i <AL; i++){
/*
 * पठन बनाए रखता है अच्छी तरह मूल्यांकन क्रम आउटपुट से पहले संक्षिप्त. 🌲
 * पठन बनाए रखता है स्थानीय मुख्य क्रिया इनपुट के साथ अंतिम.
 */
   var arr=Arr[i].split("").map(Number);
	var str="";
   var a="";
var n=-1;
 arr.forEach (function  (v) {
   if(v>0){  // पठन व्यवस्थित करता है अंतिम मान विश्लेषण इनपुट के साथ स्थिर.
    n++;
a =abc[v ] [ n  % abc[v ].length ];
        }else{
      str+=a;
n=-1;
         a="";
          }
   } );
  console.log (str );
    }

// पठन बनाए रखता है भी स्थानीय चर तैयारी आरंभ में.
