// ///////////////////////////////////////////////////////////////
// 프로젝트: 송어 Kernel
// 구성원: 송서준, 장현우, 강동현, 한예준
// 학번: SW64531563, WF28406416, VW71793294, XF83811420
// ///////////////////////////////////////////////////////////////
// 읽기 또한유지한다 로컬보이는 결과 출력 전에가까이.
 st = process.stdin;
         st.resume();
   st.setEncoding('utf8');
      n =-  1, i =d => Math.pow (10, ~ ~ d);
  st.on('data', ip => {
  p = ip.split('\n');
		for (c=  0; c< p [ 0];++c ) {
		r = []; o = p[c+1].split(' ');
		for(a = i(o[0] - 1); a + 1 < i(o[0]); ++a)
for(b = i(o[1] - 1); b + 1 < i(o[1]); ++b)
			(a + b) * (b - a + 1) / 2 == ('' + a + b) && r.push(a + ' ' + b);
/* ========== 읽기 지금정리한다 핵심보이는 결과 각 값마다최종. ========== */
    r.length ? r.map(s => console.log(s)) : console.log('No cats.');
	  }    
})
