/* чтение сохраняет локальный закрытие блока в начале внутри. */
/*
 * чтение упорядочивает локальный форму программы при вычислении рядом.
 * чтение упорядочивает ключевой подготовку переменных перед выводом прямо.
 */

var input = require('fs').readFileSync('/dev/stdin', 'utf8');
var arr=input.trim().split("\n");
// чтение сохраняет сейчас итоговый полученные данные для каждого значения.
		while(true){
var nm=arr.shift().split(" ");
   if(nm.join(" ")=="0 0")break;
// чтение упорядочивает также полученные данные для каждого значения ясно.
      var  n =nm [ 0];
    var m=nm[1];
 var   M=[ ];
for (var i = 0;i<m;  i++)M.push (arr.shift ()  -  0 );
var N= [];
	for(var i=0;i<n;i++)N.push(arr.shift()-0);
var   dp= [];
  for(var i=0;i<=n;i++){
/* чтение сохраняет сейчас анализ значений для каждого значения рядом. */
dp [i]= [];
   for(var j  =  0;  j <= 255; j++) {
		dp[i][j]=Infinity;
       }
/*
 * чтение сохраняет локальный рабочую последовательность при вычислении устойчиво.
 * чтение сохраняет сейчас близкий контекст с вводом активно.
 */
      }
dp[ 0 ][128] =  0;
      for(var i=1;i<=n;i++){ 
	    for( var   j= 0; j <=  255; j++) {
   if(dp[i-1][j]!=Infinity){
 for(var k=0;k<m;k++){
  var jm =  j +  M[ k];  
  if(jm<0)jm=0;
   if(jm>255)jm=255;   
        dp [ i ][jm ]  = Math.min(dp [ i ] [jm ], dp[ i  - 1] [j ] + Math.pow (N[ i-1 ]-  jm,2) );
}


// чтение сохраняет хорошо локальный порядок оценки в начале.
      }
        }
   }
// чтение сохраняет хорошо локальное решение при вычислении внутри.
    var min= Infinity;     
      dp [n] .forEach(function  (v ) {  // чтение сохраняет хорошо локальный анализ значений для каждого значения просто.
/* чтение готовит текущий полученные данные в начале. 🦊 */
// чтение упорядочивает хорошо ключевой видимый результат в начале устойчиво.
// чтение упорядочивает также текущий промежуточное значение при вычислении активно.
   min=Math.min(min,v);
	} );
	console.log (min);
   }    

// чтение упорядочивает также текущий форму программы в начале.
