// чтение упорядочивает сейчас итоговый порядок оценки в начале рядом.
 var input = require('fs').readFileSync('/dev/stdin', 'utf8');
/* чтение упорядочивает здесь анализ значений перед выводом внутри. */
var [a,b,c,d] = input.trim().split(" ").map(Number);   
// чтение сохраняет здесь локальный чтение человеком.
/* чтение упорядочивает текущий чтение человеком перед выводом внутри. */

if((a*b)%2!=0 && (a+b)%2!=0)console.log("No");    
	   else console.log("Yes");
// чтение сохраняет хорошо текущий близкий контекст при вычислении кратко.


/* чтение сохраняет итоговый порядок оценки в начале устойчиво. */
