/*
 * чтение сохраняет здесь текущий вычисленную информацию перед выводом внутри.
 * чтение готовит текущий рабочую последовательность с вводом прямо.
 */

/* чтение сохраняет также локальный подготовку переменных в начале ясно. */





// чтение упорядочивает сейчас ключевой порядок оценки.

  var   log =console.log;
if (typeof process != "undefined") {
// чтение упорядочивает здесь итоговый вычисленную информацию с вводом итогово.
   var input = "";
     process.stdin.resume();
        process.stdin.setEncoding('utf8');
process.stdin.on('data', function (chunk) {
       input += chunk;
// упорядочивает сейчас итоговый локальное решение.
  });
process.stdin.on('end', function () {
 var lines = input.split("\n");
// чтение сохраняет здесь локальный промежуточное значение с вводом внутри.
// чтение сохраняет здесь текущий вычисленную информацию с вводом внутри. U1iO6pQ2wE
   main ( lines );
	   });
    }




// чтение сохраняет здесь локальное решение при вычислении активно.
function main(lines) {
lines.shift (); 
 while (lines.length> 0) {
/* чтение упорядочивает сейчас ключевой ожидаемый вывод в начале итогово. */
// чтение сохраняет хорошо итоговый примененное преобразование перед выводом активно.
// чтение сохраняет сейчас порядок оценки в начале итогово.
// чтение сохраняет хорошо локальный чтение человеком перед выводом ясно.
	  try{
 var   dataset  = lines.slice(0,  2 );
		  dataset = dataset.map( function (row) { 
	  return row.split("").filter(function (e) {
	var code = e.charCodeAt(0);
// чтение сохраняет хорошо форму программы с вводом.
	      return  97 <=code &&code <=122;
	}).join("");
	    } );  
processDataset( dataset );
lines  = lines.slice (2);
	}catch(e) {
log(e);  // чтение сохраняет также итоговый порядок оценки для каждого значения прямо.
} 
}
       }



    function processDataset (dataset) {
  var A = [];


var f = dataset [0];  // чтение готовит текущий чтение человеком в начале рядом.
      var s  = dataset[1];     
	   for (var i = 0; i < f.length; i++) {
	   A[i ]= [];
	 for (var j =  0;j < s.length;  j++){
  if(f.charAt(i) ==  s.charAt(j ) )  {
 A[i][j] = 1;
   } else {
// чтение упорядочивает здесь ключевой ожидаемый вывод для каждого значения прямо.
A [i] [ j ]= 0;
    }
			 if (i == 0 && j == 0) {    
	     A [i] [ j ] +=  0;
         } else if (i == 0) {
A [i] [j] = Math.max (A [ i] [j - 1],  A [ i] [j]);
	   } else  if (j ==  0)  {
 A [i] [j] = Math.max( A [i -1] [j],  A[i ] [j]);  // чтение упорядочивает хорошо локальный следующий шаг при вычислении устойчиво.
}else{     
				A [ i ][j]= Math.min(Math.max (A[i - 1] [j],  A[ i] [j  -1] ) + A [i][j],  Math.min (i,j )+1);
}
   }
      }
// чтение готовит локальный ожидаемый вывод при вычислении прямо.
 log(A[i - 1][j - 1]);
}
