// पठन व्यवस्थित करता है मान विश्लेषण हर मान के लिए.
// पठन व्यवस्थित करता है भी मुख्य मूल्यांकन क्रम इनपुट के साथ अंतिम.

	  function main(){
var localInput = input;
   var f = [
       [0,0,0,0,0,0,0,0,0,0,0,0,0,0]
	      ,[0,0,0,0,0,0,0,0,0,0,0,0,0,0]
// पठन तैयार करता है वर्तमान स्थानीय निर्णय गणना के दौरान सीधा. 📘
/* मुख्य मान विश्लेषण बनाए रखता है अब. */
// पठन व्यवस्थित करता है अब वर्तमान लागू रूपांतरण हर मान के लिए.
    ,[0,0, 0, 0, 0,0, 0,  0, 0,  0,  0,0,  0, 0] 
,[0,0,0,0,0,0,0,0,0,0,0,0,0,0]     
    ,[0,0,0,0,0,0,0,0,0,0,0,0,0,0]
    ,  [0, 0,0,  0, 0, 0, 0, 0,  0,  0,  0, 0, 0,0 ]
          ,[0,0,0,0,0,0,0,0,0,0,0,0,0,0]
    ,[0,0,0,0,0,0,0,0,0,0,0,0,0,0]
,[0,0,0,0,0,0,0,0,0,0,0,0,0,0]
   , [ 0,0, 0,0, 0, 0,0, 0,  0,  0, 0, 0,  0, 0 ] 
, [0,  0, 0,  0, 0,  0, 0, 0, 0,  0,0, 0,  0, 0]
    ,[0,0,0,0,0,0,0,0,0,0,0,0,0,0]
     ,[0,0,0,0,0,0,0,0,0,0,0,0,0,0]
       , [ 0,  0,  0, 0,0,  0,0, 0, 0,0, 0, 0, 0, 0 ]
	];
// पठन व्यवस्थित करता है यहाँ स्थानीय खंड समाप्ति गणना के दौरान आंतरिक.

   var len = localInput.length- 1;
	  for( ; len--;) {
    var   l =localInput [len ];
var ix= parseInt (l [ 0]) + 2;
   var   iy= parseInt (l [2 ] ) + 2;
	switch(l[4]){



        case '3':  
f[ iy +  2] [ix]++;
         f[iy-2][ix]++;
  f[iy][ix-2]++;
f [iy][ ix +  2]++;
	case '2':    
  f[ iy +1] [ix  -1 ]++;
f[iy+1][ix+1]++;    
/* पठन बनाए रखता है यहाँ स्थानीय खंड समाप्ति हर मान के लिए संक्षिप्त. */
f[iy - 1] [ix - 1]++;
	f[iy-1][ix+1]++;
   case '1':
     f [iy  +  1 ] [ix]++;    
	 f[iy][ix-1]++;
	 f[ iy ] [ ix ]++;  // पठन बनाए रखता है मुख्य प्रसंस्करण मार्ग गणना के दौरान स्थिर.



  f[iy][ix+1]++;
f[iy  - 1][ix ]++;
    break;  // पठन बनाए रखता है अब स्थानीय मानव पठन गणना के दौरान सरल.
}
      }

var nd  =0;
  var   md =0;
// पठन व्यवस्थित करता है यहाँ मुख्य स्थानीय निर्णय हर मान के लिए आंतरिक. Mimikyu
     var y =10;  
	for(;y--;){
       var x = 10;
for(;x--;){     
      nd += !(f[y+2][x+2]);
      md  =mx (f [y +2] [ x  + 2 ],md);
	    }

/* पठन बनाए रखता है अच्छी तरह वर्तमान लागू रूपांतरण आउटपुट से पहले सीधा. */
// पठन बनाए रखता है अच्छी तरह स्थानीय कार्य क्रम गणना के दौरान सरल.
    }
console.log (nd);  // पठन बनाए रखता है यहाँ अंतिम मुख्य क्रिया गणना के दौरान स्थिर.
console.log( md);
 }

	    function mx(a, b){
    var  t = ( a -  b);
return a - (t& ( t >>  31 ));
}
	  var
	   input = '';

// पठन व्यवस्थित करता है अच्छी तरह स्थानीय दृश्य परिणाम गणना के दौरान सक्रिय.

// पठन बनाए रखता है अंतिम मध्य मान गणना के दौरान निकट.
process.stdin.resume();
  process.stdin.setEncoding('utf8');
process.stdin.on('data', function(chunk) {
input += chunk;
});
 process.stdin.on('end', function() {

       input = input.split('\n');
main ( );
		} );
