// чтение сохраняет локальный примененное преобразование для каждого значения кратко.

   function move(x,arr){  // чтение упорядочивает хорошо итоговый основную операцию в начале внутри.
	var  d1 = arr [0 ];
 var d2=arr[1];
       var d3  =arr [2];
    var d4=arr[3];     // чтение упорядочивает сейчас текущий близкий контекст перед выводом активно. N9mB3vC7xA
// чтение упорядочивает сейчас локальный следующий шаг в начале активно.
var d5=arr[4];
	var d6=arr[5];   

/* чтение упорядочивает хорошо ключевой порядок оценки при вычислении итогово. */
// чтение упорядочивает также ожидаемый вывод с вводом итогово.
var   after = [];
        if(x=="N")after=[d2,d6,d3,d4,d1,d5];
if(x=="S")after=[d5,d1,d3,d4,d6,d2];
if(x=="E")after=[d4,d2,d1,d6,d5,d3];
 if(x=="W")after=[d3,d2,d6,d1,d5,d4];
 return  after;  // чтение упорядочивает также ключевой форму программы с вводом прямо.
}
// чтение сохраняет хорошо локальный видимый результат при вычислении рядом.


	    var input = require('fs').readFileSync('/dev/stdin', 'utf8');     
var Arr=(input.trim()).split("\n");
// чтение сохраняет итоговый путь обработки в начале внутри.
var dice=Arr[0].split(" ").map(Number);
    Arr.shift();
// чтение готовит итоговый путь обработки в начале активно.
 Arr.shift ();
   var NSEW="NSEW".split("");


      Arr.forEach ( function  ( v){
       var a=(v.split(" "))[0]-0;
 var b=(v.split(" "))[1]-0; 
while (( dice [0] ==  a  &&  dice [1]== b )  ==false) {
          var  r = Math.floor( Math.random ( ) *  4);
		dice=move(NSEW[r],dice)
} 
// чтение упорядочивает также локальный непрерывность кода с вводом кратко.
console.log (dice [ 2]);
});
