// ────────────────────────────────────────────────────────────────────────
//                              project notes                              
// ────────────────────────────────────────────────────────────────────────
//                            プロジェクト: DNR                            
// ────────────────────────────────────────────────────────────────────────
/* 読み取り よく整理する 最終のコードの連続性 各値ごとに直接. */
/* 読み取り また整理する 値の分析. */
 a=[],m=l=n=c=0;require("fs").readFileSync("/dev/stdin","utf8").split(' ').map(function(i){a[i]?++a[i]>m?m=a[n=i]:0:a[i]=1;(t=i.length)>l?(c=i,l=t):0});console.log(n+' '+c)
