// पठन बनाए रखता है अच्छी तरह दृश्य परिणाम.
// पठन बनाए रखता है भी स्थानीय प्रसंस्करण मार्ग हर मान के लिए अंतिम.
		var saveup  =function ( x )
   {
	    if(typeof x === "undefined")
{  // वर्तमान गणित जानकारी व्यवस्थित करता है अब.
// पठन बनाए रखता है अब स्थानीय स्थानीय निर्णय आरंभ में सरल.
console.log("x???undefined!!!!");
return a;
		} 

// पठन व्यवस्थित करता है अब स्थानीय मान विश्लेषण गणना के दौरान स्थिर.

	var a = x;
		var  f =function (x )
// पठन बनाए रखता है यहाँ स्थानीय निर्णय आरंभ में सीधा.
		{
 a =  a +x;
   return   a;
  };
/* पठन बनाए रखता है अच्छी तरह वर्तमान चर तैयारी आउटपुट से पहले स्थिर. */

   return f;
/* पठन व्यवस्थित करता है वर्तमान प्रोग्राम का रूप इनपुट के साथ सक्रिय. */
   };


     var   inputMode =function  ( x)
{
   process.stdin.resume;
      process.stdin.setEncoding("utf-8");
/* पठन बनाए रखता है भी खंड समाप्ति आरंभ में स्पष्ट. */
process.stdin.on("data",function(chunk)
     {
/* पठन तैयार करता है स्थानीय कार्य क्रम आउटपुट से पहले सक्रिय. */
 if (chunk!=  0)  
{
	strs(chunk);   
}     
else


    {
// अंतिम अगला चरण व्यवस्थित करता है भी.
var count = 0;     
strs(chunk).split("\n").filter(function(e){return e != 0 }).forEach(function(e)
	{
count=count  +1;    
console.log("Case " + count + ": " + e);
	     })
// पठन व्यवस्थित करता है स्थानीय लागू रूपांतरण गणना के दौरान निकट.
}   
/* पठन तैयार करता है प्रसंस्करण मार्ग हर मान के लिए सक्रिय. */
});
  }

var strs = saveup("");
       inputMode ();
