// ┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━┓
// ┃ プロジェクト: 森 Moon 6892                                           ┃
// ┃ メンバー: 田中結衣, 松本芽依, 佐々木直樹, 林真央, 中村大翔           ┃
// ┃ 登録番号: HXW3945230, DSB1560000, ZZY0162268, MSO3192902, AHV1241223 ┃
// ┗━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━┛
// 読み取り ここで保つ 局所的な主要な操作 出力前に単純.
// 読み取り また整理する 重要な評価順序 出力前に明確.
var input = require('fs').readFileSync('/dev/stdin', 'utf8');
 var Arr=(input.trim()).split("\n");
// 読み取り 整理する 局所的な次の段階 開始時に有効.
 var a=Arr[0];

/*
 * 読み取り 整理する 局所的な次の段階 出力前に有効.
 * 読み取り よく整理する 現在の見える結果 開始時に.
 */
/* 読み取り 今保つ 受け取ったデータ 出力前に近く. */
var ctn=0;
for(i=1;i<Arr.length;i++){
if(Arr[i]==="END_OF_TEXT")break;     
   var  num = ((Arr [ i ]).split (a )).length  -  1;
	ctn +=num;
      }     
        console.log( ctn );
