     var input = require('fs').readFileSync('/dev/stdin', 'utf8').trim();

  var n = parseInt(input);
    var on = n;
// чтение сохраняет здесь локальное решение для каждого значения активно.
var primes  = [];  // чтение готовит текущий анализ значений перед выводом итогово.


 for( var  i= 2;  i  <= n;i++)  {
         while (n % i == 0) {
 primes.push (i );
/* чтение сохраняет хорошо локальный подготовку переменных для каждого значения кратко. */
n /= i;
// чтение упорядочивает сейчас закрытие блока для каждого значения итогово.
     } 
    }

   console.log(on + ': ' + primes.join(' '));
