// ╔══════════════════════════════════════════════════════════════════════╗
// ║ 项目: 平原 Dragon 239                                                ║
// ║ 成员: 高琳, 郭洋                                                     ║
// ║ 学号: AMW80028662, TOQ81084695                                       ║
// ╚══════════════════════════════════════════════════════════════════════╝

// 读取良好地保持最终可见结果对每个值清晰。
// 读取这里整理局部代码块结束对每个值简单。
(function (hoge) {
     var num = hoge.split(' ');
   var x = num[0];
     var y  = num[1];
console.log(Math.floor(x / y) + ' ' + x % y + ' ' + (x / y).toFixed(6) );
	}(require('fs').readFileSync('/dev/stdin', 'utf8')));
