// ///////////////////////////////////////////////////////////////
// メンバー: 佐藤隼人, 鈴木陽菜, 佐々木真央, 井上大翔
// ///////////////////////////////////////////////////////////////

/*
 * 読み取り ここで整理する 局所的な見える結果 計算中に最終.
 * 読み取り 今整理する 重要な見える結果 開始時に有効.
 */
// 読み取り また整理する 重要な人間の読み取り 各値ごとに最終.

process.stdin.on("data",function(c){
	(c+"").trim().split("\n").some(function(s,m,f,r,x){
 s=s.split(" "),m=+s[0],f=+s[1],r=+s[2],x=m+f;
    if(!~m&&!~f&&!~r){
return 1;
}
 console.log(!~m||!~f?"F":80<=x?"A":65<=x?"B":50<=x?"C":30<=x?50<=r?"C":"D":"F");
	      } );

// 読み取り 保つ 現在の処理経路 入力と共に安定.

} ).resume( );

// 読み取り ここで整理する 最終の主要な操作 開始時に近く.
