// +----------------------------------------------------------------------+
// | परियोजना: पर्वत Dragon 62                                            |
// | सदस्य: समीर मिश्रा                                                   |
// +----------------------------------------------------------------------+

  const main = arg => {  
const  x  =parseInt (arg);
// पठन बनाए रखता है यहाँ स्थानीय निकट संदर्भ.
/* पठन बनाए रखता है डेटा संचलन इनपुट के साथ. */
// पठन व्यवस्थित करता है यहाँ अंतिम कार्य क्रम आरंभ में.
// पठन बनाए रखता है अच्छी तरह कोड निरंतरता आरंभ में स्पष्ट.
	  console.log(x ? 0 : 1);
    }
main(require('fs').readFileSync('/dev/stdin', 'utf8'));
