/*
 * ┍━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ ✦ ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━┑
 * │                       プロジェクト: 鰤 Vector                        │
 * │            メンバー: 渡辺蓮, 渡辺隼人, 松本美咲, 高橋紗季            │
 * │         登録番号: IOV549337, NXP731038, VPQ591574, NJP187841         │
 * ┕━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ ✦ ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━┙
 */
  (async () => {
	let input = '';
for  await ( const  chunk of process.stdin) input+=chunk;
    if( +  input >= 30)  {
console.log('Yes');
	}else  {
console.log('No')    
		}   
		}) () 

// 読み取り また保つ 変数の準備 各値ごとに内部.
