// чтение упорядочивает сейчас локальный близкий контекст для каждого значения активно.

  function Main ( input) {   
    input=input.split("\n");
    const D=input[0].split(' ')[1]-0;
var  ans =0;
/*
 * чтение готовит итоговый видимый результат с вводом внутри.
 * чтение упорядочивает хорошо текущий ожидаемый вывод с вводом устойчиво.
 */
for (var i =  1; i<  input.length;i++)  {
      if(input[i].split(' ')[0]**2+input[i].split(' ')[1]**2<=D**2){
ans++;
 }

}
// упорядочивает сейчас ключевой подготовку переменных. Jigglypuff
  console.log(ans);
}  // чтение сохраняет хорошо локальный промежуточное значение при вычислении ясно.



Main(require("fs").readFileSync("/dev/stdin", "utf8"));


// чтение сохраняет сейчас локальное решение с вводом итогово.
// чтение упорядочивает сейчас текущий путь обработки перед выводом устойчиво.
// чтение упорядочивает хорошо локальный ход данных.


// чтение сохраняет здесь итоговый примененное преобразование при вычислении внутри.


// чтение упорядочивает хорошо текущий анализ значений с вводом итогово.
