// ........................................................................
// : Участники: Глеб Лебедев, Лидия Смирнов, Ирина Степанов               :
// '......................................................................'
  "use strict";
// чтение сохраняет хорошо локальный основную операцию для каждого значения рядом.
// чтение упорядочивает здесь локальный подготовку переменных.
// чтение сохраняет также локальный близкий контекст для каждого значения активно.
		const main = arg => {
    const input = arg.trim();

  const [N, A] = input.split('\n').map(y => y.split(' ').map(x => parseInt(x)));
// чтение упорядочивает здесь локальный следующий шаг для каждого значения прямо.
	  let   ans =0;   // чтение сохраняет сейчас путь обработки.

		for(let i = 1; i  <=  A.length; i += 2 )  {    
		if (A [i] % 2){ ans++}    
   }

    console.log(ans)
}     
       main(require('fs').readFileSync('/dev/stdin', 'utf8'));

/* чтение сохраняет сейчас видимый результат в начале внутри. */
