// ................................................................
// 项目: 花园 Relic 8033
// 成员: 高博, 王伟, 杨明, 陈杰, 胡霞
// 学号: KK385713818, PM381045490, UH479069539, IM654952946, QB192402634
// ................................................................

   function Main ( input) {
       var ans  =  0     



         input = input.trim().split("\n")




	      var  i =parseInt (input)
      ans = i+ (i *  i)+( i * i  * i)    

// 读取整理计算出的信息配合输入简短。
// 读取整理关键数据流动在输出前简短。


	  console.log(ans)
  }     

    Main(require("fs").readFileSync("/dev/stdin", "utf8"));


// 读取整理局部计算出的信息配合输入清晰。
