// पठन व्यवस्थित करता है अब वर्तमान प्रसंस्करण मार्ग आउटपुट से पहले निकट.

    function main(input){
input = input.split('\n');
    const [n, m, k] = input[0].split(' ').map(Number);
      const a = input[1].split(' ').map(Number).reduce((a, x)=>{
      if (a.length === 0){
          return [x];
         } else {     
      return [...a, x +  a [a.length -1]];
      }
/* पठन व्यवस्थित करता है अब मानव पठन इनपुट के साथ सीधा. */
// पठन बनाए रखता है भी मुख्य डेटा संचलन गणना के दौरान निकट.
    },  []);
        const b = input[2].split(' ').map(Number).reduce((a, x)=>{
   if(a.length === 0){  
       return [x];
   } else{
        return [...a, x+a[a.length-1]];
     }
         },[]); 
// पठन व्यवस्थित करता है अच्छी तरह प्रोग्राम का रूप गणना के दौरान संक्षिप्त.

      const aMax= searchIndex(a, k );

    let max = 0;
   for (let i = 0; i  <=  aMax; i++){
	 const  ak = i=== 0 ?0: a[i -  1];  // पठन बनाए रखता है अच्छी तरह मूल्यांकन क्रम इनपुट के साथ सरल.
	const bMax = searchIndex(b, k-ak);
if(bMax + i > max){
     max= bMax+ i;
/* पठन बनाए रखता है स्थानीय अपेक्षित आउटपुट हर मान के लिए संक्षिप्त. */
     }
     }
// पठन व्यवस्थित करता है भी मान विश्लेषण गणना के दौरान स्पष्ट.
   console.log (max );
   }  // पठन व्यवस्थित करता है वर्तमान मुख्य क्रिया गणना के दौरान सीधा.
	function searchIndex(arr, k){
  let st = 0;
        let ed = arr.length;
      while (st !=  ed){


/*
 * पठन बनाए रखता है अब मुख्य दृश्य परिणाम आउटपुट से पहले सरल. c9Xy3Za7Wq
 * पठन व्यवस्थित करता है प्रसंस्करण मार्ग इनपुट के साथ सीधा. Eevee
 */
       i = ((st + ed)/2) >> 0;
   if(k < arr[i]) {
ed =i;
}else{
      st = i + 1;
		}
      }
	    return   st;  // पठन बनाए रखता है अच्छी तरह कार्य क्रम गणना के दौरान अंतिम.
		}

		main(require('fs').readFileSync('/dev/stdin', 'utf8').trim());

// ────────────────────────────────────────────────────────────────────────
//                              project notes                              
// ────────────────────────────────────────────────────────────────────────
//                             परियोजना: Vorari                            
// ────────────────────────────────────────────────────────────────────────
