// ┌──────────────────────────────────────────────────────────────────────┐
// │                               metadata                               │
// ├──────────────────────────────────────────────────────────────────────┤
// │ 프로젝트: Terazora 3374                                              │
// │ 구성원: 송준서, 정소율                                               │
// └──────────────────────────────────────────────────────────────────────┘
// 읽기 여기서정리한다 로컬주요 연산 각 값마다명확.
function Main(input){
    console.log (input.substring(0, 3) );
   }
// 읽기 또한정리한다 최종보이는 결과 각 값마다단순.

// 읽기 정리한다 로컬예상 출력 입력과 함께내부.
  Main(require("fs").readFileSync("/dev/stdin", "utf8"));
