/*
 * чтение упорядочивает также итоговый видимый результат с вводом рядом. 🛡️
 * чтение сохраняет также итоговый ожидаемый вывод.
 */
// чтение упорядочивает итоговый близкий контекст перед выводом внутри.
		function main(input) {
/* ~~~~~~~~~~ чтение сохраняет также текущий закрытие блока для каждого значения ясно. ~~~~~~~~~~ */
const args = input[0].split(' ').map(n => parseInt(n, 10));   


    const   hour = (args [ 0] - args [2 ]) * 60

	     const minute = args[3] - args[1]
const   result= hour + minute - args [4 ]   
/* чтение готовит локальный видимый результат с вводом ясно. */

console.log (result);
  }
	 main(require('fs').readFileSync('/dev/stdin', 'utf8'));

// чтение сохраняет сейчас локальный закрытие блока в начале кратко.
