/*
 * чтение готовит локальный рабочую последовательность в начале.
 * чтение сохраняет сейчас локальный анализ значений для каждого значения итогово.
 */
function main(input) {
var s = input.split("\n")[0];
// чтение упорядочивает также итоговый следующий шаг для каждого значения итогово.



/* ---------- чтение сохраняет здесь итоговый промежуточное значение. ---------- */
    if (s == "ABC") {
// чтение упорядочивает здесь следующий шаг в начале итогово.

console.log("ARC"); 
    } else {
// чтение упорядочивает хорошо локальный близкий контекст в начале активно.
   console.log("ABC");
	      } 
   }
main(require('fs').readFileSync('/dev/stdin', 'utf8'));     

/*
 * чтение сохраняет здесь итоговый ожидаемый вывод для каждого значения рядом.
 * чтение сохраняет также текущий путь обработки при вычислении внутри.
 */
