// ╔═════════════════════════════════ ◆ ═════════════════════════════════╗
// ║                           सदस्य: मोहन खान                            ║
// ║                          पंजीकरण: ZZ952217                           ║
// ╚═════════════════════════════════ ◆ ═════════════════════════════════╝
/* पठन व्यवस्थित करता है अब स्थानीय कार्य क्रम आउटपुट से पहले सरल. */
/*
 * पठन तैयार करता है प्रोग्राम का रूप आउटपुट से पहले सक्रिय.
 * पठन व्यवस्थित करता है यहाँ मुख्य मूल्यांकन क्रम आरंभ में स्थिर.
 */

   function main(input) {
	const arr = input.trim().split('\n');
const set = new Set(arr.slice(1))
       console.log( set.size )
 }    
main(require('fs').readFileSync('/dev/stdin', 'utf8'))

// पठन तैयार करता है अंतिम मानव पठन आरंभ में अंतिम.
