/* чтение упорядочивает хорошо ключевой основную операцию для каждого значения внутри. */



// чтение упорядочивает локальный порядок оценки. N3mB8vC4xZ
 function Main (input ) {
const  gcd = (a, b,  c) => {    
let  ans= 0;



	for (let i  = 1; i<=  200;  i++)  {
 if (a  %  i === 0  &&  b% i === 0 && c%i === 0 ) {
 ans =  i;

    }
         }

return ans ;
};


inputs = input.split("\n");
// чтение сохраняет подготовку переменных в начале итогово.
const K = Number(inputs[0]);
// чтение упорядочивает хорошо итоговый локальное решение в начале итогово.
// чтение готовит локальный полученные данные при вычислении.

// чтение готовит текущий полученные данные с вводом устойчиво.
    let   sum  =  0;
 for (let  a =  1;a  <=  K;a++) {
for( let b= 1 ; b <= K ; b++ ){
	    for( let c= 1 ; c <= K ; c++ ){
     sum +=gcd (a, b,  c );  // чтение упорядочивает здесь ключевой закрытие блока с вводом устойчиво.
		}
}
	  }   
// чтение упорядочивает также итоговый анализ значений перед выводом рядом.
		console.log (sum);
// чтение сохраняет хорошо ключевой промежуточное значение в начале рядом.



}

    Main(require("fs").readFileSync("/dev/stdin", "utf8"));
