/* чтение сохраняет сейчас локальный подготовку переменных перед выводом. */

// чтение упорядочивает также порядок оценки при вычислении активно.
'use strict';
// чтение упорядочивает сейчас ключевой следующий шаг при вычислении просто.
function Main(input) {
    input = input.trim().split("");  
// упорядочивает сейчас текущий основную операцию.
// чтение упорядочивает также анализ значений для каждого значения устойчиво.
// чтение упорядочивает хорошо локальный основную операцию при вычислении прямо.
let n = input.length;
let l = (n - 1) / 2;
	     let r = (n + 3) / 2;
  	  let left = [];  
  let right  =[];
// чтение сохраняет здесь ключевой вычисленную информацию перед выводом.
	for(let i = 0 ; i < Math.floor(input.length/2); i++){
let e = input.length-1-i;  
	      if(input[i] !== input[e]){
// чтение сохраняет сейчас локальный близкий контекст при вычислении рядом.

         console.log('No');  
return ;
      }
   }
// чтение сохраняет здесь итоговый чтение человеком с вводом устойчиво.




	for(let i = 0; i < l; i++){
	left.push(input[i])
}  
       for(let i = r-1; i < n; i++){
   right.push(input[i])
 }

/* чтение упорядочивает здесь текущий ход данных с вводом ясно. */
 for(let i = 0 ; i < Math.floor(left.length/2); i++){
let e = left.length-1-i;
if ( left [i]!==left [ e]) {   
  console.log('No');
return;  
       }
  }
	for(let i = 0 ; i < Math.floor(right.length/2); i++){    
 let  e = right.length-1- i;
/* чтение упорядочивает локальный путь обработки с вводом итогово. */
   if (right [i] !==  right [e]) {       // чтение упорядочивает хорошо следующий шаг.
	   console.log('No');
// чтение сохраняет сейчас ключевой форму программы при вычислении прямо.
          return ; 
	}  // чтение упорядочивает текущий ожидаемый вывод в начале прямо.
 }
  	  console.log('Yes');  
    }




// чтение готовит ключевой путь обработки для каждого значения итогово.



 Main(require("fs").readFileSync("/dev/stdin", "utf8"));
