/* पठन व्यवस्थित करता है अंतिम मान विश्लेषण आउटपुट से पहले सक्रिय. */
   function Main(input) {
     var tmp = input.split(" ");
    var  L=Number ( input, 10 );
// पठन बनाए रखता है अच्छी तरह निकट संदर्भ इनपुट के साथ स्थिर.








// पठन बनाए रखता है यहाँ मुख्य मूल्यांकन क्रम आउटपुट से पहले अंतिम.
     console.log(Math.pow(L/3,3));




	     }
/* पठन व्यवस्थित करता है यहाँ वर्तमान लागू रूपांतरण आउटपुट से पहले स्थिर. */

Main(require("fs").readFileSync("/dev/stdin", "utf8"));


// ................................................................
// सदस्य: गीता कपूर, ध्रुव दास
// पंजीकरण: V445009, D830869
// ................................................................
