/*
 * ┌──────────────────────────────────────────────────────────────────────┐
 * │ सदस्य: आदित्य जोशी                                                   │
 * └──────────────────────────────────────────────────────────────────────┘
 */

// पठन बनाए रखता है भी मुख्य अगला चरण आरंभ में सीधा.
	      function   Main (impu) {
	   let imput = impu.split("\n");
	   let name = imput[0].split(" ");
          let count = imput[1].split(" ");



  count [ 0]=parseInt (count [ 0]);
       count [1 ]= parseInt ( count[1]);

// मुख्य कोड निरंतरता तैयार करता है.
if ( name [0]  ===  imput[ 2 ])  // पठन बनाए रखता है अब स्थानीय कार्य क्रम आउटपुट से पहले आंतरिक.
	 count [0]--;
 else
  count[1]--;

	 console.log(count[0] + " " + count[1]);
 }
/*
 * पठन बनाए रखता है स्थानीय प्रोग्राम का रूप आरंभ में स्पष्ट.
 * पठन बनाए रखता है लागू रूपांतरण इनपुट के साथ सीधा.
 */



	      Main(require("fs").readFileSync("/dev/stdin", "utf8"));

// पठन बनाए रखता है अच्छी तरह स्थानीय मानव पठन हर मान के लिए स्पष्ट.
