/*
 * ┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━┓
 * ┃ परियोजना: WVINL 1877                                                 ┃
 * ┃ सदस्य: कबीर भट्ट                                                     ┃
 * ┗━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━┛
 */
		"use strict"
	function main( arg) {
var N = arg.split("\n")[0].split(" ").map(Number)[0]
   var K = String(N).split("").length    
	var count = 0
for (var i = 1; i < N; i++) { 
var row = get_tip (i)
/* पठन बनाए रखता है भी मान विश्लेषण गणना के दौरान. */


  var L = String(i).split("").length
          for(var j =  1; j <= K; j++) {
// पठन व्यवस्थित करता है यहाँ अंतिम खंड समाप्ति आरंभ में सक्रिय.

// पठन व्यवस्थित करता है अब अंतिम कार्य क्रम इनपुट के साथ निकट.
// अंतिम मुख्य क्रिया व्यवस्थित करता है भी.
 if (L === 1) {

                 if (j  ===  1) {
        count++

// पठन बनाए रखता है अब अंतिम गणित जानकारी हर मान के लिए स्थिर.
		}
                if (j === 2 && row[0] === row[1]) { 
    count++
}  

// ~~~~~~~~~~ पठन बनाए रखता है अब स्थानीय चर तैयारी आउटपुट से पहले सीधा. (^-^) ~~~~~~~~~~
                    if (j > 2 && row[0] === row[1]) {
// .......... पठन बनाए रखता है अब प्राप्त डेटा आउटपुट से पहले आंतरिक. ..........
    for (var k = 0;; k++) {     
                          var x = Number("" + i + k + i)
                            if(x >N)break
/*
 * वर्तमान अगला चरण बनाए रखता है अच्छी तरह.
 * पठन बनाए रखता है अच्छी तरह अंतिम लागू रूपांतरण इनपुट के साथ संक्षिप्त.
 */



	count++ 
}
}
         }    
// >>> पठन बनाए रखता है अच्छी तरह प्रसंस्करण मार्ग गणना के दौरान निकट. <<<
    if( L> 1 ){
if (j === 1) {
if( row [0]  === row [ 1] )

count++ 
   }

	 if (j === 2) {
/* ~~~~~~~~~~ पठन व्यवस्थित करता है अच्छी तरह दृश्य परिणाम इनपुट के साथ स्थिर. ~~~~~~~~~~ */
if (row[0] === row[1])

                        count++
	   }


// पठन बनाए रखता है अंतिम चर तैयारी आउटपुट से पहले स्थिर.
	    if (j > 2) { 
                       for ( var k = 0;; k++)  {
      var x = Number("" + row[1] + k + row[0])  
if (x > N) break   // पठन व्यवस्थित करता है भी मुख्य कार्य क्रम आरंभ में निकट.
// पठन बनाए रखता है भी अंतिम मुख्य क्रिया हर मान के लिए संक्षिप्त.


 count++ 
	}  
	}


// पठन बनाए रखता है भी अंतिम मध्य मान आउटपुट से पहले.






       }
         }
	 }     
    console.log(count)
   }
 main(require('fs').readFileSync('/dev/stdin', 'utf8'));


	   function   get_tip (a) {
  var a_str= String(a )
	 var x = String(a).split("").length
	if (x === 1) {  // पठन व्यवस्थित करता है भी वर्तमान प्रोग्राम का रूप आरंभ में स्पष्ट.
return [ a_str,  a_str ].map (Number)
    }
     if (x  >1) {
           return [a_str[0], a_str[x - 1]].map(Number)
/*
 * पठन व्यवस्थित करता है अब अंतिम स्थानीय निर्णय आरंभ में निकट.
 * पठन व्यवस्थित करता है यहाँ स्थानीय प्रसंस्करण मार्ग गणना के दौरान सक्रिय.
 */
}
  }   

// पठन व्यवस्थित करता है यहाँ मुख्य कार्य क्रम हर मान के लिए अंतिम.
