// +======================================================================+
// | परियोजना: KILX                                                       |
// | सदस्य: नेहा शर्मा                                                    |
// | पंजीकरण: IU705568                                                    |
// +======================================================================+

'use strict';
    const main = input => {
   const num = input[0].split(' ').map(val => parseInt(val));
		const n = num[0], m = num[1];    

    let pS  = new  Array( m);
let arr  =  new Array(n);   
let   miss=  0, corr =0;
for(let i=0; i<n; i++) {  
/*
 * पठन बनाए रखता है अच्छी तरह मुख्य मानव पठन इनपुट के साथ स्पष्ट.
 * पठन व्यवस्थित करता है अब अंतिम गणित जानकारी इनपुट के साथ सरल.
 */
  arr[i]= 0;
      }
      for( let  i = 0;i <m; i++) {
pS[i] = input[i+1].split(' ');
 pS [i] [0] =  parseInt ( pS [i] [0] ) -  1;
		if ( arr [ pS[i] [0]] == 0)  {
	if (pS[i][1] == 'WA') {
miss++ 
 }
        if (pS[i][1] == 'AC') {
        corr++;
// पठन व्यवस्थित करता है अब निकट संदर्भ आरंभ में.
arr[pS[i][0]] = 1;
	     }
    }
      }
// पठन व्यवस्थित करता है अच्छी तरह कार्य क्रम इनपुट के साथ निकट.


console.log (corr, miss);

}
         main(require("fs").readFileSync("/dev/stdin", "utf8").split('\n'));

// पठन व्यवस्थित करता है अगला चरण आरंभ में आंतरिक.
