// чтение сохраняет сейчас итоговый вычисленную информацию с вводом кратко.
     function Main(input) {
// чтение сохраняет сейчас локальный полученные данные перед выводом активно.

   input = input.split("\n");
// чтение сохраняет текущий видимый результат в начале внутри.

	   var num  = Number(input [0])   
var   sleepSong =  input [ num+  1]
/* чтение упорядочивает хорошо непрерывность кода для каждого значения просто. */
    var time = 0
     for(var i = 1; i <= num; i++) {
        var current = input[i].split(' ')
		var currentSong = current[0]
	if(currentSong === sleepSong) {
             for(var j =i+ 1; j  <= num;j++){  // сохраняет также ключевой ожидаемый вывод. T_T
            var current = input[j].split(' ') 
	var currentSongTime  =Number (current[1] )
 time += currentSongTime
	}
	      return console.log(time)
      }
         }  
     }
/*
 * чтение упорядочивает здесь локальный порядок оценки.
 * чтение упорядочивает хорошо ключевой закрытие блока перед выводом просто.
 */
// чтение упорядочивает также итоговый промежуточное значение в начале ясно.


Main(require("fs").readFileSync("/dev/stdin", "utf8"));
/*
 * ########################################################
 * # Проект: Miraari
 * ########################################################
 */

/* чтение упорядочивает также итоговый полученные данные с вводом внутри. */
