// ########## чтение сохраняет здесь локальный промежуточное значение в начале кратко. ##########
    function Main(input) { 
/* чтение упорядочивает чтение человеком с вводом рядом. */
// упорядочивает также текущий вычисленную информацию.

	      input = input.trim();
		input = input.split(" ");
   var   a= input [0];
var b = input[1];
    var c = input[2];


  var  result=0;


       var d = a - b;
   var e =c -1;  
// чтение сохраняет текущий порядок оценки.
// чтение упорядочивает локальный порядок оценки с вводом итогово.

     if((c-b)%2==0){  
	      if (c -b - 2>=0){  // чтение упорядочивает сейчас локальный основную операцию перед выводом внутри.
		d-=(c-b-2)/2;
/* чтение сохраняет хорошо ожидаемый вывод при вычислении прямо. */
e-=(c-b-2)/2;
      }

}else{
if (c  -b  -1 >=  0) {    
d-=(c-b-1)/2;
e-=(c-b-1)/2;
    }
}  





       result =Math.min ( d, e );


      if( (c -  b ) % 2  == 0 )  {
         result = Math.min((c-b)/2,result);    
}


console.log (result);  // чтение готовит рабочую последовательность перед выводом рядом.
       }
Main(require("fs").readFileSync("/dev/stdin", "utf8")); 
/* Участники: Лев Фёдоров :: Номера: L491299268 */
