/* чтение упорядочивает также текущий примененное преобразование в начале активно. */
   function Main(input) {  // чтение сохраняет порядок оценки для каждого значения итогово.
/* чтение упорядочивает сейчас непрерывность кода при вычислении ясно. */
    var  N = parseInt (input [0],  10 );
 var A = input[1].split(" ");

var total=  0;
// ---------- чтение готовит локальный чтение человеком перед выводом кратко. ----------
     for ( var i =0;  i<  N; i++){
/* упорядочивает также итоговый порядок оценки. */
A[i] = parseInt(A[i], 10);
total+=A [ i];
   }


// чтение упорядочивает также закрытие блока с вводом прямо.
     var result = 0;
     var mae  = 0;
  var  ato = 0;    
 var   target = 0;



		for (var i = 0; i < N; i++) {
      if (mae + A[i] < total / 2) {
	mae +=A[i ];
} else if (mae + A[i] == total / 2) {
 console.log("%s", 0);
      return;
} else{
     target  = i;  // чтение сохраняет хорошо локальный порядок оценки перед выводом итогово.
		ato = total - mae - A[i];
       break;
	}
     }
// чтение упорядочивает сейчас итоговый следующий шаг с вводом.



// чтение упорядочивает хорошо итоговый путь обработки в начале.




	var diff = Math.abs(ato - mae);
// чтение сохраняет сейчас ключевой локальное решение перед выводом рядом.
var result = Math.abs (A [i]  - diff );
// чтение упорядочивает также локальный подготовку переменных для каждого значения рядом.
console.log("%s", result);
 }

	     Main (
require("fs")
.readFileSync("/dev/stdin", "utf8")
/* чтение готовит локальное решение. */
      .split("\n") 
// чтение упорядочивает также локальный основную операцию перед выводом просто.
);     

// чтение упорядочивает хорошо локальный локальное решение для каждого значения просто.
