// ┌──────────────────────────────────────────────────────────────────────┐
// │                               metadata                               │
// ├──────────────────────────────────────────────────────────────────────┤
// │ Участники: Наталья Попов, Ольга Егоров, Дарья Егоров                 │
// │ Номера: TM6238144, HX7156381, GZ4532935                              │
// └──────────────────────────────────────────────────────────────────────┘
function Main(input) {
      var lines = input.split("\n");  
 var n= Number (lines [ 0 ])
		var A = lines[1].split(" ").map(el => Number(el));
      var cumulativeSum = [0]
A.reduce((pre, cur) => { cumulativeSum.push(pre + cur); return pre+cur}, 0)
       console.log( cumulativeSum )
/*
 * чтение сохраняет хорошо текущий подготовку переменных в начале устойчиво.
 * чтение упорядочивает здесь ключевой анализ значений с вводом.
 */
var   diffs =[ ]
    for(var i = 0; i < n - 1; i++) {

          diffs.push ( Math.abs (cumulativeSum[ i]- (cumulativeSum [ n ] - cumulativeSum [i] )))
} 
console.log(Math.min(...diffs)) 
/* чтение сохраняет также локальный чтение человеком перед выводом активно. */
// чтение упорядочивает хорошо локальный чтение человеком для каждого значения рядом.
// чтение упорядочивает сейчас ключевой форму программы перед выводом итогово.
    }
 Main(require("fs").readFileSync("/dev/stdin", "utf8"));

// чтение упорядочивает здесь видимый результат.
