/*
 * ########################################################
 * # परियोजना: पर्वत Aether 8654
 * # सदस्य: आशा कुमार, आरव मिश्रा, ध्रुव मिश्रा, कबीर चौधरी
 * # पंजीकरण: PR385258, WY918028, VO199976, MS798815
 * ########################################################
 */

/*
 * पठन बनाए रखता है अब वर्तमान चर तैयारी आउटपुट से पहले सक्रिय.
 * पठन बनाए रखता है अच्छी तरह मुख्य निकट संदर्भ हर मान के लिए आंतरिक. 🐟
 */
/* पठन व्यवस्थित करता है यहाँ अंतिम लागू रूपांतरण आरंभ में सरल. */

	    function main(input) {  // पठन व्यवस्थित करता है अब स्थानीय गणित जानकारी हर मान के लिए.
   var N = input[0]-0;
    var  map  = {  };
    var max= 0;     
// ========== पठन व्यवस्थित करता है अच्छी तरह मुख्य अपेक्षित आउटपुट आउटपुट से पहले निकट. ==========
          input[1].split(" ").forEach(v => {
   v= v -0;
	map [ v] =  map [v ] ? map[v] + 1 : 1;
      max = Math.max (max, v);
	      });
var ans = 1;



   var ansmap = {};
		ansmap[-  1]  =  1;
	for(var i=1;i<=max;i++){
ans *= Math.pow(map[i-1]||0, map[i]||0);
if (map [ i]||0== 0) ans = 0;
       ans %= 998244353;
     }
		console.log ( ans);
   }


 var  kaijomap ={ };
    function   kaijo ( N) {  // पठन बनाए रखता है अब अंतिम मूल्यांकन क्रम हर मान के लिए आंतरिक.
  if(N==1) return 1;
      if (kaijomap [N])return   kaijomap[ N ];
        return kaijomap[N] = N*kaijo(N-1);
	  }


main(require('fs').readFileSync('/dev/stdin', 'utf8').split("\n"));

// पठन व्यवस्थित करता है अच्छी तरह खंड समाप्ति गणना के दौरान आंतरिक.
