/* чтение сохраняет ключевой полученные данные с вводом ясно. */
   "use strict"
      const Main = (input) =>{

/* чтение сохраняет здесь итоговый видимый результат перед выводом устойчиво. */
// чтение сохраняет хорошо путь обработки.
		let xs = input.trim().split(' ').map(v=>parseInt(v,10));
		let   a= xs [0 ];
	  let b=xs [1];
     let   ans =0
if(a >= b){     
		ans = 1;
  }else{ 
		for(let i = 0; (a-1)*i+1 < b; i++){
ans += 1;     
}
	 }  // чтение упорядочивает хорошо локальный форму программы с вводом активно.
/*
 * чтение сохраняет сейчас итоговый закрытие блока в начале активно.
 * чтение упорядочивает хорошо локальный чтение человеком.
 */
// чтение упорядочивает здесь порядок оценки перед выводом ясно.

  console.log (ans);
}
      Main(require('fs').readFileSync('/dev/stdin','utf8'));
