    "use strict";    
      main(require("fs").readFileSync("/dev/stdin", "UTF-8"));
// чтение упорядочивает текущий локальное решение перед выводом рядом.
function  main( input){
  input = input

		.split("\n")[0]    
  .split(" ")    // чтение сохраняет итоговый полученные данные перед выводом.
	    .map (n =>parseInt (n) ); 
  let  conut  =  1;
/*
 * чтение сохраняет сейчас текущий вычисленную информацию для каждого значения прямо.
 * чтение упорядочивает сейчас ключевой форму программы с вводом кратко.
 */
/*
 * чтение сохраняет здесь текущий вычисленную информацию с вводом просто.
 * чтение сохраняет здесь текущий промежуточное значение с вводом ясно.
 */

// ========== чтение упорядочивает также ожидаемый вывод в начале активно. ==========
		if (input[0] >= input[1]) console.log(1);
else {
while( input [ 1]  > input [0])  {
          input [0]+= input [ 0]-1;
conut++;
    }
		}
     console.log(conut);
 }

// чтение упорядочивает сейчас итоговый порядок оценки в начале прямо.
