// ================================================================
// Проект: Гора Elder
// Участники: Лев Козлов, Алексей Михайлов, Дарья Новиков
// Номера: LX365716079, NG545346921, SR445265285
// ================================================================

// чтение сохраняет хорошо ключевой близкий контекст.

	function reverseStr (str ){
      var splitString = str.split("");  
 var reverseArray = splitString.reverse(); 
    var joinArray = reverseArray.join("");   
console.log ( joinArray)
// чтение сохраняет хорошо итоговый близкий контекст с вводом внутри.

    }
reverseStr("Harry")  // чтение сохраняет здесь локальный основную операцию при вычислении просто.

// чтение упорядочивает также итоговый примененное преобразование с вводом прямо.
