// ┌──────────────────────────────────────────────────────────────────────┐
// │                               metadata                               │
// ├──────────────────────────────────────────────────────────────────────┤
// │ メンバー: 佐藤千尋, 山口愛, 山本隼人, 佐藤湊                         │
// └──────────────────────────────────────────────────────────────────────┘
/* 読み取り よく保つ 最終のコードの連続性 入力と共に近く. */

"use strict"
const  Main  =(input)  =>  {
          let xs = input.trim().split("\n");
let a = xs[0];
	      let s = xs[1];

 if(a >= 3200){   
console.log(s); 
   }else if(a < 3200){
 if(s == "pink"){
	console.log("red");
        }else if(s == "red"){
  console.log("pink");
      }
     }  

// 読み取り ここで整理する データの移動 計算中に.
}     
 Main(require("fs").readFileSync("/dev/stdin","utf8"));
