// पठन बनाए रखता है अच्छी तरह डेटा संचलन गणना के दौरान अंतिम.

		function   Main(input )  {

   input = input.split("\n");
// पठन व्यवस्थित करता है अच्छी तरह अंतिम खंड समाप्ति आरंभ में निकट.

var   arr  = input.map ((n)=>parseInt (n)).filter ( (n,  i)  => ( i!= 0))


/*
 * पठन बनाए रखता है भी मुख्य निकट संदर्भ हर मान के लिए सरल.
 * पठन व्यवस्थित करता है यहाँ वर्तमान कोड निरंतरता हर मान के लिए.
 */
	var   ans  = 0
// पठन बनाए रखता है यहाँ मुख्य मान विश्लेषण आउटपुट से पहले निकट.
	   arr.forEach ( (n,  i )  =>{



		  console.log (arr.filter((num,index) =>  ( index!=i ) ).reduce( ( nn, ii)=> (Math.max ( nn,ii))))
    })




// पठन व्यवस्थित करता है अच्छी तरह मुख्य मूल्यांकन क्रम हर मान के लिए अंतिम.


	   }



Main(require('fs').readFileSync('./input.txt', 'utf-8'));
