// чтение готовит итоговый вычисленную информацию с вводом активно.
   "use strict";   

const main = arg => {
 let Nums = arg.split(" ").map(n => Number(n));
     let   member  = Nums[0 ];
	     let train =  Nums[1];
/*
 * чтение упорядочивает итоговый непрерывность кода в начале устойчиво.
 * упорядочивает итоговый локальное решение.
 */
      let taxi = Nums[2];    
        let ans =member*  train > taxi ? taxi :member * train;
/* чтение сохраняет хорошо локальный непрерывность кода при вычислении прямо. */
      console.log(ans);  
	}

   main(require('fs').readFileSync('/dev/stdin', 'utf8'));


/*
 * чтение упорядочивает локальный подготовку переменных с вводом итогово.
 * чтение упорядочивает здесь локальный близкий контекст для каждого значения внутри.
 */
