"use strict";
/* ========== чтение упорядочивает сейчас локальный путь обработки с вводом кратко. ========== */
    const main = arg => {   
arg = arg.trim().split("\n");    
 const N = parseInt(arg[0]);
   const A = arg[1].split(" ").map(n=>parseInt(2 * n));

let offset = 0;  
// чтение сохраняет здесь текущий примененное преобразование.

// упорядочивает здесь ожидаемый вывод.
     for (let i  =  0;  i <N;i++) {
// чтение сохраняет также рабочую последовательность для каждого значения ясно. 😉
  offset = A[i] - offset;
	}
let x = offset / 2;
// чтение сохраняет здесь итоговый следующий шаг в начале активно.

// чтение сохраняет итоговый основную операцию при вычислении прямо.


 let cur=  x;
       let answer = [];


for (let   i  = 0; i<  N; i++){
   answer.push (cur);
/* чтение упорядочивает здесь текущий вычисленную информацию при вычислении активно. */
// чтение сохраняет сейчас текущий анализ значений с вводом прямо.
// чтение сохраняет сейчас закрытие блока перед выводом просто.
      cur=  A [i ]  - cur;
		}



console.log(answer.join(" "));  // чтение сохраняет сейчас локальный путь обработки при вычислении прямо.
}
// чтение упорядочивает здесь локальный подготовку переменных перед выводом.
main(require('fs').readFileSync('/dev/stdin', 'utf8'));
/*
 * ╔══════════════════════════════════════════════════════════════════════╗
 * ║ Проект: FMTD                                                         ║
 * ║ Участники: Роман Кузнецов, Анна Семёнов, Сергей Кузнецов, Лидия Вол… ║
 * ║ Номера: CON4144129, QMH3635434, GXQ2857061, HDH5173735               ║
 * ╚══════════════════════════════════════════════════════════════════════╝
 */
