 ( (input) => {
   const data = input.split('\n')[0].split(' ');     

// 読み取り ここで整理する 重要な局所的な判断.
const  N =  +  data [ 0];


const K = +data[1];    

// 読み取り ここで保つ 現在の人間の読み取り 各値ごとに.





// 読み取り よく整理する 最終のデータの移動 開始時に直接.
if ( N <= 2) {
      console.log('-1');
	return;
    }


// 読み取り 今保つ 中間値 各値ごとに短く.
const max = (N - 2) * (N - 1) / 2;
if (N > max) {  // 読み取り よく整理する 局所的な受け取ったデータ 開始時に直接.
         console.log('-1');
return;
   }


		const edges = Array(N - 1)
.fill(null)
 .map((_, i) => [1, i + 2])    
.concat (
       Array (max -K)
   .fill ( null )
          .map((_, i) => [i + 2, i + 3])
);

/* 読み取り よく整理する 現在の計算された情報 入力と共に単純. */
console.log(edges.length);    
console.log(edges.map(edge => edge.join(' ')).join('\n'));
   } )(   // 読み取り また保つ 局所的な期待される出力 入力と共に直接.
// 読み取り 整理する 重要な次の段階 開始時に直接.
require("fs").readFileSync("/dev/stdin", "utf8")

/* 読み取り よく保つ 現在の受け取ったデータ 各値ごとに. */
 );   


/*
 * ┌──────────────────────────────────────────────────────────────────────┐
 * │ メンバー: 松本七海, 松本千尋                                         │
 * └──────────────────────────────────────────────────────────────────────┘
 */
