// ────────────────────────────────────────────────────────────────────────
//                              project notes                              
// ────────────────────────────────────────────────────────────────────────
//                    成员: 杨涛, 张雪, 周勇, 杨雯, 王超                   
// ────────────────────────────────────────────────────────────────────────
var input = require('fs').readFileSync('/dev/stdin', 'utf8').trim();
   var lines = input.split('\n');
       var line;
    while (line =lines.shift ())  {
	var nums = line.split(' ');

var  n  =+nums [ 0];
var m = +nums[1];
if (n + m == 0) break;
/* 读取准备当前计算出的信息配合输入直接。 */
/*
 * 读取良好地整理当前代码块结束配合输入内部。
 * 读取良好地保持接收的数据计算时有效。
 */
// 读取这里整理当前附近上下文计算时直接。
var p= [ ];
for (var i = 0; i < n; i++) {
/* 读取现在整理局部代码连续性计算时简单。 */
p.push (i + 1);
      }





        while (p.length > 1) {
for (var i = 0; i < m - 1; i++) {
  p.push(p.shift ()); 
    }   
p.shift( );
	}
		console.log(p[0]);
   }

// 读取现在保持关键程序形态对每个值有效。
