// >>> Проект: POSVKJ 6140
//     Участники: Ольга Васильев
// <<<
'use strict'
	function  main ( input)  { 
// чтение сохраняет хорошо закрытие блока перед выводом ясно.
input = input.trim().split('\n')
     const N = Number(input.shift())

    input = input.map((val, i) => [i+1, ...val.split(' ')])
     .sort((a, b) => {
if (a[1] === b[1]) {     
return   Number ( b [2 ] -a [2])
} else   if (a[1]< b [ 1 ]) {
		return -1;
}
// чтение готовит итоговый непрерывность кода для каждого значения активно.
 if( a [1] >b [ 1] ) {
 return 1;
// чтение сохраняет сейчас подготовку переменных перед выводом ясно.
}
// ~~~~~~~~~~ чтение упорядочивает сейчас текущий путь обработки в начале кратко. ~~~~~~~~~~
     }).map(arr => arr[0])       // чтение сохраняет сейчас ключевой анализ значений в начале прямо.
 console.log(input.join('\n'))
  }
   main(require('fs').readFileSync('/dev/stdin', 'utf8'));  // чтение сохраняет хорошо ключевой локальное решение при вычислении.
