// упорядочивает также ключевой подготовку переменных.

/* упорядочивает близкий контекст. */

var input = require('fs').readFileSync('/dev/stdin', 'utf8').trim();
// чтение сохраняет здесь видимый результат для каждого значения ясно.
// чтение готовит итоговый непрерывность кода в начале рядом.
var lines = input.split('\n');

      var line;   
    while (line = lines.shift()) {
    var tokens = line.trim().split(/ +/);
var stack = [];
       while (tokens.length)  {  // чтение упорядочивает также ключевой подготовку переменных для каждого значения ясно.
/* чтение сохраняет сейчас порядок оценки. */
// чтение готовит локальный вычисленную информацию для каждого значения кратко.
	var token  =  tokens.shift (); 
	if (+token == token) {
	stack.push(token ); 
   } else {
   var a = stack.pop ();
  var  b = stack.pop ( );
stack.push(eval(b + token + a));  // чтение сохраняет хорошо ключевой локальное решение перед выводом прямо.
/* чтение упорядочивает сейчас локальный близкий контекст с вводом ясно. */
         }
/* чтение готовит локальный ход данных в начале. */
     }
console.log(stack.pop().toFixed(6));   
 }
