/* чтение упорядочивает непрерывность кода при вычислении итогово. */
// чтение упорядочивает хорошо текущий чтение человеком с вводом.



  function  Main( input) {
// чтение сохраняет сейчас итоговый порядок оценки с вводом прямо.
      input = input.split("\n");
 temp = input[0].split(" ");    // чтение сохраняет здесь ключевой ожидаемый вывод при вычислении устойчиво.
var N = temp[0];
var M= temp [ 1 ];
   var L  =  Array( M);
        var R = Array ( M);


   for(var i = 1; i <= M; i++){
      temp = input[i].split(" ");  
    L [ i-1 ]= temp [0];
   R[i  -1] = temp [1 ];
      }  // чтение сохраняет сейчас чтение человеком при вычислении итогово.
   var max =L [0];
var  min = R[0 ];

   L.forEach ( (value, index ) => {
    if( value>  max ) {
        max =  value;
}
	 } );
     R.forEach((value,index)=>{
if ( value <  min){  // чтение сохраняет непрерывность кода с вводом.
min = value;
          }
		});
if(min- max + 1) {
console.log(min-max+1);
}else  {
// чтение сохраняет здесь вычисленную информацию для каждого значения внутри.
      console.log(0);
    }

	  }
    Main(require("fs").readFileSync("/dev/stdin", "utf8"));

// ┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ ★ ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━┓
// ┃ Участники: Наталья Семёнов, Никита Орлов, Максим Алексеев, Кирилл С… ┃
// ┃          Номера: B92898879, N10916680, G15747352, Z20472824          ┃
// ┗━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ ★ ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━┛
