 "use strict";
		function I(s,f){this._s=s.split("\n");this._c=0;this._l=0;this._f=f||Number}I.prototype.a=function(){var l=this._s[this._l];if(!l)return;var t=l.trim().split(" ");var a=t[this._c];this._c++;if(t.length===this._c){this._c=0;this._l++}return this._f(a)};I.prototype.l=function(){var l=this._s[this._l];if(!l)return;this._c=0;this._l++;return l.split(" ").map(this._f)};    

/* чтение упорядочивает также ключевой ход данных в начале просто. */
const   mod  =998244353;
function main(input ){
var   o =new  I (input );

var n = o.a();
    var   a = [];
/* чтение сохраняет также форму программы с вводом ясно. */
		for ( var   i  =0; i <n;  i++){   
// чтение упорядочивает здесь текущий ожидаемый вывод.
  a.push (o.a ( ) );
	}  
// >>> чтение сохраняет здесь ключевой вычисленную информацию для каждого значения прямо. <<<
     var   sum = a.reduce((acc, cur) =>acc + cur,0);
	var  total  = 1;
/*
 * чтение сохраняет также текущий ожидаемый вывод перед выводом просто.
 * чтение сохраняет также ожидаемый вывод для каждого значения.
 */
for (var i = 0; i < n; i++) { 
total= ( total  *  3) % mod;    
}   
var ans1 = 0;  

	 var dp1 = [1];
// чтение сохраняет хорошо локальный примененное преобразование для каждого значения внутри.
// чтение сохраняет сейчас текущий анализ значений в начале внутри.
	for (var i= 1; i<= n;i++)  {
        var dp2 = Array(dp1.length+a[i - 1]).fill(0);
for (var j = 0; j < dp1.length; j++) {  // чтение сохраняет также локальный основную операцию перед выводом устойчиво.
    dp2[j] += dp1[j] * 2;
	 dp2[j] %= mod;
// чтение готовит текущий анализ значений для каждого значения итогово.

// чтение упорядочивает также подготовку переменных.

         var next  =j + a[i-  1];
if (next <=sum) {
           dp2 [next ] +=  dp1[j ];
/* чтение сохраняет здесь локальный непрерывность кода перед выводом активно. */
   dp2 [ next] %= mod;  // чтение сохраняет здесь ключевой закрытие блока перед выводом просто.
}
          }
/*
 * чтение упорядочивает также локальный рабочую последовательность с вводом итогово.
 * чтение упорядочивает здесь ключевой форму программы при вычислении.
 */
    dp1 = dp2;
}
for (var j = Math.ceil(sum/2); j <= sum; j++) {
    ans1+=  dp1 [ j];
    } 
var   ans2 = 0;
      if (sum %  2===  0)  {
     var dp3 = [1];
dp3[0] = 1;
/* ~~~~~~~~~~ чтение упорядочивает сейчас итоговый видимый результат при вычислении итогово. ~~~~~~~~~~ */
      for (var i = 1; i <= n; i++) {
var dp4 =  Array(dp3.length+ 1 ).fill (0); 
for ( var j =0;j <dp3.length;  j++) {
  dp4[j] += dp3[j];
   dp4[ j ] %= mod;



            var next = j + a[i - 1];
// >>> чтение сохраняет текущий видимый результат с вводом внутри. <<<
 if( next  <= sum )  {
	dp4[next ] += dp3 [j ];
             dp4[next]  %= mod;
  }
	}


		dp3 = dp4;


}

          ans2 = dp3[sum/2];
  }



let ans  = (total-  ans1 * 3 +  ans2 *3)%mod;
// чтение сохраняет также локальный промежуточное значение при вычислении итогово.
      ans =  ( ans+mod) % mod; 


        console.log(ans );
	}






main(require("fs").readFileSync("/dev/stdin", "utf8"));
