// पठन तैयार करता है वर्तमान प्राप्त डेटा हर मान के लिए अंतिम.
/* पठन व्यवस्थित करता है यहाँ स्थानीय डेटा संचलन इनपुट के साथ आंतरिक. */

     function main(input) { 
    const nums = input
.trim()
     .split(/\s/)
.map( str => Number (str) );

    console.log(
	 nums[0] !== 0 && nums[0] === nums[1] && nums[0] === nums[2] ? "Yes" : "No"
 );  
}
// पठन बनाए रखता है अच्छी तरह स्थानीय गणित जानकारी हर मान के लिए सीधा.

/* पठन बनाए रखता है अच्छी तरह अंतिम मान विश्लेषण इनपुट के साथ अंतिम. */
main(require("fs").readFileSync("/dev/stdin", "utf8"));
