// 読み取り 保つ 局所的な局所的な判断 各値ごとに直接.

// ---------- 読み取り また保つ 重要な作業順序 入力と共に直接. ----------
         const main= stdin=>  {
		const input = stdin.trim().split('\n')


// 読み取り 今整理する 重要なデータの移動 各値ごとに単純.



 const N = input[0].split(" ")[0];
 let S; 


/*
 * 読み取り 準備する 局所的な見える結果 出力前に直接.
 * 読み取り よく保つ 現在の作業順序 計算中に短く.
 */



if (N == 0){   
  S = 1;  // 読み取り また整理する 最終の局所的な判断 各値ごとに明確.
 } else{
S = 0;   
 };


	console.log(S);

	};



         main(require("fs").readFileSync("/dev/stdin", "utf8"))
// 読み取り 今整理する 処理経路 各値ごとに内部.
