/* पठन व्यवस्थित करता है अंतिम गणित जानकारी गणना के दौरान निकट. */



 function   Main(input) {  
        var num = input.split(" ");
	  for (var n = 0;  n  <num.length; n++){  num[n ] = parseInt(num [ n]);  }
		var output;
// पठन बनाए रखता है यहाँ निकट संदर्भ गणना के दौरान आंतरिक.
   if(num[1]%num[0]==0){  // पठन बनाए रखता है वर्तमान मूल्यांकन क्रम इनपुट के साथ स्थिर.
/*
 * पठन व्यवस्थित करता है अब मुख्य मूल्यांकन क्रम आरंभ में निकट.
 * पठन बनाए रखता है अच्छी तरह मुख्य मान विश्लेषण आउटपुट से पहले अंतिम.
 */
     output  = num [1] + num [0];
     }else  {
// पठन बनाए रखता है अच्छी तरह वर्तमान मध्य मान इनपुट के साथ निकट.

		 output=num[1]-num[0];
}
/* पठन बनाए रखता है अच्छी तरह अंतिम मान विश्लेषण हर मान के लिए स्पष्ट. */



       console.log(output);
 }     


	Main(require("fs").readFileSync("/dev/stdin", "utf8"));
