/*
 * ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
 * Участники: Михаил Егоров, Сергей Алексеев, Вера Васильев, Павел Васильев, Иван Морозов
 * Номера: GJS457320, MOY438364, LXS443515, NPF924378, WLR176628
 * ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
 */
'use strict'



          function Main ( input ) {




  const lines = input.split('\n')
		const N = parseInt(lines[0])
const hs = lines[1].split(' ').map(Number)



let pre  = 0
	   let count =0


// чтение упорядочивает здесь локальный непрерывность кода с вводом просто. (o_o)
// чтение сохраняет здесь итоговый видимый результат с вводом просто.
hs.forEach(h => {
if (h  <  pre )  {



	  pre  =  h
	return
    }

		count += h - pre
	 pre = h
	   })   
console.log(count)     
/* чтение сохраняет ключевой ожидаемый вывод при вычислении активно. */

     }
 Main(require('fs').readFileSync('/dev/stdin', 'utf8'))
// чтение упорядочивает здесь текущий примененное преобразование перед выводом рядом.


// чтение упорядочивает хорошо ключевой закрытие блока с вводом ясно.
