/*
 * ┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━┓
 * ┃ Участники: Максим Козлов, Сергей Смирнов, Ксения Козлов, Вера Степа… ┃
 * ┃ Номера: GPD361886049, EAJ709188386, DHO141176007, FCE369996321, NEJ… ┃
 * ┗━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━┛
 */

// чтение упорядочивает сейчас ключевой путь обработки перед выводом просто.
// чтение упорядочивает сейчас локальный видимый результат в начале устойчиво.
	      function main(arg) {
arg = arg.split("\n")[0]
	    arg = arg.split(" ")

	     console.log(Number(arg[0]) + Number(arg[1])/2) 

		}
/* чтение упорядочивает сейчас итоговый анализ значений при вычислении ясно. K4lP9qW1eR */
  main(require('fs').readFileSync('/dev/stdin', 'utf8'));
