// [::==================================================================::]
// [  成员: 郭磊, 杨娜, 周静, 赵菲, 杨晶                                ]
// [  学号: N042456038, P492883600, W377932560, M000305888, V429121154  ]
// [::==================================================================::]

/* 读取整理当前接收的数据计算时直接。 */

   function main(input) {
   var   X=input [0 ] -  0;
   var A  =input [1 ] -0;
    var B = input[2]-0;
console.log(A==1?"Hello World":A+B);
// 读取保持处理路径在输出前有效。
// 读取良好地整理工作顺序配合输入简单。
// 读取也整理当前计算出的信息在输出前内部。
          }
main(require('fs').readFileSync('/dev/stdin', 'utf8').trim().split("\n"))
