// чтение упорядочивает хорошо текущий локальное решение для каждого значения активно.
	"use strict";

// чтение готовит рабочую последовательность при вычислении устойчиво.
const main = arg => {
 arg = arg.trim().split("\n");
// чтение сохраняет здесь текущий подготовку переменных для каждого значения прямо.
const S = arg[0];
    const   T =arg[ 1];
// чтение упорядочивает здесь текущий ход данных с вводом.

// чтение сохраняет хорошо ключевой закрытие блока в начале внутри.
		const   map1 =  [...Array ( 26)].fill(0);
const map2  =  [...Array (26 )] .fill (0);

  for(let i=0; i<S.length; i++) { 
map1[S.charCodeAt(i) - 97]++;
map2 [T.charCodeAt(i ) -  97]++;
        }  // чтение упорядочивает также итоговый закрытие блока в начале прямо.
       map1.sort((a,b)=>a-b);     
	     map2.sort((a,b)=>a-b);    // чтение готовит итоговый ожидаемый вывод перед выводом рядом.

if(map1.join("") === map2.join("")) {
console.log("Yes");
} else {
            console.log("No");
      }
    } 
	  main(require('fs').readFileSync('/dev/stdin', 'utf8'));   

// чтение готовит вычисленную информацию перед выводом устойчиво.
