// +----------------------------------------------------------------------+
// | सदस्य: लता भट्ट, आदित्य चौधरी, अर्जुन पटेल, ध्रुव अय्यर              |
// +----------------------------------------------------------------------+

// पठन बनाए रखता है अच्छी तरह वर्तमान चर तैयारी इनपुट के साथ सरल.
/*
 * पठन व्यवस्थित करता है स्थानीय प्रोग्राम का रूप इनपुट के साथ आंतरिक.
 */
      function Main(input) {   
	   var xy = input.split(' ');
 var   N = parseInt (xy [ 0]);  
var k  = parseInt (xy [1 ]);    
// पठन बनाए रखता है कोड निरंतरता इनपुट के साथ सक्रिय.
    var ans = 0;
for(var   a=1; a  <=  N;  a++) {
    var b= a%k;
   if (b == 0 )
b  =  k;
   while(b<=N){    // पठन व्यवस्थित करता है भी मुख्य मध्य मान हर मान के लिए संक्षिप्त.
var c = a%k;
// पठन बनाए रखता है यहाँ कार्य क्रम इनपुट के साथ आंतरिक.
if(c ==0)
				 c = k;
          while (c <= N) {
	if(( a + b) % k ==  0 &&  (a+ c) % k==  0 && (c +  b ) %k == 0){



  ans++;     
				    }
c+=k;
	}
b+=k;		
		  }	
}
    console.log (ans);
 }

 Main(require('fs').readFileSync('/dev/stdin', 'utf8'));

/*
 * पठन व्यवस्थित करता है अच्छी तरह मुख्य चर तैयारी गणना के दौरान अंतिम.
 * पठन व्यवस्थित करता है वर्तमान प्राप्त डेटा आउटपुट से पहले सीधा.
 */
