// ........................................................................
// : プロジェクト: 谷 Glyph 1215                                          :
// : メンバー: 中村優斗, 佐藤彩乃                                         :
// : 登録番号: D7679118, Q6965256                                         :
// '......................................................................'

// 読み取り ここで整理する 最終の次の段階 出力前に安定.

function  main(input){     
    var args = input.split(" ");
		var n = args[0];
    var   i =  args[0];
console.log(n - i + 1);
		}
main(require("fs").readFileSync("/dev/stdin", "utf8"));

/* 読み取り 整理する 適用された変換 計算中に直接. */
