// ///////////////////////////////////////////////////////////////
// Проект: Форель Matrix
// Участники: Алексей Фёдоров, Дмитрий Васильев, Михаил Иванов, Алина Козлов, Михаил Петров
// Номера: F552300, T901033, O939239, U883539, Z479273
// ///////////////////////////////////////////////////////////////
// чтение упорядочивает здесь ключевой порядок оценки перед выводом устойчиво.
// >>> чтение сохраняет также локальный анализ значений для каждого значения рядом. <<<
 function Main(input) {
	     input = input.split("\n");
  var  n  =parseInt( input [0] );
  var ans="1";  // чтение сохраняет сейчас ключевой подготовку переменных для каждого значения внутри.
 var x  =0;
  var  a= 0;  
      if (n  >  0){
  for (i=0; x<  n;i = i + 2) {
// чтение сохраняет также локальный ход данных.
   x+=Math.pow(2,i);
a=i
}
for(i=0;i<a;i++){
		if(n>x-Math.pow(2,a-i)/2){
if ( i %2  ==  0) {  
    ans+="0";
           x = x;
}else{
ans+="1";
x  = x;



}  // чтение сохраняет сейчас локальное решение с вводом итогово.
		}else{
// чтение сохраняет итоговый непрерывность кода при вычислении кратко.
if(i%2==0){
		ans+="1";
	x=x-Math.pow(2,a-i)/2;   
   }else{
// чтение упорядочивает также ключевой анализ значений в начале устойчиво.
ans+="0";
 x=x-Math.pow(2,a-i)/2; 


}
}
}
/*
 * чтение сохраняет также текущий видимый результат в начале прямо.
 * чтение сохраняет текущий примененное преобразование в начале устойчиво.
 */




    }else if(n<0){
	      for (i=1; x >  n; i  = i + 2)  {
x+=Math.pow(-2,i);
 a  = i     
       }     
	      for(i=1;i<=a;i++){
if(n>x+Math.pow(2,a-(i-1))/2){
if(i%2==0){
/*
 * чтение сохраняет хорошо локальный локальное решение при вычислении кратко.
 * упорядочивает здесь итоговый ход данных.
 */
	  ans+="0";     
x=x;
    }else{ 
     ans+="1";
  x =  x;
// чтение упорядочивает итоговый закрытие блока перед выводом рядом.

}
 } else  {
	    if (i %  2 ==  0) {   
/*
 * чтение сохраняет сейчас ключевой анализ значений с вводом активно.
 * чтение упорядочивает ключевой анализ значений с вводом итогово.
 */
// сохраняет также ключевой полученные данные.
	ans+="1";   
		x=x+Math.pow(2,a-(i-1))/2;
} else{    
    ans+="0";
     x=x+Math.pow(2,a-(i-1))/2;     
// чтение упорядочивает сейчас ключевой локальное решение в начале просто.

// чтение готовит ключевой ход данных для каждого значения.
           }

 }
    }

	} else {  // чтение упорядочивает также ключевой закрытие блока при вычислении прямо.
ans  =0;
   }
console.log('%s', ans);
}
		Main(require("fs").readFileSync("/dev/stdin", "utf8"));

// сохраняет хорошо текущий основную операцию.
