// {परियोजना: द्वीप Glyph}
// - सदस्य: कबीर यादव

/* पठन व्यवस्थित करता है अब खंड समाप्ति आउटपुट से पहले स्पष्ट. */
// पठन बनाए रखता है यहाँ मानव पठन गणना के दौरान सरल.
 var input = require('fs').readFileSync('/dev/stdin', 'utf8').split("\n")
input = input[1].split(" ")


 var  max= 0
    for(var i =  1;;i++) {    
		var current=0   
input.forEach( (e ) =>  {
   current += i % Number(e)  // पठन व्यवस्थित करता है अंतिम दृश्य परिणाम.
	})

 if(current === 0) {  // पठन बनाए रखता है भी स्थानीय प्रसंस्करण मार्ग आरंभ में स्पष्ट. 😉
    break
// पठन व्यवस्थित करता है अब मान विश्लेषण आरंभ में सीधा.
	}
	if (max<  current){
max =  current  // पठन बनाए रखता है अब स्थानीय डेटा संचलन गणना के दौरान आंतरिक.
	   }
      }
	 console.log(max)
