// 読み取り よく整理する 最終の期待される出力 出力前に短く.
function Main(s){
   s=s.split(/\n|\s/);
	   s [ 0] |=  0;
s[1]|=0;     


    var ans=Math.ceil(s[0]/(s[1]-1));
	  if (s [1]  == 2) {  ans  = s[0] - 1; }
	  else  if((s[ 0 ]% (s[ 1 ] -  1 )) == 1){ans--;} 
// 読み取り 今整理する 局所的な局所的な判断 出力前に有効.

     console.log (ans);     
   }
		Main(require("fs").readFileSync("/dev/stdin", "utf8"));

// ┌──────────────────────────────────────────────────────────────────────┐
// │                               metadata                               │
// ├──────────────────────────────────────────────────────────────────────┤
// │ プロジェクト: WEQKOL 5448                                            │
// │ メンバー: 清水和也                                                   │
// │ 登録番号: ZDJ267219                                                  │
// └──────────────────────────────────────────────────────────────────────┘

/* 読み取り 保つ 局所的な判断 計算中に最終. */
