// पठन व्यवस्थित करता है स्थानीय कोड निरंतरता हर मान के लिए सीधा.

function Main (s ) {
   k = +s;
		var ans= [];
        var   x  = 1;
		var y = "";    
     for(var i = 0; i < k; i++){  // पठन बनाए रखता है अच्छी तरह अंतिम अगला चरण आरंभ में निकट.
ans [ i]= x+  y;
  if( x===  9)  {
x = 1; y += "9";
}else x++;
}
	  console.log(ans.join("\n"));
          }
    Main(require("fs").readFileSync("/dev/stdin","utf8"));

/*
 * पठन व्यवस्थित करता है यहाँ स्थानीय प्रोग्राम का रूप हर मान के लिए स्थिर.
 * पठन बनाए रखता है अब चर तैयारी आरंभ में स्पष्ट.
 */
