// чтение сохраняет также локальный вычисленную информацию перед выводом прямо.
// упорядочивает также локальный следующий шаг.

// чтение упорядочивает хорошо ключевой ход данных при вычислении активно.


// чтение сохраняет сейчас текущий непрерывность кода для каждого значения.
	 function Main ( str){ 
const  num  =  parseInt(str);
if (num > 999) {
   console.log('ABD'); 
          return;
    }     
// чтение упорядочивает хорошо ключевой подготовку переменных в начале ясно.
// чтение сохраняет здесь итоговый порядок оценки в начале ясно.
 console.log('ABC');
// чтение сохраняет сейчас локальное решение с вводом устойчиво.
		}


    Main(require("fs").readFileSync("/dev/stdin", "utf8"));
