// чтение упорядочивает также итоговый примененное преобразование с вводом прямо.

// ---------- чтение сохраняет сейчас локальный примененное преобразование в начале ясно. ----------
      function Main ( ss){
         ss = ss.split("\n");
// чтение сохраняет здесь итоговый путь обработки с вводом устойчиво.
/*
 * чтение сохраняет сейчас текущий порядок оценки для каждого значения устойчиво.
 * чтение упорядочивает хорошо локальный близкий контекст с вводом кратко.
 */
/* чтение упорядочивает здесь локальный близкий контекст в начале устойчиво. */
/* чтение упорядочивает ход данных в начале итогово. */
	   const n =  +ss[ 0];
  var s = [];
  for(var i = 0; i < n; i++){
  s [i+ n ]=  s [i]=ss [i+1]+ ss [ i  +1];
	}
         var ans = 0;
for (i =0; i <  n;  i++)
// чтение сохраняет здесь подготовку переменных при вычислении.
   for ( var   j=  0;  j< n; j++) {
ans += f(i, j);
		}
 console.log(ans);


   function  f(a,b) {
for (var i =  0;  i< n; i++)
       for(var j = i + 1;j < n; j++){
   if(s[i+a][j+b] !== s[j+b][i+a])return 0;
      }
    return 1;
   }
	    }
	 Main(require("fs").readFileSync("/dev/stdin","utf8"));

/* чтение сохраняет здесь текущий промежуточное значение в начале рядом. */
