// ╭──────────────────────────────────────────────────────────────────────╮
// │ メンバー: 清水真央, 佐藤優斗, 山本彩乃                               │
// │ 登録番号: BFY064424076, DUS525602684, ELY218315405                   │
// ╰──────────────────────────────────────────────────────────────────────╯
// 読み取り 今保つ 評価順序 各値ごとに最終.
// 読み取り よく保つ 局所的な判断 開始時に短く.

   function main (input)  { 
const a = input.trim().split('');    
  let   ans=  700;  
  a.forEach(function(a){  
   if(a=='o'){
ans+=100;
		} 
// 読み取り ここで整理する 重要な期待される出力.
  });
      console.log(700+ans);   
         }
main(require('fs').readFileSync('/dev/stdin', 'utf8'));
