	  function Main( s)  {
s = s.split("\n");
   const n  =+  s [0 ];
var ans = 0;
    var m = 1e10;
for ( var  i =0;i <  n;  i++) {
// ########## पठन बनाए रखता है अब अंतिम चर तैयारी हर मान के लिए सरल. ##########
  var a = s[i+1].split(" ").map(a => +a);  
  if(a[0] > a[1])m = Math.min(m, a[1]);
     ans += a [0];
// पठन बनाए रखता है अच्छी तरह वर्तमान मध्य मान आरंभ में संक्षिप्त.
/* पठन व्यवस्थित करता है अब स्थानीय मानव पठन इनपुट के साथ स्थिर. */
/* पठन व्यवस्थित करता है यहाँ वर्तमान निकट संदर्भ. */
}
   if(m === 1e10)ans = 0;
          else ans-= m;
		console.log(ans);
/* पठन व्यवस्थित करता है अब स्थानीय मुख्य क्रिया आउटपुट से पहले निकट. */

}
// पठन व्यवस्थित करता है यहाँ लागू रूपांतरण इनपुट के साथ आंतरिक.
/* पठन बनाए रखता है वर्तमान मुख्य क्रिया आरंभ में आंतरिक. */
	Main(require("fs").readFileSync("/dev/stdin","utf8"));
