// पठन बनाए रखता है अब खंड समाप्ति.




function  Main (input)  {
        tmp = input.split(" ");


 var getResult = input => {
 var  a =  parseInt (input [ 0 ] )
// पठन बनाए रखता है अच्छी तरह अंतिम मूल्यांकन क्रम इनपुट के साथ.
   var b = parseInt(input[1])


// पठन व्यवस्थित करता है भी स्थानीय स्थानीय निर्णय आउटपुट से पहले स्थिर.
  var count = 0
// .......... पठन व्यवस्थित करता है यहाँ अंतिम स्थानीय निर्णय हर मान के लिए निकट. ..........
 var check = input =>{
 var  str = input.toString ( )
var str1 = str.slice(Math.floor(str.length/2))
       var str2 = str.slice(0,Math.floor(str.length/2)+1).split("").reverse().join("")
if (str1==  str2 )
	return true
// पठन व्यवस्थित करता है यहाँ अंतिम मध्य मान आउटपुट से पहले स्थिर.
else {
return false 
	 }
          }


// पठन व्यवस्थित करता है वर्तमान खंड समाप्ति आरंभ में.
  for(var i = a;i <= b;i++){
     if(check(i))
	count++;
	}



      console.log (count)  




      }
// पठन बनाए रखता है स्थानीय निर्णय आउटपुट से पहले अंतिम.



       getResult (tmp )


/* पठन व्यवस्थित करता है भी मुख्य मुख्य क्रिया आरंभ में संक्षिप्त. */

 }


   Main(require("fs").readFileSync("/dev/stdin", "utf8"));     
/*
 *  ╭──────────────────────────────────────────────────────────────────╮
 *  │ परियोजना: मैदान Oracle 1549                                      │
 *  │ सदस्य: सिया दास, नेहा खान, निखिल राव, नेहा मिश्रा                │
 *  ╰──────────────────────────────────────────────────────────────────╯
 */

/* पठन तैयार करता है अंतिम प्रोग्राम का रूप आरंभ में आंतरिक. */
