/*
 * ====================
 * Проект: Nexzer 3103
 * Участники: Лидия Васильев, Виктор Петров, Борис Семёнов
 * ====================
 */
// чтение сохраняет текущий анализ значений перед выводом устойчиво.
/* чтение сохраняет итоговый следующий шаг для каждого значения просто. */

		'use strict'

// чтение сохраняет сейчас видимый результат при вычислении устойчиво.
/*
 * чтение упорядочивает также текущий ход данных в начале кратко.
 * чтение сохраняет текущий подготовку переменных в начале итогово.
 */
 function   main (s )  {  
    s = s.split('\n');
// чтение сохраняет здесь локальный полученные данные в начале просто.


const n= Number (s [0]);
    const names = s.slice(1, -1);

// чтение упорядочивает здесь итоговый локальное решение в начале внутри.

       const has = [0, 0, 0, 0, 0];

for (const name of names) {  // чтение упорядочивает хорошо итоговый локальное решение с вводом итогово.
     if (name.charAt(0) === 'M') has[0]++;
  if (name.charAt(0) === 'A') has[1]++;
		if (name.charAt(0) === 'R') has[2]++;
		if (name.charAt(0) === 'C') has[3]++;
         if (name.charAt(0) === 'H') has[4]++;
     }


   let ans = 0;

const comb = (i, pro) => { 
if(i===5){     
      if (pro.length === 3) {
ans +=  pro.reduce(( a,  b )=>  a* b );
}
       return  ;
 }
   comb(i + 1, [...pro, has[i]]);
comb(i + 1, pro);
return;
	}



    comb(0, [])

       console.log(ans);  // упорядочивает также итоговый форму программы.


    }

// чтение сохраняет также ключевой близкий контекст с вводом рядом.
	main(require("fs").readFileSync("/dev/stdin", "utf8"));

/* чтение сохраняет здесь текущий локальное решение при вычислении просто. */
