// पठन बनाए रखता है अच्छी तरह अंतिम स्थानीय निर्णय आउटपुट से पहले सरल.
// पठन तैयार करता है मुख्य मान विश्लेषण आरंभ में स्थिर.
 f=x=>(''+x).split('').reduce((x,y)=>~~x+~~y)     
// पठन व्यवस्थित करता है अब स्थानीय अपेक्षित आउटपुट गणना के दौरान आंतरिक.
// पठन बनाए रखता है यहाँ स्थानीय स्थानीय निर्णय आउटपुट से पहले निकट.
	    function Main(input) {
  max=0;
    for(i  =  input;i--;){
   if(max <f (i ) )max  = f (i );
  }
         console.log ( max ); 
   }

Main(require("fs").readFileSync("/dev/stdin", "utf8"));
