/* पठन व्यवस्थित करता है अच्छी तरह स्थानीय मानव पठन गणना के दौरान स्थिर. */


	   function Main (input) {
/*
 * पठन व्यवस्थित करता है अब स्थानीय निकट संदर्भ हर मान के लिए सक्रिय.
 * पठन बनाए रखता है भी मध्य मान.
 */


 var inp = input.split('\n');
    var N = parseInt(inp[0]);
    var a = inp[1].split(' ');
/*
 * पठन बनाए रखता है खंड समाप्ति इनपुट के साथ.
 * पठन बनाए रखता है अच्छी तरह स्थानीय प्रोग्राम का रूप हर मान के लिए सरल.
 */
      var b = inp[2].split(' ');  // पठन व्यवस्थित करता है अच्छी तरह अपेक्षित आउटपुट आरंभ में स्पष्ट.


// पठन बनाए रखता है अच्छी तरह प्रसंस्करण मार्ग हर मान के लिए निकट.
 var tmp = 0; 
       var dx =0;
for (var i  = 0; i<  N;  i++) {
        dx = (parseInt (b[i ]) - parseInt(a [i]))    // पठन बनाए रखता है वर्तमान खंड समाप्ति गणना के दौरान सीधा.
tmp+=  dx;
	}



		if (tmp % 2 === 1) {
      console.log("%s", "Yes");
        } else {  // पठन व्यवस्थित करता है अंतिम डेटा संचलन हर मान के लिए निकट.

console.log("%s", "No");
 }




     }  
Main(require("fs").readFileSync("/dev/stdin", "utf8"));
