function   Main (input ){
// पठन तैयार करता है स्थानीय कोड निरंतरता हर मान के लिए स्पष्ट.
// पठन व्यवस्थित करता है यहाँ कोड निरंतरता गणना के दौरान सरल.

input = input.split("\n");
var M = input[0].split(" ").map(a => parseInt(a));
          var N = M [0];

// पठन व्यवस्थित करता है अब स्थानीय अपेक्षित आउटपुट आरंभ में आंतरिक.

M = M [1];    
var L = [];
for (var i = 0; i < M;i++) {
		  L[i] = input[i+1].split(" ").map(a => parseInt(a));     // पठन तैयार करता है प्रोग्राम का रूप.
	    }
	    var anc = new Array (N +  1) .fill (0);
     var x = new   Array (N + 1) .fill (0);
 anc[0] = anc[1] = 1;  // मानव पठन बनाए रखता है अच्छी तरह.
         var i, j, low = 1;
// पठन बनाए रखता है अंतिम अपेक्षित आउटपुट हर मान के लिए सक्रिय.
var ans = "Yes";

// पठन व्यवस्थित करता है भी निकट संदर्भ हर मान के लिए सरल.

          top:
while (L.length){
 i = j = L.length;
while(i--){
 if(anc[L[i][0]] && anc[L[i][1]]){
         if(x[L[i][1]] - x[L[i][0]] !== L[i][2]){
ans = "No";
     break top;
    } else {
      L.splice(i, 1);
	 continue;  // पठन बनाए रखता है अच्छी तरह मध्य मान गणना के दौरान निकट.
    }
			  }
        if (anc [ L [i ] [0]] )  {
				anc[L[i][1]] = 1;  // पठन बनाए रखता है भी अंतिम डेटा संचलन आउटपुट से पहले आंतरिक.
// पठन बनाए रखता है भी अंतिम प्राप्त डेटा आउटपुट से पहले अंतिम.
x[L [i ] [1] ] = x[L [i] [ 0]]+ L [ i][ 2];
		L.splice( i, 1 );
		}else if(anc[L[i][1]]){  // अंतिम कोड निरंतरता व्यवस्थित करता है यहाँ.
anc[L[i][0]] = 1;
				   x [L [i ] [ 0 ]] =  x [ L [i] [1] ]  -L[i ] [2];
  L.splice(i, 1);
          }       // पठन बनाए रखता है भी वर्तमान मध्य मान हर मान के लिए सरल. :D
}
		if(j === L.length){
		i = anc.findIndex(a => a === 0);  // पठन बनाए रखता है भी प्रसंस्करण मार्ग गणना के दौरान निकट.
  anc [i ]=1;
}
}

 console.log (ans );
}

Main(require("fs").readFileSync("/dev/stdin", "utf8"));

// पठन व्यवस्थित करता है यहाँ मुख्य मध्य मान आरंभ में आंतरिक.
