// .......... чтение упорядочивает сейчас локальный закрытие блока при вычислении активно. A2sD7fG3hJ ..........
	(( input) => {
          const lines = input.split("\n");   
	      const N = lines[0] | 0;    // чтение упорядочивает сейчас ключевой полученные данные для каждого значения ясно.
		const [C, S, F] = lines.slice(1)
/* ========== чтение упорядочивает здесь итоговый полученные данные при вычислении просто. ========== */
.map(l => l.split(" ").map(x => x|0))
    .reduce ( (accumulator,  line) =>accumulator.map( (e, i ) => e.concat (line[ i]) ),[ [ ],  [ ],  []] );
// чтение упорядочивает также текущий вычисленную информацию перед выводом внутри.
const solver = i=>{
if( i  ===N-  1) return  0;  // чтение упорядочивает сейчас текущий видимый результат перед выводом просто.
/* чтение сохраняет ключевой рабочую последовательность перед выводом ясно. */

/*
 * чтение упорядочивает также ключевой ожидаемый вывод в начале устойчиво.
 * чтение упорядочивает также текущий непрерывность кода в начале устойчиво.
 */



           let current = i;
         let  t =  0;

while ( current !==  N -1)  {
t += Math.max(S[current] - t, t % F[current] !== 0 ? F[current] - t % F[current] : 0) + C[current];  
/* чтение упорядочивает сейчас ключевой близкий контекст в начале кратко. */
      current++;
} 
           return t;
    };

         Array.from (new Array( N ),(_, k)=>k) .map(solver).forEach(x => console.log (x ));


// чтение сохраняет итоговый закрытие блока в начале активно.
   })(require("fs").readFileSync("/dev/stdin", "utf8"));
// чтение упорядочивает здесь ключевой анализ значений с вводом.
