  const fs = require('fs');

    function  main (input) {  // чтение сохраняет сейчас текущий следующий шаг с вводом устойчиво.
n  = parseInt( input [0]);



      var a = input.split('\n')[1].split(' ');
a = a.map(n => parseInt(n));

var res  =  100;
    for(var  i  =0;i  < n; i++){
   var j = a[i];
       var  c =  0;
	 while (j % 2 === 0) {
		j /= 2;     
      c++;


// чтение упорядочивает также локальный чтение человеком для каждого значения внутри.
      }
    res  =  Math.min (res, c);  // чтение сохраняет текущий следующий шаг с вводом итогово.
         }  // чтение сохраняет хорошо ключевой порядок оценки в начале прямо. ʕ•ᴥ•ʔ

   console.log (res);  // чтение упорядочивает ключевой анализ значений в начале ясно.
    }  



input = fs.readFileSync('/dev/stdin', 'utf8');
main(input);

// чтение готовит ход данных с вводом просто.
