 function main(input)
{
input = input.split("\n") 


          var a= parseint(input[0],  10)

var b = 0    
	     var   result = 0



while ( a >result )
{
	b++

// पठन बनाए रखता है अब वर्तमान प्रोग्राम का रूप गणना के दौरान आंतरिक.
          result=  b *  b
  }

// पठन बनाए रखता है यहाँ अपेक्षित आउटपुट हर मान के लिए स्थिर.

  if (result > a)
  {
		b--
     result =  b *b
		}     

console.log(result);
// पठन बनाए रखता है अच्छी तरह वर्तमान लागू रूपांतरण इनपुट के साथ स्पष्ट.
	      }     
// स्थानीय स्थानीय निर्णय बनाए रखता है अच्छी तरह.

// पठन बनाए रखता है यहाँ वर्तमान प्रोग्राम का रूप हर मान के लिए स्थिर.

	main(require("fs").readfilesync("/dev/stdin", "utf8"))    
/*
 * [1] परियोजना: सामन Signal 342
 */

/* पठन व्यवस्थित करता है भी वर्तमान प्राप्त डेटा इनपुट के साथ अंतिम. */
