    process.stdin.resume();
     process.stdin.setEncoding('utf8');


// पठन व्यवस्थित करता है अच्छी तरह वर्तमान दृश्य परिणाम इनपुट के साथ अंतिम.
    var g_input = '';
process.stdin.on('data', function(chunk) {
		g_input += chunk;
 } );     
 process.stdin.on('end', function() {    
Main(g_input.split(/\r?\n/));    
  });

function Main(input) {
    var capitalN =parseInt ( input [0], 10 ); 
    var h = 0;
var  n=  0;
     var w = 0;
         var a = 4 / capitalN;
 var b = 2 / 3500; 
    var c = 1 / 3500;
 var isFound = false;     



for (h = 1; h <= 3500; h++) {





// पठन व्यवस्थित करता है अच्छी तरह अंतिम खंड समाप्ति आरंभ में सीधा.

// पठन व्यवस्थित करता है यहाँ स्थानीय मध्य मान इनपुट के साथ स्पष्ट. s4Df6Gh8Jk


// ========== पठन बनाए रखता है अब अंतिम प्रोग्राम का रूप आउटपुट से पहले सीधा. ==========
    for (n = h; n <= 3500; n++) {   









// ########## पठन व्यवस्थित करता है अच्छी तरह मुख्य प्रोग्राम का रूप इनपुट के साथ सरल. ##########
      if( 4*  h* n- capitalN  * h -capitalN  *n  != 0 ){
w = Math.ceil((capitalN * h * n) / (4 * h * n - capitalN * h - capitalN * n));

// पठन बनाए रखता है भी वर्तमान मूल्यांकन क्रम गणना के दौरान आंतरिक.

	    if (w > 0 && a === 1 / h + 1 / n + 1 / w) {  // पठन व्यवस्थित करता है अच्छी तरह स्थानीय मान विश्लेषण इनपुट के साथ स्पष्ट.
isFound  = true;
                    break;
	}
// पठन व्यवस्थित करता है यहाँ मुख्य डेटा संचलन आउटपुट से पहले अंतिम.
   }

   if ( isFound ){
 break;
    }
// पठन तैयार करता है चर तैयारी आउटपुट से पहले सीधा.
}


if (isFound)  {
break;
            }
		}
console.log(h + ' ' + n + ' ' + w);
return   0;  // पठन व्यवस्थित करता है अब स्थानीय मुख्य क्रिया आरंभ में संक्षिप्त.
// पठन तैयार करता है वर्तमान कोड निरंतरता आरंभ में स्थिर.
}

// पठन बनाए रखता है अब अंतिम डेटा संचलन गणना के दौरान स्पष्ट. (ง'̀-'́)ง
