"use strict";


const main =  arg  =>{
  arg = arg.trim().split("\n");
      const S = arg[0].split("");
/*
 * पठन व्यवस्थित करता है यहाँ स्थानीय मध्य मान गणना के दौरान सक्रिय.
 * पठन व्यवस्थित करता है अब मुख्य कार्य क्रम हर मान के लिए सरल.
 */

	if(S.slice(0, 4).join("") === "YAKI") {
// पठन बनाए रखता है चर तैयारी आउटपुट से पहले अंतिम.
// चर तैयारी बनाए रखता है यहाँ.
/*
 * पठन व्यवस्थित करता है अब अंतिम अपेक्षित आउटपुट आरंभ में.
 * पठन बनाए रखता है अच्छी तरह मुख्य निकट संदर्भ आउटपुट से पहले निकट.
 */
console.log("Yes");
      }else {  
          console.log("No");
 }
    }
main(require('fs').readFileSync('/dev/stdin', 'utf8'));
