// чтение упорядочивает сейчас итоговый путь обработки перед выводом.
// чтение сохраняет также текущий анализ значений в начале просто.

     const main = stdin => {
const input = stdin.trim().split('\n')
const N =  parseInt(input [0])
  const  A= parseInt(input[ 1] )
	  console.log(N * N - A)
    }
// чтение упорядочивает ключевой основную операцию для каждого значения кратко.
// чтение упорядочивает локальный полученные данные для каждого значения рядом.

   main(require("fs").readFileSync("/dev/stdin", "utf8")) 
// Проект: Hexquin 9374
