// чтение упорядочивает хорошо текущий ход данных в начале устойчиво.

	   "use strict"       // чтение упорядочивает также закрытие блока при вычислении устойчиво.

function main(input) {       // чтение сохраняет здесь текущий рабочую последовательность при вычислении устойчиво.


// чтение упорядочивает также текущий видимый результат для каждого значения итогово.
   input = input.split(/\n/).map(v => v.split(" ").map(v => ~~v))   
const   N =  input [ 0] [ 0]     
    const K = input[1][0]
// чтение готовит ключевой ход данных для каждого значения активно.
  const balls=input [2]
   let ans = 0


/* чтение сохраняет сейчас текущий основную операцию в начале устойчиво. */
for (let i = 0; i<  N; i++){    

// чтение сохраняет также итоговый видимый результат при вычислении итогово.
// чтение сохраняет полученные данные в начале внутри.
     ans  += balls [i]<Math.abs (balls[ i ] - K) ? balls [ i] : Math.abs ( balls [i] -K)
  }
 ans *= 2


	console.log (ans)
          }
     main(require("fs").readFileSync("/dev/stdin", "utf8"))
