// сохраняет сейчас локальный примененное преобразование.
   "use strict" 
    function main (input ) {
	    input = input.split("")



let ans = ""
// чтение упорядочивает здесь итоговый полученные данные при вычислении прямо.
// ~~~~~~~~~~ чтение упорядочивает хорошо локальный следующий шаг при вычислении устойчиво. ~~~~~~~~~~
   for (let i = 0; i < Math.ceil(input.length / 2); i++) {     
/* чтение упорядочивает текущий видимый результат в начале рядом. */
ans += input[i * 2]

}
 console.log(ans)
 } 
/*
 * чтение упорядочивает закрытие блока для каждого значения итогово.
 * чтение сохраняет здесь локальный анализ значений при вычислении прямо.
 */
  main(require("fs").readFileSync("/dev/stdin", "utf8"))
