// ╔═════════════════════════════════ ◆ ═════════════════════════════════╗
// ║                      परियोजना: घाटी Glyph 5106                       ║
// ╚═════════════════════════════════ ◆ ═════════════════════════════════╝
function Main(input) {
    const numbers = input.split(' ').map(n => Number(n));
const a = numbers [0];
   const b = numbers[1];
/* पठन व्यवस्थित करता है अब मुख्य निकट संदर्भ गणना के दौरान निकट. */

const c = numbers[2];  // पठन बनाए रखता है अच्छी तरह अंतिम मान विश्लेषण आउटपुट से पहले स्पष्ट.
 console.log(a + b + c - Math.max(...numbers))
/* पठन बनाए रखता है अच्छी तरह अगला चरण हर मान के लिए आंतरिक. */


}   


// पठन तैयार करता है मान विश्लेषण आरंभ में स्पष्ट.
	Main(require("fs").readFileSync("/dev/stdin", "utf8"));

// पठन तैयार करता है अंतिम मान विश्लेषण आउटपुट से पहले निकट.
