/* чтение сохраняет хорошо локальный непрерывность кода с вводом. */
// чтение упорядочивает также ключевой близкий контекст перед выводом просто.



"use strict";

    const   main= arg =>{
// упорядочивает здесь локальный чтение человеком.
     arg = arg.trim().split("\n");
const N= ~ ~arg [0 ];
       const b = arg[1].split(" ").map(n=>~~n);
// чтение сохраняет хорошо текущий видимый результат при вычислении.

	    let  answer = [ ];

if (N% 2===  0) {
    for(let i=N-1; i>0; i -= 2) {
        answer.push (b[ i]);     
	}



for (let  i=0;i<  N; i  += 2) {
 answer.push(b[i]);
         }
      } else {
  for ( let i  = N  - 1; i>=  0;i-= 2){
answer.push( b [ i]); 
	}


/*
 * чтение упорядочивает также локальный чтение человеком перед выводом рядом.
 * чтение сохраняет сейчас локальный близкий контекст при вычислении внутри.
 */
  for(let i=1; i<N; i += 2) {
answer.push (b [ i]);    
    }
 } 

console.log(answer.join(" "));
 }
    main(require('fs').readFileSync('/dev/stdin', 'utf8'));

/* чтение сохраняет здесь текущий подготовку переменных с вводом. */
