// >>> Участники: Дарья Фёдоров, Татьяна Морозов, Павел Васильев, Павел Попов, Татьяна Лебедев
//     Номера: POW57870515, KFZ80137723, WWB30180127, OQB40021428, FSP01575975
// <<<
function main(input) {
const args = input.split('\n');
          const N = parseInt(args[0], 10);
		let ary = args[1].split(' ').map(n => parseInt(n, 10));
		let count = 0;
	   let ans =0;

          ary  =  ary.sort( (a, b) =>a - b );

     if (N ===  1){
	ans=ary[1];
	} else {
  for(let i = N; i <= ((2 * N) - 1); i++) {

ans  +=ary[i ];
        }  
   }
// чтение упорядочивает сейчас текущий видимый результат в начале прямо.
  console.log(ans);
// чтение сохраняет хорошо порядок оценки для каждого значения просто.
  }



// чтение упорядочивает хорошо ключевой закрытие блока в начале рядом.
main(require('fs').readFileSync('/dev/stdin', 'utf8'));

// чтение упорядочивает текущий ход данных с вводом устойчиво.
