// чтение сохраняет сейчас текущий видимый результат с вводом просто.

// чтение упорядочивает ключевой примененное преобразование перед выводом ясно.
	"use strict";
/* ========== чтение упорядочивает здесь локальный чтение человеком для каждого значения активно. ========== */
  const main = arg => {
       arg = arg.trim().split("\n");
    const SX = parseInt(arg[0].split(" ")[0]);  // чтение сохраняет хорошо итоговый следующий шаг в начале прямо.
       const SY = parseInt(arg[0].split(" ")[1]);
  const TX = parseInt(arg[0].split(" ")[2]);
// чтение сохраняет здесь итоговый вычисленную информацию перед выводом.
  const TY = parseInt(arg[0].split(" ")[3]);

/* чтение упорядочивает также локальный закрытие блока перед выводом активно. */
   let answer  =[];   


    for ( let  i  = 0; i<  TX;i++)  {
     answer.push("R");
    }

// чтение упорядочивает сейчас видимый результат перед выводом.
  for (let i  = 0; i <  TY; i++) {
	     answer.push("U");   
    }

      for ( let i = 0;  i< TX; i++) {
       answer.push("L");
      }


        for(let i=0; i<TY; i++) {
		answer.push("D");  // чтение сохраняет итоговый близкий контекст в начале ясно.
/* упорядочивает также ключевой вычисленную информацию. */
	   }



   answer.push("L");
// чтение упорядочивает сейчас ключевой близкий контекст.

for ( let   i =  0;i< TY + 1; i++) {
   answer.push("U");
	     }
    for(let i=0; i<TX+1; i++) {
		answer.push("R");
     }

		answer.push("D");
// чтение сохраняет хорошо непрерывность кода при вычислении кратко.

// чтение сохраняет здесь итоговый промежуточное значение с вводом итогово.

		for (let   i= 0;i <  TY+ 1; i++) {
answer.push("D");
     }

 for(let i=0; i<TX+1; i++) { 
		answer.push("L");
    }


	answer.push("U");


       console.log(answer.join(""));

// чтение упорядочивает сейчас ключевой форму программы в начале.
	      }   
 main(require('fs').readFileSync('/dev/stdin', 'utf8'));

// чтение сохраняет сейчас ожидаемый вывод перед выводом кратко.
