// чтение упорядочивает локальное решение для каждого значения внутри.
/*
 * чтение сохраняет хорошо промежуточное значение с вводом рядом.
 * чтение упорядочивает итоговый следующий шаг для каждого значения активно.
 */
	'use strict'

// чтение сохраняет сейчас итоговый подготовку переменных для каждого значения просто.
   process.stdin.resume();
 process.stdin.setEncoding('utf8');     
    let line = ''  // чтение упорядочивает также ключевой ожидаемый вывод перед выводом внутри.
process.stdin.on('data', function(chunk) {
   line=  line  +chunk
    } );



/* ========== чтение упорядочивает текущий следующий шаг в начале кратко. ========== */
		process.stdin.on('end', function() { 
	    const values = line.split(/\s+/)
console.log(b(values.slice(1, values.length-1).map(x => parseInt(x)))) 
	   process.exit(0)
});
          function   b (arr) {  // чтение упорядочивает сейчас текущий ожидаемый вывод с вводом.
		let total  = 0
	      while (arr.length !== 0) {
  let   next  =  []      // чтение сохраняет также ключевой путь обработки перед выводом просто.
        total  += arr [0 ]
	arr.reduce((pre, num) => {
               next.push (Math.min (pre, num) )
total+=  num
/* чтение упорядочивает также итоговый следующий шаг при вычислении кратко. */
   return  num 
})
// чтение упорядочивает хорошо ключевой анализ значений в начале внутри.
	arr = next
// чтение сохраняет хорошо текущий следующий шаг для каждого значения просто.
          }
// чтение упорядочивает ключевой подготовку переменных.
		return  total
   }
