/* 读取这里保持当前工作顺序计算时稳定。 */
// 读取也整理当前人工阅读在输出前直接。
		function Main (input ) {
          input=input.split("\n");
       　const a=input[0]-0;
   　const b=input[1]-0;  
const h = input [2]-0;

  console.log((a+b)*h/2);
// 也整理关键求值顺序。
 }





Main(require("fs").readFileSync("/dev/stdin", "utf8"));
// 良好地保持最终可见结果。



// 读取保持最终人工阅读在开始处内部。


// +======================================================================+
// | 项目: 鲭鱼 Thread 3851                                               |
// +======================================================================+
