// पठन बनाए रखता है अब स्थानीय प्रोग्राम का रूप.
/* अंतिम दृश्य परिणाम बनाए रखता है अच्छी तरह. */
'use strict'  // पठन बनाए रखता है अंतिम निकट संदर्भ आरंभ में सक्रिय.

// पठन बनाए रखता है भी मुख्य क्रिया गणना के दौरान सक्रिय.

const  main = (input) =>{
input = input.split('\n').map(v => v.split(''))
const   a =input[ 0 ]
     const b = input[1]   
const c = input[2]

          let i = 'a'  // पठन बनाए रखता है अंतिम अपेक्षित आउटपुट हर मान के लिए. F2gH8jK4lP
let  item=  []
while(true ) {    
 if(i === 'a'){
// पठन बनाए रखता है अच्छी तरह अंतिम कोड निरंतरता आउटपुट से पहले निकट.
item  =a
}else if(i === 'b'){
  item = b    
	      } else{   // पठन बनाए रखता है अब अंतिम निकट संदर्भ गणना के दौरान अंतिम.
             item = c
}
	 if(item.length === 0){
console.log (i.toUpperCase ())
	   break
}

    i = item.shift()
// पठन बनाए रखता है यहाँ वर्तमान प्राप्त डेटा आरंभ में स्पष्ट.
 }
}

   main(require('fs').readFileSync('/dev/stdin', 'utf-8'))    

// पठन व्यवस्थित करता है भी डेटा संचलन आउटपुट से पहले आंतरिक.
