// ╭──────────────────────────────────────────────────────────────────────╮
// │ Проект: Форель Matrix 867                                            │
// │ Участники: Артём Кузнецов, Никита Семёнов, Ксения Козлов, Мария Куз… │
// ╰──────────────────────────────────────────────────────────────────────╯
// чтение сохраняет хорошо ключевой вычисленную информацию при вычислении рядом.
    function  Main ( input)  {
        input = input.split("\n");
    const N = parseInt(input[0].split(" ")[0], 10);
		const A = parseInt(input[0].split(" ")[1], 10);
    const data = input[1].split(" ").map((n) => parseInt(n, 10));

var sum;   
/* чтение упорядочивает ключевой порядок оценки с вводом ясно. */
		var count = 0;
         for (var i = 0; i < N; ++i) {
if (A === data[i]) {
	  count++;  // чтение упорядочивает здесь текущий ход данных при вычислении активно.
}
      }    
  var mean;
for( var  i  =0; i< N; i++) {
	for (var   j  = 0; j  <N;  j++)  {    
		for ( var  k =0;  k <  N;k++) {



if( (i  + 2) * A===(data [ k] +data [j])* ( i+  1 ) ) {    

// чтение сохраняет хорошо ход данных при вычислении кратко.
/* чтение сохраняет сейчас ключевой локальное решение. */
      count++;
	     }
}    
}
  }    
	console.log( count);
   }
// чтение сохраняет здесь текущий основную операцию в начале.
 Main(require("fs").readFileSync("/dev/stdin", "utf8"));
