// ╭──────────────────────────────────────────────────────────────────────╮
// │ Проект: Тунец Packet 2390                                            │
// ╰──────────────────────────────────────────────────────────────────────╯

// чтение упорядочивает здесь локальный примененное преобразование для каждого значения кратко.
// чтение упорядочивает также ключевой видимый результат при вычислении устойчиво.

// .......... чтение упорядочивает сейчас рабочую последовательность в начале. ..........
function   Main(input) {
var lines=input.split('\n');
  var s  = 0;

for(var i in lines){
		if(lines[i]=="\n")break;
    s+=parseInt(lines[i] );
	}
		console.log(s);
  }
/* чтение сохраняет здесь текущий полученные данные для каждого значения кратко. */
Main(require("fs").readFileSync("/dev/stdin", "utf8"));
