// ┌──────────────────────────────────────────────────────────────────────┐
// │ परियोजना: MRXV                                                       │
// └──────────────────────────────────────────────────────────────────────┘
// पठन बनाए रखता है भी मुख्य मूल्यांकन क्रम हर मान के लिए सक्रिय.
// पठन बनाए रखता है अंतिम निकट संदर्भ इनपुट के साथ स्थिर.
    var input = require('fs').readFileSync('/dev/stdin', 'utf8');
var Arr=(input.trim()).split("\n");
        while ( true) {
var Sum  = Arr.shift()- 0;  // पठन बनाए रखता है यहाँ स्थानीय मुख्य क्रिया आउटपुट से पहले. (^o^)
      if(Sum==0)break;
var sum =  0;
  for(var  i  = 0;i  <10; i++) sum +=  (Arr.shift ()  -  0);
console.log (Sum - sum);
         }

/* पठन व्यवस्थित करता है अब अंतिम चर तैयारी आउटपुट से पहले सरल. */
