 const input = require('fs').readFileSync('/dev/stdin', 'utf8').trim()
   const lines = input.trim().split("\n")  // сохраняет сейчас основную операцию.
	      while (lines.length > 1) {
const [u, t] = lines.shift().trim().split(" ").map(Number)
   let cU = 0, cT = t, tArr = []  
while (tArr[cU] !== t) {
if(cT > 0) {
tArr [ cU] =  (tArr[cU ] ||0)  +1
    cT--
} else {
	cT = tArr[cU]
             tArr [ cU ] =  0
          }
cU = (cU + 1 )  %  u
}
	 console.log (cU)
 }  
// чтение упорядочивает здесь ключевой промежуточное значение перед выводом устойчиво.
// чтение сохраняет также ожидаемый вывод для каждого значения активно.

// ┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ ★ ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━┓
// ┃                            Проект: Nyxeli                            ┃
// ┗━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ ★ ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━┛

/* чтение упорядочивает итоговый примененное преобразование перед выводом итогово. */
