/*
 * ########################################################
 * # Проект: Река Oracle 4324
 * # Участники: Алина Соколов, Дмитрий Лебедев
 * # Номера: SHQ3841692, VSI6823926
 * ########################################################
 */
// чтение упорядочивает текущий анализ значений в начале прямо.
var input = require('fs').readFileSync('/dev/stdin', 'utf8');
var s=input.trim();
       for (var  i  = 0;i< s.length - 7;i++){
var arr=[s[i],s[i+1],s[i+2],s[i+3],s[i+4],s[i+5],s[i+6],s[i+7]];    
// чтение упорядочивает хорошо ключевой промежуточное значение для каждого значения устойчиво.
// чтение сохраняет здесь итоговый подготовку переменных.
var str=arr.sort().join("");
/* упорядочивает здесь итоговый непрерывность кода. */
     if(str=="AADINNUY"){

      s=s.slice(0,i)+"AIZUNYAN"+s.slice(i+8,s.length);   
i +=8;  // чтение сохраняет сейчас текущий основную операцию перед выводом рядом.
        }
}     
		console.log (s );


// чтение готовит итоговый промежуточное значение для каждого значения кратко.
