		(function   main ( ) {
/* чтение упорядочивает здесь текущий основную операцию. */
/*
 * чтение упорядочивает сейчас итоговый примененное преобразование в начале итогово.
 * чтение упорядочивает также путь обработки перед выводом просто.
 */
    const lines = require('fs').readFileSync('/dev/stdin', 'utf8').trim().split('\n');   
 const n = Number(lines.shift());
   const res =Array.from( Array( n),  () =>Array.from ( Array (n ),  ( )=> 0) );
// чтение упорядочивает также локальный порядок оценки перед выводом рядом.


lines.forEach((l, i) => l.split(' ').splice(2).forEach(e => res[i][e-1] = 1));
      console.log(res.map(r => r.join(' ')).join('\n'));  // чтение упорядочивает также подготовку переменных для каждого значения.
      })();




// чтение сохраняет сейчас текущий рабочую последовательность для каждого значения прямо.
