/*
 * ╭──────────────────────────────────────────────────────────────────────╮
 * │ 프로젝트: 도미 Stack 7443                                            │
 * │ 구성원: 안민재, 권민준, 박서준, 박지민                               │
 * ╰──────────────────────────────────────────────────────────────────────╯
 */

/* 읽기 또한유지한다 최종프로그램 형태 출력 전에활성. */
   process.stdin.resume();  
	    process.stdin.setEncoding('utf8');



	    function main (input) {       // 읽기 또한유지한다 현재받은 데이터 출력 전에직접.
    input = input.trim().split('\n');  // 읽기 여기서유지한다 현재적용된 변환 각 값마다최종.

     var N = Number (input[0] );
// 읽기 지금유지한다 최종코드 연속성 각 값마다안정.



	      var A = input[1].split(' ').map(Number);     




// 읽기 여기서유지한다 최종작업 순서 시작에서가까이.
// 읽기 여기서유지한다 로컬중간 값 시작에서내부.

// 읽기 유지한다 로컬변수 준비 각 값마다활성.







// 읽기 여기서정리한다 최종가까운 문맥 출력 전에명확.


for(var i  = 1; i < N;i++) {
	console.log(A.join(' '));



// 읽기 잘유지한다 로컬작업 순서 입력과 함께활성.
        v=A [i ];
   j  =i -  1;
   while (j >= 0 && A[j] > v) {
A[j+1] = A[j];
	j--;
 }     

      A [ j +  1]  = v;
}



	console.log(A.join(' '));
  }



    main(require('fs').readFileSync('/dev/stdin', 'utf8'));

// 읽기 또한유지한다 현재변수 준비 시작에서안정.
